[{"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6384611&contentType=Journals+%26+Magazines&ranges%3D2013_2013_p_Publication_Year%26matchBoolean%3Dtrue%26searchField%3DSearch_All%26queryText%3D%28p_Author_Affiliations%3ACisco%29", "features": " \n\t\t\tcarrier sense multiple access; \n\t\t\tdecentralised control; \n\t\t\ttelecommunication standards; \n\t\t\ttelecommunication traffic; \n\t\t\twireless LAN; \n\t\t\tCSMA; \n\t\t\tIEEE 802.11ac wireless networks; \n\t\t\tMAC parameters; \n\t\t\tcarrier sense multiple access communications; \n\t\t\tcross-layer design; \n\t\t\tdecentralized control; \n\t\t\tmultipacket reception channels; \n\t\t\tmultiuser-MIMO; \n\t\t\tnonchannel sensing protocol; \n\t\t\tphysical layers; \n\t\t\tslotted ALOHA; \n\t\t\tthroughput gain; \n\t\t\twireless local area networks; \n\t\t\tChannel models; \n\t\t\tIEEE 802.11 Standards; \n\t\t\tMarkov processes; \n\t\t\tMultiaccess communication; \n\t\t\tProtocols; \n\t\t\tThroughput; \n\t\t\tWireless LAN; \n\t\t\tCSMA; \n\t\t\tIEEE 802.11ac; \n\t\t\tMultiple access theory; \n\t\t\tcross-layer design; \n\t\t\tmultipacket reception; \n\t\t\tslotted ALOHA; \n\t\t\twireless local area networks;", "name": "Carrier Sense Multiple Access Communications on Multipacket Reception Channels: Theory and Applications to IEEE 802.11 Wireless Networks", "author": "Chan, D.S.Berger, T.Lang Tong", "series_t": "January 2013", "genre_s": "IEEE", "id": "0090-6778", "cat": "\n\t\t\tMultipacket reception (MPR) refers to physical layers where receivers can decode multiple simultaneously transmitted packets. In this paper we investigate the resulting performance of conjoining carrier sense multiple access (CSMA) communications with MPR. We report on its maximum achievable stable throughput with decentralized control and show there can be throughput gain over slotted ALOHA (S-ALOHA), the non-channel-sensing protocol of choice. However, this gain diminishes as the physical layer's MPR strength increases, thereby diminishing the need for channel sensing. Nonetheless, for systems evolving from a single-user (SU) to a multiple-user (MU) channel, CSMA can furnish significantly more efficient utilization of MPR capacity than S-ALOHA. This is meaningful in practice because the emerging generation of the widely deployed IEEE 802.11 wireless local area networks (WLAN) - 802.11ac - is adapting MPR and will operate in said region. In that regard, we also discuss the effective usage of a channel's resources for MPR and highlight the advantages multiuser-MIMO (MU-MIMO), an MPR technique, can offer to WLANs. Using early design specifications of 802.11ac, we show that the existing SU-oriented 802.11 MAC parameters can under-utilize the MPR capacity offered by a MU-oriented physical layer.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6365780&contentType=Journals+%26+Magazines&ranges%3D2013_2013_p_Publication_Year%26matchBoolean%3Dtrue%26searchField%3DSearch_All%26queryText%3D%28p_Author_Affiliations%3ACisco%29", "features": " \n\t\t\tageing; \n\t\t\tball grid arrays; \n\t\t\tbending; \n\t\t\tcircuit reliability; \n\t\t\tcopper alloys; \n\t\t\teutectic alloys; \n\t\t\tlead alloys; \n\t\t\tmechanical testing; \n\t\t\tprinted circuit design; \n\t\t\tprinted circuit testing; \n\t\t\tsilver alloys; \n\t\t\tsoldering; \n\t\t\tthermal stresses; \n\t\t\ttin alloys; \n\t\t\tPCB design variations; \n\t\t\tPCB materials; \n\t\t\tPCB pad cratering; \n\t\t\tSAC solder alloys; \n\t\t\tSnAgCu; \n\t\t\tSnPb; \n\t\t\taccelerated thermal cycling performance; \n\t\t\taging treatment; \n\t\t\tbending performance variations; \n\t\t\tdynamic performance; \n\t\t\tdynamic stresses; \n\t\t\tfour-point monotonic bend tests; \n\t\t\tintermetallic compounds growth; \n\t\t\tlead-free solder joint reliability; \n\t\t\tlead-free solder joints; \n\t\t\tlead-free solders; \n\t\t\tlong-term reliability; \n\t\t\tmemory module lead-free BGA; \n\t\t\tmemory module-type smaller lead-free ball grid array packages; \n\t\t\tpad design; \n\t\t\tpad interface; \n\t\t\tprinted circuit board design variations; \n\t\t\tshock resistance; \n\t\t\tthermal stresses; \n\t\t\ttrace designs; \n\t\t\ttrace width; \n\t\t\tAging; \n\t\t\tLead; \n\t\t\tReliability engineering; \n\t\t\tSoldering; \n\t\t\tStrain; \n\t\t\tWeb design; \n\t\t\tAccelerated thermal cycling (ATC); \n\t\t\tball grid array (BGA); \n\t\t\tlead-free; \n\t\t\tpad design; \n\t\t\treliability; \n\t\t\tsolder;", "name": "Effects of Board Design Variations on the Reliability of Lead-Free Solder Joints", "author": "Hongtao MaTae-Kyu Lee", "series_t": "Jan. 2013", "genre_s": "IEEE", "id": "2156-3950", "cat": "\n\t\t\tSn-Ag-Cu (SAC) solder alloys, such as Sn-3.0Ag-0.5 Cu (SAC305) are the popular choices of lead-free solders replacing SnPb solders. However, SAC solders are more brittle in nature due to stiffness and excessive intermetallic compounds growth at the solder joint to pad interface. This leads to higher risk of solder joints failures. Memory module-type smaller lead-free ball grid array (BGA) packages are constantly under dynamic stresses during handling and thermal stresses during operations. It is important to understand the dynamic performance and long-term reliability of memory module lead-free BGAs. It is believed that the printed circuit board (PCB) design variations cause dynamic and long-term failure discrepancies in the fields. In this paper, different pad and trace designs are introduced to evaluate the effects of PCB design variations on the bend and accelerated thermal cycling (ATC) performance of lead-free solder joints. Pad designs with nonsolder mask defined, solder mask defined (SMD), and a unique web design are assembled and tested. Different solder alloys, including SAC305, Sn-1.0Ag-0.5Cu (SAC105) SAC105, and SnPb solders, have been evaluated in this paper. Different PCB materials have also been evaluated in the test. Four-point monotonic bend tests are performed to characterize the bending performance variations with different PCB designs and compared with conventional Sn-Pb solder. The SMD pad is shown to have the best bend performance among all other types of designs in this paper. In addition, this design also shows improvement in mitigation of PCB pad cratering with lead-free solders. Wide trace width seems to degrade the strength and is not preferred. Just as it shows superior shock resistance when compared with SAC305, the SAC105 solder alloy also shows better bend performance. There is no significant improvement in bend performance with web design. After aging treatment, bend performance of both SAC305 and SAC105 degraded by up to 34% and 29%,- respectively. However, the bend performance of eutectic SnPb is actually improved after aging. ATC tests are performed to investigate the effects of design variations on the long-term reliability of lead-free solder joints; SMD design shows less reliability life than others. The implications of these results for the reliability of lead-free solder joints are discussed in this paper.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5744078&contentType=Journals+%26+Magazines&ranges%3D2013_2013_p_Publication_Year%26matchBoolean%3Dtrue%26searchField%3DSearch_All%26queryText%3D%28p_Author_Affiliations%3ACisco%29", "features": " \n\t\t\tdecision making; \n\t\t\tquality of service; \n\t\t\treconfigurable architectures; \n\t\t\tsearch problems; \n\t\t\tservice-oriented architecture; \n\t\t\tCDP; \n\t\t\tQoS-driven service composition; \n\t\t\tcompositional decision making process; \n\t\t\tconfiguration parameter settings; \n\t\t\tdecision space; \n\t\t\toptimal QoS-driven composition solutions; \n\t\t\tperformance gains; \n\t\t\trapid system composition; \n\t\t\trapid system deployment; \n\t\t\treconfigurable service modeling; \n\t\t\tsearch space reduction; \n\t\t\tservice composition decision making; \n\t\t\tservice-oriented architecture; \n\t\t\tsystem QoS requirements; \n\t\t\tAuthentication; \n\t\t\tConcrete; \n\t\t\tEncoding; \n\t\t\tMedia; \n\t\t\tQuality of service; \n\t\t\tXML; \n\t\t\tService-oriented architecture; \n\t\t\tquality of service (QoS); \n\t\t\treconfigurable services; \n\t\t\tservice composition;", "name": "QoS-Driven Service Composition with Reconfigurable Services", "author": "Hui MaBastani, F.I-Ling YenHong Mei", "series_t": "First Quarter 2013", "genre_s": "IEEE", "id": "1939-1374", "cat": "\n\t\t\tService-oriented architecture provides a framework for achieving rapid system composition and deployment. To satisfy different system QoS requirements, it is possible to select an appropriate set of concrete services and compose them to achieve the QoS goals. In addition, some of the services may be reconfigurable and provide various QoS tradeoffs. To make use of these reconfigurable services, the composition process should consider not only service selection, but also configuration parameter settings. However, existing QoS-driven service composition research does not consider reconfigurable services. Moreover, the decision space may be enormous when reconfigurable services are considered. In this paper, we deal with the issues of reconfigurable service modeling and efficient service composition decision making. We introduce a novel compositional decision making process, CDP, which explores optimal solutions of individual component services and uses the knowledge to derive optimal QoS-driven composition solutions. Experimental studies show that the CDP approach can significantly reduce the search space and achieve great performance gains. We also develop a case study system to validate the proposed approach and the results confirm the feasibility and effectiveness of reconfigurable services.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6482632&contentType=Early+Access+Articles&ranges%3D2013_2013_p_Publication_Year%26matchBoolean%3Dtrue%26searchField%3DSearch_All%26queryText%3D%28p_Author_Affiliations%3ACisco%29", "features": " \n\t\t\tcryptographic protocols; \n\t\t\tLCMQ entity authentication protocol; \n\t\t\tciphertext only attack; \n\t\t\tcirculant matrix; \n\t\t\tcommunication cost; \n\t\t\tlightweight authentication protocol; \n\t\t\tlinear independence; \n\t\t\tlow cost RFID tags; \n\t\t\tmatrix vectors; \n\t\t\tmultivariate quadratic problem; \n\t\t\tprobabilistic polynomial time adversary; \n\t\t\tsecure encryption; \n\t\t\tstorage expense; \n\t\t\tAuthentication; \n\t\t\tNoise; \n\t\t\tPolynomials; \n\t\t\tProtocols; \n\t\t\tRadiofrequency identification; \n\t\t\tVectors; \n\t\t\tHB; \n\t\t\tLCMQ; \n\t\t\tLearning parity with noise; \n\t\t\tcirculant matrix; \n\t\t\tlightweight entity authentication; \n\t\t\tmultivariate quadratic;", "name": "Secure and Efficient LCMQ Entity Authentication Protocol", "author": "Zhijun LiGuang GongZhiguang Qin", "series_t": "June 2013", "genre_s": "IEEE", "id": "0018-9448", "cat": "\n\t\t\tThe simple, computationally efficient HB-like entity authentication protocols based on the learning parity with noise (LPN) problem have attracted a great deal of attention in the past few years due to the broad application prospect in low-cost RFID tags. However, all previous protocols are vulnerable to a man-in-the-middle attack discovered by Ouafi, Overbeck, and Vaudenay. In this paper, we propose a lightweight authentication protocol named LCMQ and prove it secure in a general man-in-the-middle model. The technical core in our proposal is a special type of circulant matrix, for which we prove the linear independence of matrix vectors, present efficient algorithms on matrix operations, and describe a secure encryption against ciphertext-only attack. By combining all of those with LPN and related to the multivariate quadratic problem, the LCMQ protocol not only is provably secure against all probabilistic polynomial-time adversaries, but also transcends HB-like protocols in terms of tag's computation overhead, storage expense, and communication cost.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6403599&contentType=Early+Access+Articles&ranges%3D2013_2013_p_Publication_Year%26matchBoolean%3Dtrue%26searchField%3DSearch_All%26queryText%3D%28p_Author_Affiliations%3ACisco%29", "features": " \n\t\t\tprobability; \n\t\t\tprotocols; \n\t\t\twireless sensor networks; \n\t\t\tDHT-based protocol; \n\t\t\tchecking system; \n\t\t\tcommunication overhead; \n\t\t\tdistributed hash table; \n\t\t\thigh security level; \n\t\t\tkey-based caching; \n\t\t\tnode clone detection protocol; \n\t\t\tprobabilistic directed forwarding technique; \n\t\t\tprobability model; \n\t\t\trandomly directed exploration; \n\t\t\tsatisfactory detection probability; \n\t\t\tsecond distributed detection protocol; \n\t\t\tstorage consumption; \n\t\t\twireless sensor networks; \n\t\t\tCloning; \n\t\t\tMathematical model; \n\t\t\tMeasurement; \n\t\t\tProtocols; \n\t\t\tSecurity; \n\t\t\tWireless sensor networks; \n\t\t\tDistributed detection; \n\t\t\tdistributed hash table; \n\t\t\tnode clone attack; \n\t\t\trandomly directed exploration; \n\t\t\twireless sensor networks (WSNs);", "name": "On the Node Clone Detection in Wireless Sensor Networks", "author": "Zhijun LiGuang Gong", "series_t": "Dec. 2013", "genre_s": "IEEE", "id": "1063-6692", "cat": "\n\t\t\tWireless sensor networks are vulnerable to the node clone, and several distributed protocols have been proposed to detect this attack. However, they require too strong assumptions to be practical for large-scale, randomly deployed sensor networks. In this paper, we propose two novel node clone detection protocols with different tradeoffs on network conditions and performance. The first one is based on a distributed hash table (DHT), by which a fully decentralized, key-based caching and checking system is constructed to catch cloned nodes effectively. The protocol performance on efficient storage consumption and high security level is theoretically deducted through a probability model, and the resulting equations, with necessary adjustments for real application, are supported by the simulations. Although the DHT-based protocol incurs similar communication cost as previous approaches, it may be considered a little high for some scenarios. To address this concern, our second distributed detection protocol, named randomly directed exploration, presents good communication performance for dense sensor networks, by a probabilistic directed forwarding technique along with random initial direction and border determination. The simulation results uphold the protocol design and show its efficiency on communication overhead and satisfactory detection probability.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6465543&contentType=Conference+Publications&ranges%3D2013_2013_p_Publication_Year%26matchBoolean%3Dtrue%26searchField%3DSearch_All%26queryText%3D%28p_Author_Affiliations%3ACisco%29", "features": " \n\t\t\tcognitive radio; \n\t\t\tquality of service; \n\t\t\tqueueing theory; \n\t\t\tscheduling; \n\t\t\ttelecommunication network routing; \n\t\t\tCRN; \n\t\t\tFCFS; \n\t\t\tQPBS; \n\t\t\tQoS; \n\t\t\tcognitive node; \n\t\t\tcognitive radio environment; \n\t\t\tcognitive radio networks; \n\t\t\tdecision power; \n\t\t\tdelay sensitive applications; \n\t\t\tfirst come first serve; \n\t\t\tmathematical modeling; \n\t\t\tmultiple node scenario; \n\t\t\tprimary users; \n\t\t\tquality of service perspective; \n\t\t\tqueue proportional batch scheduling; \n\t\t\tqueuing system; \n\t\t\trandom ON/OFF periods; \n\t\t\trouting; \n\t\t\tscheduling disciplines; \n\t\t\tscheduling schemes; \n\t\t\tCognitive radio; \n\t\t\tDelay; \n\t\t\tMathematical model; \n\t\t\tQuality of service; \n\t\t\tQueueing analysis; \n\t\t\tServers; \n\t\t\tSimulation; \n\t\t\tCRN; \n\t\t\tFCFS scheduling; \n\t\t\tQPBS; \n\t\t\tQoS; \n\t\t\tStrict Priority Scheduling;", "name": "A comparative study of scheduling schemes for cognitive radio networks: A quality of service perspective", "author": "Swarup, V.M.Ribeiro, V.J.Gupta, A.", "series_t": "7-10 Jan. 2013", "genre_s": "IEEE", "id": "978-1-4673-5330-4", "cat": "\n\t\t\tQuality of Service (QoS) based scheduling in Cognitive radio networks (CRN) is a pressing research problem. The objective of this work is to study the feasibility of using CRN for delay sensitive applications in the presence of primary users with random ON/OFF periods. The first contribution of this work is the modeling of a cognitive node as a Queuing system and characterization of the average delay encountered by a packet on a cognitive node for various scheduling disciplines. This delay characterization gives the application/user the decision power to choose whether to transmit using a particular node depending upon the delay and rate requirements. It also gives the designer of higher layer the ability to make more informed decisions for routing in a multiple node scenario. The second contribution of this work is a comparative study of various scheduling disciplines in a cognitive radio environment. We have considered First Come First Serve (FCFS), strict priority and a proposed Queue Proportional Batch Scheduling (QPBS). QPBS maintains a balance between priority and fairness as opposed to the strict priority scheduling where the fairness is sacrificed at the cost of priority and FCFS where there is no notion of priority. This comparative study clearly brings out the relative pros and cons of aforementioned scheduling schemes in a cognitive radio environment. A discrete event based simulation study has been performed to verify the efficacy of mathematical modeling and validate the results.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6480846&contentType=Journals+%26+Magazines&ranges%3D2013_2013_p_Publication_Year%26matchBoolean%3Dtrue%26searchField%3DSearch_All%26queryText%3D%28p_Author_Affiliations%3ACisco%29", "features": " \n\t\t\tthree-dimensional integrated circuits; \n\t\t\t3D IC; \n\t\t\t3D integrated circuits; \n\t\t\tcapacitance circuit model; \n\t\t\tconductance; \n\t\t\tcoupled TSV array; \n\t\t\telectromagnetic solver; \n\t\t\tfrequency dependent resistance; \n\t\t\tinductance; \n\t\t\tinterposer; \n\t\t\tmultiport TSV networks; \n\t\t\tpower integrity analysis; \n\t\t\tstacked chips; \n\t\t\tthrough silicon via; \n\t\t\tCapacitance; \n\t\t\tImpedance; \n\t\t\tInductance; \n\t\t\tIntegrated circuit modeling; \n\t\t\tSilicon; \n\t\t\tSolid modeling; \n\t\t\tThrough-silicon vias; \n\t\t\t3-D integration; \n\t\t\tconductance and capacitance (RLGC) matrices; \n\t\t\tcrosstalk; \n\t\t\tinductance; \n\t\t\tmodeling; \n\t\t\tpackaging; \n\t\t\tpower delivery; \n\t\t\tresistance; \n\t\t\tthrough-silicon via (TSV);", "name": "Modeling and Application of Multi-Port TSV Networks in 3-D IC", "author": "Wei YaoSiming PanAchkir, B.Jun FanLei He", "series_t": "April 2013", "genre_s": "IEEE", "id": "0278-0070", "cat": "\n\t\t\tThrough-silicon-via (TSV) enables vertical connectivity between stacked chips or interposer and is a key technology for 3-D integrated circuits (ICs). While arrays of TSVs are needed in 3-D IC, there only exists a frequency-dependent resistance, inductance, conductance and capacitance circuit model for a pair of TSVs with coupling between them. In this paper, we develop a simple yet accurate circuit model for a multiport TSV network (e.g., coupled TSV array) by decomposing the network into a number of TSV pairs and then applying circuit models for each of them. We call the new model a pair-based model for the multiport TSV network. It is first verified against a commercial electromagnetic solver for up to 20 GHz and subsequently employed for a variety of examples for signal and power integrity analysis.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6248956&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DValidated+methodology+for+short-design-cycle+chip%2C+package+and+system+interaction", "features": " \n\t\t\tchip scale packaging; \n\t\t\tfatigue; \n\t\t\tintegrated circuit design; \n\t\t\tintegrated circuit interconnections; \n\t\t\tintegrated circuit reliability; \n\t\t\tball attach; \n\t\t\tbill of materials; \n\t\t\tboard level assembly parameters; \n\t\t\tbump design; \n\t\t\tbump fatigue life; \n\t\t\tchip attach; \n\t\t\tchip design variables; \n\t\t\tchip level interconnects; \n\t\t\tchip package system interaction design parameter; \n\t\t\tchip thickness; \n\t\t\tdesign iterations; \n\t\t\tdesign rules; \n\t\t\tdesign time; \n\t\t\tdie level stresses; \n\t\t\tfinite element models; \n\t\t\tintegrated circuit reliability; \n\t\t\tlearning cycle test vehicles; \n\t\t\tlid attachment; \n\t\t\tnext generation on-demand cloud computing; \n\t\t\toptimal system level solution; \n\t\t\tpackage warpage; \n\t\t\tproduct reliability; \n\t\t\tprototype iterations; \n\t\t\tshort design cycle chip; \n\t\t\tsize 40 nm; \n\t\t\tsubstrate thickness; \n\t\t\tsystem level features; \n\t\t\tunderfill material; \n\t\t\tAssembly; \n\t\t\tBoundary conditions; \n\t\t\tComputational modeling; \n\t\t\tFatigue; \n\t\t\tNumerical models; \n\t\t\tSubstrates; \n\t\t\tCPI; \n\t\t\tCPSI; \n\t\t\tChip Package System Interaction; \n\t\t\tChip Package co-design; \n\t\t\tChip Stacking; \n\t\t\tFCBGA; \n\t\t\tMiniaturization; \n\t\t\tReliability; \n\t\t\tSlice Model; \n\t\t\tTSVs; \n\t\t\tWarpage;", "name": "Validated methodology for short-design-cycle chip, package and system interaction", "author": "Ahmad, M.Qiang WangWeidong Xie", "series_t": "May 29 2012-June 1 2012", "genre_s": "IEEE", "id": "978-1-4673-1966-9", "cat": "\n\t\t\tWhile in the past, the silicon, package and system could be designed sequentially, at silicon nodes less than 40nm, the interconnects between the chip, package and system are becoming the limiting factor in performance and reliability. Hardware designers need to know upfront, what tradeoffs they need to make, to design an optimal system level solution. Quantitative estimates on the optimal package materials, assembly processes and design rules are required upfront as opposed to much later in the design process: In the past, several iterations of learning cycle test vehicles and modeling were used to address some of these questions, but with design cycles shrinking to less than a year in some cases, there is no time for repeated learning cycles and qualitative numerical models that only give general trends. Consequently, the industry needs a methodology that can give optimal Chip Package System Interaction (CPSI) design parameter ranges and reduce the number of prototype iterations. A key requirement in CPSI is the ability to accurately scale from chip level interconnects (on the order of a few microns), to system level features (on the order of several millimeters). Historically, CPSI has been evaluated using conventional finite element models in which smeared or submodeling techniques were used to approximate the mechanics of the assembly. Such approximations were necessary to achieve manageable computation times. However, these approximations have relegated the numerical models to qualitative trend assessments as opposed to a more regimented quantitative analysis. In this paper, a complete methodology is presented, that can more accurately capture the mechanics of CPSI without requiring unreasonable computation time for multiple design iterations. The methodology is a combination of experimental evaluation and numerical analysis. Both used iteratively achieve the intended purpose: reduce overall design time with less cost and design iterations giving quantitative- estimates. Each process step, starting from chip attach and ending with ball attach and board level assembly, was experimentally characterized for the 40nm silicon node Bill of Materials (BOM) and compared against numerical models. The iterative experimental correlation and the resulting model methodology are outlined in detail in this paper. Having experimentally validated the methodology, the effects of chip thickness, substrate thickness, bump design, underfill material, lid, stiffener and lid attachment on package warpage were determined and compared with experimental data. The corresponding impact of these factors on bump fatigue life and die level stresses was also determined. The relationship between board level assembly parameters and package and chip design variables was also determined. Finally, next generation on-demand cloud computing resources were used to further reduce computation times without sacrificing accuracy. A parametric study of the computing resources and processing times was also performed to help designers select the best computing resources for optimal design for faster times to market and product reliability.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6187357&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DConsiderations+for+big+data%3A+Architecture+and+approach", "features": " \n\t\t\tSQL; \n\t\t\tdata analysis; \n\t\t\tApache Hadoop project; \n\t\t\tHBase database; \n\t\t\tHadoop cluster; \n\t\t\tHadoop distributed file system; \n\t\t\tMapReduce; \n\t\t\tNoSQL; \n\t\t\tarchitectural approach; \n\t\t\tdata management; \n\t\t\tdata storage; \n\t\t\tunstructured data analysis; \n\t\t\tAvailability; \n\t\t\tBenchmark testing; \n\t\t\tComputer architecture; \n\t\t\tDistributed databases; \n\t\t\tFile systems; \n\t\t\tRelational databases;", "name": "Considerations for big data: Architecture and approach", "author": "Bakshi, K.", "series_t": "3-10 March 2012", "genre_s": "IEEE", "id": "978-1-4577-0556-4", "cat": "\n\t\t\tThe amount of data in our industry and the world is exploding. Data is being collected and stored at unprecedented rates. The challenge is not only to store and manage the vast volume of data (“big data”), but also to analyze and extract meaningful value from it. There are several approaches to collecting, storing, processing, and analyzing big data. The main focus of the paper is on unstructured data analysis. Unstructured data refers to information that either does not have a pre-defined data model or does not fit well into relational tables. Unstructured data is the fastest growing type of data, some example could be imagery, sensors, telemetry, video, documents, log files, and email data files. There are several techniques to address this problem space of unstructured analytics. The techniques share a common characteristics of scale-out, elasticity and high availability. MapReduce, in conjunction with the Hadoop Distributed File System (HDFS) and HBase database, as part of the Apache Hadoop project is a modern approach to analyze unstructured data. Hadoop clusters are an effective means of processing massive volumes of data, and can be improved with the right architectural approach.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6193505&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DSelf-verifying+names+for+read-only+named+data", "features": " \n\t\t\tcomputer network security; \n\t\t\tdigital signatures; \n\t\t\tICN authentication; \n\t\t\tcontent-centric networking; \n\t\t\tdigital signature; \n\t\t\tinformation-centric networks; \n\t\t\tnamed data authenticity; \n\t\t\tnamed data integrity; \n\t\t\tread-only named data; \n\t\t\tselfverifying names; \n\t\t\tAuthentication; \n\t\t\tCatalogs; \n\t\t\tDigital signatures; \n\t\t\tPublic key; \n\t\t\tReceivers;", "name": "Self-verifying names for read-only named data", "author": "Baugher, M.Davie, B.Narayanan, A.Oran, D.", "series_t": "25-30 March 2012", "genre_s": "IEEE", "id": "978-1-4673-1016-1", "cat": "\n\t\t\tInformation-centric networks must ensure the authenticity and integrity of named data. ICN designs such as Content-Centric Networking apply a digital signature to a collection of packets for this purpose. This paper shifts the mode of ICN authentication: Self-verifying names ensure data authenticity for read-only named data; signatures or other means ensure name authenticity. The paper considers how self-verifying names might be used in CCN.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6175510&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DDoes+your+system+have+sufficient+diagnostics+coverage%3F", "features": " \n\t\t\telectronic products; \n\t\t\tfailure analysis; \n\t\t\tfault diagnosis; \n\t\t\tFIT; \n\t\t\tFMEA process; \n\t\t\tSFM; \n\t\t\tdiagnostics coverage; \n\t\t\telectronic product; \n\t\t\tfailure mode-and-effect analysis; \n\t\t\tfault insertion test; \n\t\t\tsystem diagnostics; \n\t\t\tsystem fault management; \n\t\t\tCircuit faults; \n\t\t\tHardware; \n\t\t\tManufacturing; \n\t\t\tRuntime; \n\t\t\tSoftware; \n\t\t\tSoftware reliability; \n\t\t\tCoverage; \n\t\t\tDiagnostics; \n\t\t\tFIT; \n\t\t\tFMEA; \n\t\t\tHardware; \n\t\t\tPrognostics; \n\t\t\tReliability; \n\t\t\tSoftware; \n\t\t\tTestability;", "name": "Does your system have sufficient diagnostics coverage?", "author": "Bidokhti, N.Loeser, M.", "series_t": "23-26 Jan. 2012", "genre_s": "IEEE", "id": "978-1-4577-1849-6", "cat": "\n\t\t\tThis paper discusses the value of clear and solid requirements that are the baseline of a system fault management (SFM). It explaines the Failure Modes & Effect Analysis (FMEA) process, how to perform a FMEA, how FMEA is tied to Fault Insertion Test (FIT) and also describes FIT, system diagnostics and its benefits. Finally, each element discussed in this paper has its own value, but as a combination, they have significantly greater impact on product robustness. All parts of the system fault management methodology that are discussed in this paper have been implemented in various electronic products with great results.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6248946&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DBehavioral+model+of+switching+DC-DC+converter+for+improving+power+delivery+network+design", "features": " \n\t\t\tDC-DC power convertors; \n\t\t\tfeedback; \n\t\t\tlocal area networks; \n\t\t\tswitching convertors; \n\t\t\tswitching networks; \n\t\t\tEthernet switching system; \n\t\t\tbehavioral model; \n\t\t\tfeedback loop; \n\t\t\tsignal integrity simulation tool; \n\t\t\tswitching buck DC-DC converter; \n\t\t\tswitching frequency setting; \n\t\t\tsystem power delivery network design; \n\t\t\tCapacitors; \n\t\t\tEquations; \n\t\t\tInductors; \n\t\t\tLoad modeling; \n\t\t\tMathematical model; \n\t\t\tSwitches; \n\t\t\tVoltage control;", "name": "Behavioral model of switching DC-DC converter for improving power delivery network design", "author": "Seungyong BaekPun, P.Agrawal, A.", "series_t": "May 29 2012-June 1 2012", "genre_s": "IEEE", "id": "978-1-4673-1966-9", "cat": "\n\t\t\tIn this paper, we propose a behavioral model for the buck DC-DC switching converter to improve the system power delivery network design. The model is simple to implement in signal integrity simulation tool and incorporates switching frequency setting and placement of sense point for the feedback loop. We apply the model to the Ethernet switching system and correlate with measurement results. The model agrees very well with the measurements.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6239684&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DManaging+Complex+Boundary-Scan+Operations", "features": " \n\t\t\tIEEE standards; \n\t\t\tboundary scan testing; \n\t\t\tlogic circuits; \n\t\t\tlogic testing; \n\t\t\tIEEE 1149.1 standard; \n\t\t\tTest Access Port and Boundary-Scan Architecture; \n\t\t\tboard-level complexity; \n\t\t\tboard-level test access; \n\t\t\tcomplex boundary-scan operations; \n\t\t\tcomponent-level density; \n\t\t\tlogic test; \n\t\t\tsignal integrity; \n\t\t\ttiming; \n\t\t\tBoundary conditions; \n\t\t\tComplexity theory; \n\t\t\tIEEE standards; \n\t\t\tIP networks; \n\t\t\tRegisters; \n\t\t\tTesting;", "name": "Managing complex boundary-scan operations", "author": "Eklow, B.", "series_t": "April 2012", "genre_s": "IEEE", "id": "0740-7475", "cat": "\n\t\t\tThe IEEE 1149.1 Standard for Test Access Port and Boundary-Scan Architecture was approved and released in 1990. Since that time, there have been two supplements and one revision to the standard. A second revision is currently in process. The 1149.1 standard was originally developed to address board level test access issues while at the same time enabling access to test logic inside the device. As technology has scaled over the last 20+ years, component and board level density and complexity have grown significantly. A new class of defects (Timing, Power, Signal Integrity) has also become more prevalent and much more difficult to detect.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6237854&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAn+analytical+approximation+for+evaluating+impact+of+skew+length+on+radiated+emission+from+differential+signal+pairs", "features": " \n\t\t\tapproximation theory; \n\t\t\telectromagnetic interference; \n\t\t\tnumerical analysis; \n\t\t\tprinted circuit layout; \n\t\t\tprinted circuits; \n\t\t\t3-dimensional numerical electromagnetic simulations; \n\t\t\tEMI; \n\t\t\tanalytical approximation; \n\t\t\tdifferential pair pitch; \n\t\t\tdifferential signal pairs; \n\t\t\tdifferential signal traces; \n\t\t\telectromagnetic interference radiation; \n\t\t\telectromagnetic radiation; \n\t\t\thigh speed printed circuit board layout; \n\t\t\tnumerical simulation tool; \n\t\t\tradiated emission; \n\t\t\tradiation power; \n\t\t\tskew control; \n\t\t\tskew length;", "name": "An analytical approximation for evaluating impact of skew length on radiated emission from differential signal pairs", "author": "Hongmei FanXiaoxia ZhouBhobe, A.Jinghan YuHailong ZhangSochoux, P.", "series_t": "21-24 May 2012", "genre_s": "IEEE", "id": "978-1-4577-1557-0", "cat": "\n\t\t\tIn high speed printed circuit board layout, there usually exist skews between a pair of differential signal traces. In this paper the impact of skew length on electromagnetic interference radiation from differential pairs is investigated. The radiation power is analytically approximated and agreed with numerical simulation tool. It is found that skew control can be done according to the differential pair pitch instead of frequency.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6192064&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DCycle-slips+in+100G+DP-QPSK+transmission+systems", "features": " \n\t\t\tPoisson distribution; \n\t\t\toptical modulation; \n\t\t\toptical transceivers; \n\t\t\tphase noise; \n\t\t\tprobability; \n\t\t\tquadrature phase shift keying; \n\t\t\tsuperradiance; \n\t\t\t100G DP-QPSK transceiver; \n\t\t\t100G DP-QPSK transmission systems; \n\t\t\tPoisson distributed slip events; \n\t\t\tViterbi-and-Viterbi carrier recovery; \n\t\t\tamplified spontaneous emission; \n\t\t\tcycle slip probability; \n\t\t\tcycle slips; \n\t\t\tnonlinear phase noise; \n\t\t\treal time measurements; \n\t\t\tAmplitude shift keying; \n\t\t\tBit error rate; \n\t\t\tEncoding; \n\t\t\tJoints; \n\t\t\tOptical filters; \n\t\t\tOptical noise; \n\t\t\tSignal to noise ratio;", "name": "Cycle-slips in 100G DP-QPSK transmission systems", "author": "Fludger, C.R.S.Nuss, D.Kupfer, T.", "series_t": "4-8 March 2012", "genre_s": "IEEE", "id": "978-1-4673-0262-3", "cat": "\n\t\t\tWe present real-time measurements of the cycle-slip probabilities of a 100G DP-QPSK transceiver using a Viterbi-and-Viterbi carrier recovery. ASE and non-linear phase noise generated Poisson distributed slip events with mean probabilities between 10-12 to 10-3.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6146481&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DElastic+optical+networking%3A+a+new+dawn+for+the+optical+layer%3F", "features": " \n\t\t\tInternet; \n\t\t\tmultimedia communication; \n\t\t\toptical switches; \n\t\t\toptical transceivers; \n\t\t\ttelecommunication traffic; \n\t\t\twavelength division multiplexing; \n\t\t\tInternet; \n\t\t\tcontent provider; \n\t\t\telastic optical networking; \n\t\t\texponential growth; \n\t\t\tmultimedia service; \n\t\t\ton-off modulation; \n\t\t\toptical spectrum; \n\t\t\tsophisticated modulation scheme; \n\t\t\ttraffic source; \n\t\t\twavelength grid; \n\t\t\tAdaptive optics; \n\t\t\tBandwidth; \n\t\t\tBit rate; \n\t\t\tModulation; \n\t\t\tOptical fiber networks; \n\t\t\tOptical switches; \n\t\t\tTransceivers;", "name": "Elastic optical networking: a new dawn for the optical layer?", "author": "Gerstel, O.Jinno, M.Lord, A.Yoo, S.J.B.", "series_t": "February 2012", "genre_s": "IEEE", "id": "0163-6804", "cat": "\n\t\t\tOptical networks are undergoing significant changes, fueled by the exponential growth of traffic due to multimedia services and by the increased uncertainty in predicting the sources of this traffic due to the ever changing models of content providers over the Internet. The change has already begun: simple on-off modulation of signals, which was adequate for bit rates up to 10 Gb/s, has given way to much more sophisticated modulation schemes for 100 Gb/s and beyond. The next bottleneck is the 10-year-old division of the optical spectrum into a fixed \"wavelength grid,\" which will no longer work for 400 Gb/s and above, heralding the need for a more flexible grid. Once both transceivers and switches become flexible, a whole new elastic optical networking paradigm is born. In this article we describe the drivers, building blocks, architecture, and enabling technologies for this new paradigm, as well as early standardization efforts.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6175453&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DReliability+and+availability+analysis+for+large+networking+system", "features": " \n\t\t\tIP networks; \n\t\t\tMarkov processes; \n\t\t\telectronic commerce; \n\t\t\treliability; \n\t\t\tExcel format; \n\t\t\tIP based system; \n\t\t\tactive standby; \n\t\t\tavailability analysis; \n\t\t\tbusiness application; \n\t\t\tcommunication network; \n\t\t\tcomplex IP networking system; \n\t\t\tcomplex redundancy behavior; \n\t\t\tconverged IP network; \n\t\t\te-commerce; \n\t\t\tengineering community; \n\t\t\tload-sharing redundant scheme; \n\t\t\tplanned software upgrades; \n\t\t\tredundant components; \n\t\t\treliability analysis; \n\t\t\treliability modeling tool; \n\t\t\tsteady state Markov transition diagrams; \n\t\t\tswitchover success probability; \n\t\t\tswitchover time; \n\t\t\tunplanned hardware failures; \n\t\t\tunplanned software failures; \n\t\t\tAvailability; \n\t\t\tIP networks; \n\t\t\tMarkov processes; \n\t\t\tRedundancy; \n\t\t\tSoftware; \n\t\t\tSwitches; \n\t\t\tredundancy; \n\t\t\treliability modeling;", "name": "Reliability and availability analysis for large networking system", "author": "Haihong Zhu", "series_t": "23-26 Jan. 2012", "genre_s": "IEEE", "id": "978-1-4577-1849-6", "cat": "\n\t\t\tMore business applications such as voice, e-commerce, storage and trading are migrated from single purpose communication network to converged IP network, thus the reliability and availability of an IP based system becomes critical. A reliability modeling tool is needed to analyze the reliability and availability of the complex IP networking system. The modeling tool needs to capture complex redundancy behavior, including M-of-N redundancy, imperfect switchover, unplanned hardware and software failures as well as planned software upgrades. Meanwhile, the tool needs to be user friendly for the engineering community. In this paper, we developed a reliability and availability analysis tool for large IP based networking system. The tool uses steady state markov transition diagrams to model the availability of M-of-N redundant components, active-standby and load-sharing redundant schemes, switchover success probability, switchover time, and both unplanned and planned failures. A user-friendly Excel format is also developed to make the complicated model easy to use.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6212070&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DIntegrated+and+autonomic+cloud+resource+scaling", "features": " \n\t\t\tcloud computing; \n\t\t\tresource allocation; \n\t\t\tauto-scaling capability; \n\t\t\tcloud data center; \n\t\t\tcloud management system; \n\t\t\tcloud resource auto-scaling system; \n\t\t\tcloud resource scaling; \n\t\t\tcloud service interface; \n\t\t\tcloud service provider; \n\t\t\tcompute domain; \n\t\t\tenterprise on-demand; \n\t\t\tnetwork domain; \n\t\t\tstorage domain; \n\t\t\tthresholding mechanism; \n\t\t\tComputer architecture; \n\t\t\tConferences; \n\t\t\tCorrelation; \n\t\t\tFires; \n\t\t\tLoad modeling; \n\t\t\tMeasurement; \n\t\t\tMonitoring; \n\t\t\tCloud resource scaling; \n\t\t\tautonomic scaling; \n\t\t\tcloud computing; \n\t\t\tintegrated compute; \n\t\t\tperformance metrics; \n\t\t\tstorage and network domain scaling; \n\t\t\tvirtualized resources;", "name": "Integrated and autonomic cloud resource scaling", "author": "Hasan, M.Z.Magana, E.Clemm, A.Tucker, L.Gudreddi, S.L.D.", "series_t": "16-20 April 2012", "genre_s": "IEEE", "id": "978-1-4673-0267-8", "cat": "\n\t\t\tA Cloud is a very dynamic environment where resources offered by a Cloud Service Provider (CSP), out of one or more Cloud Data Centers (DCs) are acquired or released (by an enterprise (tenant) on-demand and at any scale. Typically a tenant will use Cloud service interfaces to acquire or release resources directly. This process can be automated by a CSP by providing auto-scaling capability where a tenant sets policies indicating under what condition resources should be auto-scaled. This is specially needed in a Cloud environment because of the huge scale at which a Cloud operates. Typical solutions are naïve causing spurious auto-scaling decisions. For example, they are based on only thresholding triggers and the thresholding mechanisms themselves are not Cloud-ready. In a Cloud, resources from three separate domains, compute, storage and network, are acquired or released on-demand. But in typical solutions resources from these three domains are not auto-scaled in an integrated fashion. Integrated auto-scaling prevents further spurious scaling and reduces the number of auto-scaling systems to be supported in a Cloud management system. In addition, network resources typically are not auto-scaled. In this paper we describe a Cloud resource auto-scaling system that addresses and overcomes above limitations.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6209507&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DSerDes+Interoperability+and+Optimization", "features": " \n\t\t\telectronic engineering computing; \n\t\t\tembedded systems; \n\t\t\topen systems; \n\t\t\toptimisation; \n\t\t\tperipheral interfaces; \n\t\t\tIEEE P1687 standard; \n\t\t\tJTAG; \n\t\t\tSerDes interoperability; \n\t\t\tembedded link transmit; \n\t\t\tsystem diagnostic software layer; \n\t\t\tsystem optimization; \n\t\t\tsystem-level applications; \n\t\t\tApplication specific integrated circuits; \n\t\t\tBit error rate; \n\t\t\tIP networks; \n\t\t\tInstruments; \n\t\t\tOptimization; \n\t\t\tSoftware; \n\t\t\tStandards; \n\t\t\tASIC; \n\t\t\tBER; \n\t\t\tBERT; \n\t\t\tCDR; \n\t\t\tJTAG; \n\t\t\tP1687; \n\t\t\tPRBS; \n\t\t\tSPMT; \n\t\t\tSerDes; \n\t\t\tSerDes Characterization; \n\t\t\tSystem Test;", "name": "SerDes Interoperability and Optimization", "author": "Kamm, M.Hongshin JunBoluna, L.", "series_t": "Oct. 2012", "genre_s": "IEEE", "id": "0740-7475", "cat": "\n\t\t\tAs SerDes use in system-level applications increases, interoperability and overall system optimization become greater challenges. This work presents a solution to these problems utilizing the combination of embedded link transmit and receive tests via system diagnostics software layer, JTAG, and the upcoming IEEE P1687 standard.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5738326&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DDifferential+Extrapolation+Method+for+Separating+Dielectric+and+Rough+Conductor+Losses+in+Printed+Circuit+Boards", "features": " \n\t\t\tadhesion; \n\t\t\tconductors (electric); \n\t\t\tdielectric losses; \n\t\t\textrapolation; \n\t\t\tpermittivity; \n\t\t\tprinted circuit interconnections; \n\t\t\tprinted circuits; \n\t\t\tscanning electron microscopy; \n\t\t\tsurface roughness; \n\t\t\tPCB substrate dielectrics; \n\t\t\taverage peak-to-valley amplitude; \n\t\t\tconductor roughness; \n\t\t\tdielectric loss; \n\t\t\tdifferential extrapolation method; \n\t\t\tdistance-to-ground planes; \n\t\t\thigh-speed digital designs; \n\t\t\tprinted circuit board transmission lines; \n\t\t\tprinted circuit boards interconnects; \n\t\t\trough conductor loss; \n\t\t\tscanning electron microscopy images; \n\t\t\tsignal trace geometry parameters; \n\t\t\tsurface roughness; \n\t\t\tthree transmission lines; \n\t\t\tConductors; \n\t\t\tDielectric losses; \n\t\t\tRough surfaces; \n\t\t\tSurface impedance; \n\t\t\tSurface roughness; \n\t\t\tTransmission line measurements; \n\t\t\t<formula formulatype=\"inline\"><tex Notation=\"TeX\">$hbox{S}$</tex></formula>-parameters; \n\t\t\tConductor surface roughness; \n\t\t\tdielectric constant (Dk); \n\t\t\tdissipation factor (Df); \n\t\t\tloss tangent; \n\t\t\tprinted circuit board (PCB);", "name": "Differential Extrapolation Method for Separating Dielectric and Rough Conductor Losses in Printed Circuit Boards", "author": "Koul, A.Koledintseva, M.Y.Hinaga, S.Drewniak, J.L.", "series_t": "April 2012", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tCopper foil in printed circuit board (PCB) transmission lines/interconnects is roughened to promote adhesion to dielectric substrates. It is important to characterize PCB substrate dielectrics and correctly separate dielectric and conductor losses, especially as data rates in high-speed digital designs increase. Herein, a differential method is proposed for separating conductor and dielectric losses in PCBs with rough conductors. This approach requires at least three transmission lines with identical, or at least as close as technologically possible, basic geometry parameters of signal trace, distance-to-ground planes, and dielectric properties, while the average peak-to-valley amplitude of surface roughness of the conductor would be different. The peak-to-valley amplitude of conductor roughness is determined from scanning electron microscopy images.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6167526&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DIntelligent+interface+switching+among+heterogeneous+wireless+networks+for+vehicular+communications", "features": " \n\t\t\tdynamic programming; \n\t\t\tstochastic programming; \n\t\t\tvehicular ad hoc networks; \n\t\t\tSDP-based policy; \n\t\t\theterogeneous wireless networks; \n\t\t\tintelligent interface switching; \n\t\t\tmultiple wireless networks; \n\t\t\toptimization framework; \n\t\t\tstochastic dynamic programming; \n\t\t\tuser preferences; \n\t\t\tvehicular communications; \n\t\t\tAd hoc networks; \n\t\t\tIEEE 802.11 Standards; \n\t\t\tMeasurement; \n\t\t\tOptimization; \n\t\t\tSwitches; \n\t\t\tVehicles; \n\t\t\tWireless communication; \n\t\t\theterogeneous networks; \n\t\t\tinterface switching; \n\t\t\tstochastic dynamic programming (SDP); \n\t\t\tvehicular communications;", "name": "Intelligent interface switching among heterogeneous wireless networks for vehicular communications", "author": "Lee, K.C.Xiaoqing ZhuDai, L.Jiang ZhuAddepalli, S.Rong PanBonomi, F.", "series_t": "Jan. 30 2012-Feb. 2 2012", "genre_s": "IEEE", "id": "978-1-4673-0008-7", "cat": "\n\t\t\tAs future vehicular communications will most likely involve multiple wireless networks, intelligent interface switching is of essential importance to support various user preferences across different performance metrics. In this paper, we present a general optimization framework for solving the interface switching problem, and develop a flexible and efficient solution based on stochastic dynamic programming (SDP). Our framework is designed to accommodate different performance metrics such as data transfer efficiency, monetary cost, and interface switching overhead. Accordingly, the proposed SDP-based policy can easily adapt its decision based on user-specified relative importance of the various metrics. Simulation study confirms the optimality of the SDP-based policy over a range of user preference choices, and shows that it consistent outperforms several heuristic schemes.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6181106&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DRPL+under+mobility", "features": " \n\t\t\trouting protocols; \n\t\t\ttelecommunication network topology; \n\t\t\tvehicular ad hoc networks; \n\t\t\tRPL; \n\t\t\tVANET; \n\t\t\tlossy networks; \n\t\t\tlow power networks; \n\t\t\tsensor network; \n\t\t\ttree based routing protocol; \n\t\t\tAd hoc networks; \n\t\t\tNetwork topology; \n\t\t\tPeer to peer computing; \n\t\t\tRouting protocols; \n\t\t\tTopology; \n\t\t\tVehicles;", "name": "RPL under mobility", "author": "Lee, K.C.Sudhaakar, R.Dai, L.Addepalli, S.Gerla, M.", "series_t": "14-17 Jan. 2012", "genre_s": "IEEE", "id": "978-1-4577-2070-3", "cat": "\n\t\t\tThis paper focuses on routing for vehicles getting access to infrastructure either directly or via multiple hops though other vehicles. We study Routing Protocol for Low power and lossy networks (RPL), a tree-based routing protocol designed for sensor networks. Many design elements from RPL are transferable to the vehicular environment. We provide a simulation performance study of RPL and RPL tuning in VANETs. More specifically, we seek to study the impact of RPL's various parameters and external factors (e.g., various timers and speeds) on its performance and obtain insights on RPL tuning for its use in VANETs.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6248874&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAging+impact+on+the+accelerated+thermal+cycling+performance+of+lead-free+BGA+solder+joints+in+various+stress+conditions", "features": " \n\t\t\tageing; \n\t\t\tball grid arrays; \n\t\t\tfailure analysis; \n\t\t\tfatigue; \n\t\t\tmetallurgy; \n\t\t\tsolders; \n\t\t\taccelerated thermal cycling; \n\t\t\taging impact; \n\t\t\tbulk lead-free solders; \n\t\t\tfailure mode; \n\t\t\tfatigue life; \n\t\t\tintermetallic growth; \n\t\t\tisothermal aging effects; \n\t\t\tlead-free BGA solder joints; \n\t\t\tmechanical properties; \n\t\t\tsolder alloy metallurgies; \n\t\t\tstress conditions; \n\t\t\ttemperature 100 degC; \n\t\t\ttemperature 150 degC; \n\t\t\tAging; \n\t\t\tDegradation; \n\t\t\tIsothermal processes; \n\t\t\tMetals; \n\t\t\tMicrostructure; \n\t\t\tSoldering; \n\t\t\tStress;", "name": "Aging impact on the accelerated thermal cycling performance of lead-free BGA solder joints in various stress conditions", "author": "Tae-Kyu LeeHongtao Ma", "series_t": "May 29 2012-June 1 2012", "genre_s": "IEEE", "id": "978-1-4673-1966-9", "cat": "\n\t\t\tIsothermal aging effects on lead-free solders have been extensively investigated in recent studies for both bulk solders and package solder joints. Researches show that aging significantly degrades the mechanical properties of bulk lead-free solders and dynamic performances of lead-free solder joints. There are studies exploring the impact of aging on accelerated thermal cycling (ATC) performance of lead-free solder joints, however, the results are discrepant, some research shows minimal impact of isothermal aging on long term ATC performances since most of the failure mode are not related to intermetallic (IMC) growth which has been impacted more significantly during aging. Some others show significant degradation of the of ATC life due to evidence of weakening of solder joints after aging. This study is intended to explore the factors that may affect the aging impact on the lead-free solder joint fatigue life. The test vehicle is designed with different package types, pitch sizes, and solder alloy metallurgies to capture the impact of affecting factors. The test vehicles have been aged at 100°C and 150°C for different aging durations, ATC test were subsequently performed on the aged samples and with the non aged samples as control. The effects of aging on the fatigue life of lead-free solder joints are extensively explored in this study.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6142055&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DImpact+of+Isothermal+Aging+and+Sn+Grain+Orientation+on+the+Long-Term+Reliability+of+Wafer-Level+Chip-Scale+Package+Sn%E2%80%93Ag%E2%80%93Cu+Solder+Interconnects", "features": " \n\t\t\tageing; \n\t\t\tchip scale packaging; \n\t\t\tcopper alloys; \n\t\t\tfatigue; \n\t\t\toptical microscopy; \n\t\t\treliability; \n\t\t\tsilver alloys; \n\t\t\tsolders; \n\t\t\ttin alloys; \n\t\t\twafer level packaging; \n\t\t\tSn-Ag-Cu; \n\t\t\tdwell time; \n\t\t\tfatigue life; \n\t\t\tgrain orientation; \n\t\t\tisothermal aging; \n\t\t\tlong-term reliability; \n\t\t\torientation image microscopy; \n\t\t\tsolder ball interconnects; \n\t\t\ttemperature 0 degC to 100 degC; \n\t\t\ttemperature 150 degC; \n\t\t\tthermal cycling; \n\t\t\ttime 500 h; \n\t\t\twafer-level chip-scale package; \n\t\t\tAging; \n\t\t\tElectronic packaging thermal management; \n\t\t\tIsothermal processes; \n\t\t\tJoints; \n\t\t\tReliability; \n\t\t\tSoldering; \n\t\t\tTin; \n\t\t\tOrientation image microscopy; \n\t\t\tPb-free solder; \n\t\t\tSn grain orientation; \n\t\t\tthermal fatigue;", "name": "Impact of Isothermal Aging and Sn Grain Orientation on the Long-Term Reliability of Wafer-Level Chip-Scale Package Sn&#x2013;Ag&#x2013;Cu Solder Interconnects", "author": "Tae-Kyu LeeZhou, B.Bieler, T.R.", "series_t": "March 2012", "genre_s": "IEEE", "id": "2156-3950", "cat": "\n\t\t\tThe interaction between isothermal aging and the long-term reliability of wafer-level chip-scale packages with Sn-3.0Ag-0.5Cu (wt%) solder ball interconnects is investigated. On isothermally aging at 100 and 150°C for 500 h and then thermally cycling from 0 to 100°C with 10 min of dwell time, the lifetime of the package is reduced by approximately 29%, depending on the aging condition. The microstructural evolution is observed during thermal aging and thermal cycling using orientation image microscopy. A Sn grain orientation structure transformation is observed. Different mechanisms after aging at various conditions are identified, and their impacts on the fatigue life of solder joints discussed.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6248964&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAddressing+bandwidth+challenges+in+next+generation+high+performance+network+systems+with+3D+IC+integration", "features": " \n\t\t\tapplication specific integrated circuits; \n\t\t\telemental semiconductors; \n\t\t\tintegrated circuit design; \n\t\t\tintegrated circuit interconnections; \n\t\t\tintegrated circuit packaging; \n\t\t\tjoining processes; \n\t\t\tlithography; \n\t\t\tmemory architecture; \n\t\t\tnext generation networks; \n\t\t\tsemiconductor device packaging; \n\t\t\tsilicon; \n\t\t\tswitches; \n\t\t\tsystem-in-package; \n\t\t\tthree-dimensional integrated circuits; \n\t\t\t3D IC integration; \n\t\t\t3D IC stack; \n\t\t\t3D SiP format; \n\t\t\t3D system-in-package format; \n\t\t\tASIC chip; \n\t\t\tASIC dice; \n\t\t\tC2C joining process; \n\t\t\tSi; \n\t\t\tTSV; \n\t\t\tapplication specific integrated circuits; \n\t\t\tbandwidth challenges; \n\t\t\tbandwidth requirements; \n\t\t\tdouble-sided chip to chip joining process; \n\t\t\thigh bandwidth advantages; \n\t\t\thigh density advantages; \n\t\t\thigh performance networking routers; \n\t\t\thigh performance networking switches; \n\t\t\tinterconnect wiring layers; \n\t\t\tlithographic wafer processing; \n\t\t\tmaterial selection optimization; \n\t\t\tmemory chips; \n\t\t\tmemory devices design; \n\t\t\tmemory dice; \n\t\t\tmemory integration; \n\t\t\tmicrobump interconnections; \n\t\t\tnext generation high performance network systems; \n\t\t\torganic package substrate; \n\t\t\tpackage reliability; \n\t\t\tpackage thermal performance; \n\t\t\tsilicon interposer; \n\t\t\tsize limitation; \n\t\t\tsolder bumps; \n\t\t\tthermo-mechanical analysis; \n\t\t\tthrough-silicon-vias; \n\t\t\twiring layers; \n\t\t\tApplication specific integrated circuits; \n\t\t\tAssembly; \n\t\t\tBandwidth; \n\t\t\tSilicon; \n\t\t\tSubstrates; \n\t\t\tThrough-silicon vias;", "name": "Addressing bandwidth challenges in next generation high performance network systems with 3D IC integration", "author": "Li LiPeng SuJie XueBrillhart, M.Lau, J.Tzeng, P.J.Lee, C.K.Zhan, C.J.Dai, M.J.Chien, H.C.Wu, S.T.", "series_t": "May 29 2012-June 1 2012", "genre_s": "IEEE", "id": "978-1-4673-1966-9", "cat": "\n\t\t\tThe bandwidth for high performance networking switches and routers increases two to ten times in every new generation. This in turn drives the bandwidth requirements for the Application Specific Integrated Circuits (ASICs) and their external memory devices designed for the high performance network systems. 3D IC integration with its low power, high density and high bandwidth advantages is proposed to address the bandwidth challenges between the ASIC and its external memory. This paper presents a novel 3D IC architecture that includes a silicon interposer with Through-Silicon-Vias (TSV) and interconnect wiring layers on both sides of the silicon interposer. An ASIC chip measured at 22 mm × 18 mm × 0.4 mm is attached on top of the silicon interposer while two smaller memory chips with a size of 10 mm × 10 mm × 0.4 mm are attached to the bottom of the silicon interposer with micro-bump interconnections. A unique, double-sided Chip to Chip (C2C) joining process is developed to enable the ASIC and memory integration in true 3D System-in-Package (SiP) format. This 3D IC architecture will help to overcome the size limitation of the current silicon interposers due to the reticle size used in the lithographic wafer processing. The 3D IC stack is assembled on an organic package substrate with conventional solder bumps. Communications between the top ASIC die and the bottom memory dice are made through the TSVs and the wiring layers of the silicon interposer. Thermal and thermo-mechanical analysis of the 3D IC stack are used to evaluate the package thermal performance and for optimizing material selection and package reliability. Both the modeling and experimental characterization results are used to gain insights into the 3D IC technology for addressing the ASIC and memory bandwidth challenges and to develop the best practice for ASIC and memory integration for next generation high performance network systems.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6202057&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DThe+implementation+of+an+evaluation+system+of+English+phoneme+pronunciation+quality", "features": " \n\t\t\tcomputer aided instruction; \n\t\t\tnatural language processing; \n\t\t\tteaching; \n\t\t\ttime warp simulation; \n\t\t\tDTW algorithm; \n\t\t\tEnglish phoneme pronunciation quality; \n\t\t\tMFCC Euclidean distance; \n\t\t\tdynamic time warping algorithm; \n\t\t\tmel mel-frequency cepstrum coefficients Euclidean distance; \n\t\t\tobjective evaluation system; \n\t\t\tstandard pronunciation; \n\t\t\tstudent pronunciation; \n\t\t\tEducational institutions; \n\t\t\tFiltering; \n\t\t\tMel frequency cepstral coefficient; \n\t\t\tSpeech; \n\t\t\tSpeech processing; \n\t\t\tSpeech recognition; \n\t\t\tDTW Algorithm; \n\t\t\tMFCC; \n\t\t\tPronunciation Evaluation;", "name": "The implementation of an evaluation system of English phoneme pronunciation quality", "author": "Min-feng YaoXin-guang LiFan-quan FangYu ZouSu-mei Li", "series_t": "21-23 April 2012", "genre_s": "IEEE", "id": "978-1-4577-1414-6", "cat": "\n\t\t\tThis paper presents an objective evaluation system of English phoneme pronunciation. This system gives an objective evaluation and feedback from students' pronunciation by analyzing the waveform and calculating the Mel Mel-Frequency Cepstrum Coefficients (MFCC) Euclidean distance between students' pronunciation and the standard pronunciation using the Dynamic Time Warping (DTW) algorithm. This helps students learn English phonemes without any teacher involved.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6241901&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DCritical+temperature+shift+for+Stress+Induced+Voiding+in+advanced+Cu+interconnects+for+32+nm+and+beyond", "features": " \n\t\t\tCMOS integrated circuits; \n\t\t\tX-ray diffraction; \n\t\t\tcopper; \n\t\t\tfinite element analysis; \n\t\t\tintegrated circuit interconnections; \n\t\t\tintegrated circuit reliability; \n\t\t\tplasticity; \n\t\t\tstress relaxation; \n\t\t\tsynchrotrons; \n\t\t\tSM peak profile temperature; \n\t\t\tadvanced Cu interconnects; \n\t\t\tclear shift; \n\t\t\tcreep plasticity; \n\t\t\tcritical temperature shift; \n\t\t\tdiffusion-assisted mechanism; \n\t\t\tinterconnect linewidths; \n\t\t\tlower temperature range; \n\t\t\tnumerical finite element analysis; \n\t\t\tplasticity-assisted strain relaxation process; \n\t\t\tsize 32 nm; \n\t\t\tstress induced voiding; \n\t\t\tstress migration peak profile temperature; \n\t\t\tsynchrotron x-ray microdiffraction experiment; \n\t\t\ttechnology node; \n\t\t\ttemperature 293 K to 298 K; \n\t\t\tthermal stress relaxation; \n\t\t\tCreep; \n\t\t\tLoading; \n\t\t\tMetals; \n\t\t\tStrain; \n\t\t\tStress; \n\t\t\tThermal loading; \n\t\t\tCopper; \n\t\t\tFEM; \n\t\t\tInterconnects; \n\t\t\tModeling; \n\t\t\tPlastic Deformation; \n\t\t\tReliability; \n\t\t\tStress Induced Voiding; \n\t\t\tStress Migration;", "name": "Critical temperature shift for Stress Induced Voiding in advanced Cu interconnects for 32 nm and beyond", "author": "Morusupalli, R.Rao, R.Tae-Kyu LeeYu-Lin ShenKunz, M.Tamura, N.Budiman, A.S.", "series_t": "15-19 April 2012", "genre_s": "IEEE", "id": "978-1-4577-1678-2", "cat": "\n\t\t\tIn this paper we present work showing evidence of a shift in the Stress Migration (SM) peak profile temperature for smaller interconnect linewidths typically associated with the 32 nm technology node and beyond. With other parameters (fabrication, materials, line thickness and via diameter being kept nominal among these samples), this clear shift towards the lower temperatures for smaller linewidths appear to indicate a size effect in the Stress Migration in advanced Cu interconnect scheme. Through the synchrotron x-ray micro-diffraction experiment, we show that plasticity is involved in the stress relaxation process at about 200 C, but not at higher temperature nor at room temperature. Such plasticity-assisted strain relaxation in interconnects especially at lower temperature range could explain the critical temperature shift observed in the present study, in addition to the typical diffusion-assisted mechanism. In conjunction with the experimental study, numerical finite element analyses were also conducted to provide greater insight. The modeling result demonstrates the importance of creep plasticity in causing thermal stress relaxation in Cu interconnects.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6188856&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DModeling+of+fan+failures+in+networking+enclosures", "features": " \n\t\t\tblades; \n\t\t\tcomputational fluid dynamics; \n\t\t\tfailure analysis; \n\t\t\tfans; \n\t\t\tgeometry; \n\t\t\tmechanical engineering computing; \n\t\t\tpressure; \n\t\t\trotors; \n\t\t\tsolid modelling; \n\t\t\tstators; \n\t\t\twind tunnels; \n\t\t\tAMCA model; \n\t\t\tAMCA wind tunnel; \n\t\t\tCFD simulation; \n\t\t\tMRF model; \n\t\t\tback-to-front airflow; \n\t\t\tfan blade; \n\t\t\tfan curve measurement; \n\t\t\tfan failure modeling; \n\t\t\tflow reversal; \n\t\t\tfront-to-back airflow; \n\t\t\tmultiple reference frame; \n\t\t\tnetworking chassis; \n\t\t\tnetworking enclosure; \n\t\t\tpressure imbalance; \n\t\t\tpull system; \n\t\t\tpush system; \n\t\t\trotor; \n\t\t\tstator blade; \n\t\t\tthree dimensional effect; \n\t\t\tAtmospheric modeling; \n\t\t\tBlades; \n\t\t\tData models; \n\t\t\tFans; \n\t\t\tGeometry; \n\t\t\tPower supplies; \n\t\t\tSwitches;", "name": "Modeling of fan failures in networking enclosures", "author": "Narasimhan, S.Shankaran, G.Basak, S.", "series_t": "18-22 March 2012", "genre_s": "IEEE", "id": "978-1-4673-1110-6", "cat": "\n\t\t\tModeling of fan failures in networking chassis is a challenging task. There is not enough data or literature available to accurately model fan failures. This paper embarks on a study consisting of both modeling and experimental cases to investigate how to accurately model fan failures. The study will include CFD simulations in different ways to model fan failures and also real life experimental measurements to verify the simulation concepts. Recommendations will then be made about the exact and accurate ways of modeling fan failures. The study also involves cases of fan failures for both front to back airflow (Pull Systems) and back to front airflow (Push Systems). Normally the fans have been modeled as two dimensional entities. The fan curve measured by the vendor is used in the fan during modeling. The problem that arises with this kind of a fan modeling especially during fan failures is that the three dimensional effect of the rotor and stator blades of the fan is not taken into account. In reality, the fan blades provide a big obstruction to the flow reversal that happens due to pressure imbalance during fan failures. In this paper, we start with modeling a single fan in an AMCA wind tunnel. The complete rotor and stator geometry of the fan is modeled. We run a MRF (Multiple Reference Frame) model to generate the fan curve for the fan and compare it with the experimental fan curve. After we validate the fan curve in an AMCA model for a single fan, the paper discusses three different sets of temperature and flow data: i. Temperature and flow data in a real system with four fans modeled with two dimensional fans ii. Temperature and flow data in a real system with four fans modeled with MRF fans (full 3 dimensional rotor and stator blade geometry) iii. Experimental comparisons with the simulated data. Conclusions will be drawn based on this modeling and experimental data about accurate ways of modeling fans during fan failures in real systems.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6187466&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DPhysical-design-friendly+hierarchical+logic+built-in+self-test+A+case+study", "features": " \n\t\t\tbuilt-in self test; \n\t\t\tflip-flops; \n\t\t\tlogic testing; \n\t\t\tsystem-on-chip; \n\t\t\tBIST; \n\t\t\tengineering change order; \n\t\t\tflip-flops; \n\t\t\tlaunch-on-capture clocking scheme; \n\t\t\tnetworking SOC design; \n\t\t\tphysical-design-friendly hierarchical logic built-in self-test; \n\t\t\tsystem-on-chip; \n\t\t\tAutomatic test pattern generation; \n\t\t\tBuilt-in self-test; \n\t\t\tCircuit faults; \n\t\t\tClocks; \n\t\t\tDelay; \n\t\t\tRegisters; \n\t\t\tRuntime; \n\t\t\tBIST diagnosis; \n\t\t\tLogic BIST; \n\t\t\tlaunch-on-capture;", "name": "Physical-design-friendly hierarchical logic built-in self-test&#x2014;A case study", "author": "Nelson, K.Shanmugavadivelu, J.Mekkoth, J.Ghanta, V.Jun WuFe ZhuangHao-Jan ChaoShianling WuJie RaoLizhen YuLaung-Terng Wang", "series_t": "19-21 March 2012", "genre_s": "IEEE", "id": "978-1-4673-1034-5", "cat": "\n\t\t\tThis paper describes an application of a physical-design-friendly hierarchical logic built-in self-test (BIST) architecture and validation methodology on a networking system-on-chip (SOC) design. The design consists of two embedded cores, each containing approximately 45 million primitives and 2.5 million flip-flops. The implemented architecture supports an at-speed staggered launch-on-capture clocking scheme and includes novel features to reduce turnaround time during engineering change order (ECO) and the device's BIST runtime. It also embeds test and diagnosis features to facilitate debugging of the device at the system level. The BIST hierarchy includes wrappers surrounding each core with access from chip-top allowing for both parallel and serial validations of the cores. This case study successfully demonstrates the feasibility of using the implemented features for speedy ECO, synergy with physical design flow, and ease of test and diagnosis.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6176213&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DCharacterization+of+Via+Structures+in+Multilayer+Printed+Circuit+Boards+With+an+Equivalent+Transmission-Line+Model", "features": " \n\t\t\tdigital circuits; \n\t\t\tmulticonductor transmission lines; \n\t\t\tprinted circuit interconnections; \n\t\t\tvias; \n\t\t\tPCB; \n\t\t\tarbitrary via number; \n\t\t\tcircuit simulators; \n\t\t\tdistributed effects; \n\t\t\tequivalent transmission-line model; \n\t\t\tfull-wave simulations; \n\t\t\thigh-speed digital circuits; \n\t\t\thigh-speed signal transmission; \n\t\t\tlink-path analysis; \n\t\t\tmulticonductor transmission-line model; \n\t\t\tmultilayer printed circuit boards; \n\t\t\tphysic-based circuit model; \n\t\t\ttrace connections; \n\t\t\tvia structures; \n\t\t\tvia stubs; \n\t\t\tvias; \n\t\t\tCapacitance; \n\t\t\tImpedance; \n\t\t\tIntegrated circuit modeling; \n\t\t\tNonhomogeneous media; \n\t\t\tStripline; \n\t\t\tTransmission line matrix methods; \n\t\t\tEquivalent multiconductor transmission-line model for vias; \n\t\t\tmultilayer PCBs; \n\t\t\tsignal integrity; \n\t\t\tvia modeling and characterization;", "name": "Characterization of Via Structures in Multilayer Printed Circuit Boards With an Equivalent Transmission-Line Model", "author": "Siming PanJun Fan", "series_t": "Oct. 2012", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tVias are typical discontinuities for high-speed signal transmission in printed circuit boards (PCBs). This paper proposes an equivalent multiconductor transmission-line model for via structures in multilayer PCBs. The proposed model is based on the physic-based circuit model, taking into account distributed effects. Various via structures with arbitrary via number, trace connections, and via stubs can be effectively handled in the equivalent transmission-line model, which is sufficiently accurate and fast to be integrated into circuit simulators for via and link-path analysis. With the proposed model, well-known transmission-line theories can be borrowed for via modeling and characterization for signal integrity in high-speed digital circuits. The proposed model is validated with both full-wave simulations and measurements for multilayer PCBs with different via structures.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5461919&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DMeasuRouting%3A+A+Framework+for+Routing+Assisted+Traffic+Monitoring", "features": " \n\t\t\tquality of service; \n\t\t\ttelecommunication network routing; \n\t\t\ttelecommunication traffic; \n\t\t\tMeasuRouting; \n\t\t\tbandwidth resources; \n\t\t\tintra-domain routing; \n\t\t\tintra-domain traffic engineering; \n\t\t\tquality of service; \n\t\t\tredeploy/reconfigure measurement infrastructure; \n\t\t\trouting assisted traffic monitoring; \n\t\t\ttraffic accounting; \n\t\t\ttraffic sub-populations; \n\t\t\tAggregates; \n\t\t\tBandwidth; \n\t\t\tDebugging; \n\t\t\tFluid flow measurement; \n\t\t\tForensics; \n\t\t\tMonitoring; \n\t\t\tQuality of service; \n\t\t\tRouting; \n\t\t\tTelecommunication traffic; \n\t\t\tTime measurement;", "name": "MeasuRouting: A Framework for Routing Assisted Traffic Monitoring", "author": "Raza, S.Guanyao HuangChuah, Chen-NeeSeetharaman, S.Singh, J.P.", "series_t": "14-19 March 2010", "genre_s": "IEEE", "id": "978-1-4244-5836-3", "cat": "\n\t\t\tMonitoring transit traffic at one or more points in a network is of interest to network operators for reasons of traffic accounting, debugging or troubleshooting, forensics, and traffic engineering. Previous research in the area has focused on deriving a placement of monitors across the network towards the end of maximizing the monitoring utility of the network operator for a given traffic routing. However, both traffic characteristics and measurement objectives can dynamically change over time, rendering a previously optimal placement of monitors suboptimal. It is not feasible to dynamically redeploy/reconfigure measurement infrastructure to cater to such evolving measurement requirements. We address this problem by strategically routing traffic sub-populations over fixed monitors. We refer to this approach as MeasuRouting. The main challenge for MeasuRouting is to work within the constraints of existing intra-domain traffic engineering operations that are geared for efficiently utilizing bandwidth resources, or meeting Quality of Service (QoS) constraints, or both. A fundamental feature of intra-domain routing, that makes MeasuRouting feasible, is that intra-domain routing is often specified for aggregate flows. MeasuRouting, can therefore, differentially route components of an aggregate flow while ensuring that the aggregate placement is compliant to original traffic engineering objectives. In this paper we present a theoretical framework for MeasuRouting. Furthermore, as proofs-of-concept, we present synthetic and practical monitoring applications to showcase the utility enhancement achieved with MeasuRouting.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6224304&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAnalysis+of+customer+satisfaction+survey+data", "features": " \n\t\t\tconsumer behaviour; \n\t\t\tcustomer satisfaction; \n\t\t\tdata analysis; \n\t\t\tstatistical analysis; \n\t\t\tsurveying; \n\t\t\ttechnical support services; \n\t\t\tCSAT survey; \n\t\t\tCisco Systems Inc; \n\t\t\tCisco products; \n\t\t\tCisco-provided technical services; \n\t\t\tcompany business; \n\t\t\tcustomer experience yearly metrics goals; \n\t\t\tcustomer satisfaction survey data analysis; \n\t\t\tcustomer sentiment; \n\t\t\tcustomer support objectives; \n\t\t\tengineering initiatives; \n\t\t\tskip logic; \n\t\t\tstatistical territory; \n\t\t\tsurvey mechanics; \n\t\t\ttechnical support; \n\t\t\tAnalytical models; \n\t\t\tCouplings; \n\t\t\tCustomer satisfaction; \n\t\t\tMathematical model; \n\t\t\tMeasurement; \n\t\t\tSoftware; \n\t\t\tCSAT survey (customer satisfaction survey); \n\t\t\tcolinearity; \n\t\t\tcustomer satisfaction; \n\t\t\tdata imputation; \n\t\t\tdominance analysis; \n\t\t\tlistwise deletion; \n\t\t\tmean substitution; \n\t\t\tmissing values;", "name": "Analysis of customer satisfaction survey data", "author": "Rotella, P.Chulani, Sunita", "series_t": "2-3 June 2012", "genre_s": "IEEE", "id": "978-1-4673-1760-3", "cat": "\n\t\t\tCisco Systems, Inc., conducts a customer satisfaction survey (CSAT) each year to gauge customer sentiment regarding Cisco products, technical support, partner- and Cisco-provided technical services, order fulfillment, and a number of other aspects of the companys business. The results of the analysis of this data are used for several purposes, including ascertaining the viability of new products, determining if customer support objectives are being met, setting engineering in-process and customer experience yearly metrics goals, and assessing, indirectly, the success of engineering initiatives. Analyzing this data, which includes 110,000 yearly sets of survey responses that address over 100 product and services categories, is in many respects complicated. For example, skip logic is an integral part of the survey mechanics, and forming aggregate views of customer sentiment is statistically challenging in this data environment. In this paper, we describe several of the various analysis approaches currently used, pointing out some situations where a high level of precision is not easily achieved, and some situations in which it is possible to easily end up with erroneous results. The analysis and statistical territory covered in this paper is in parts well-known and straightforward, but other parts, which we address, are susceptible to large inaccuracies and errors. We address several of these difficulties and develop reasonable solutions for two known issues, high missing value levels and high colinearity of independent variables.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6248870&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DMixed+Pitch+BGA+.LB.mpBGA.RB.+packaging+development+for+high+bandwidth-high+speed+networking+devices", "features": " \n\t\t\tapplication specific integrated circuits; \n\t\t\tassembling; \n\t\t\tball grid arrays; \n\t\t\tcapacitors; \n\t\t\telemental semiconductors; \n\t\t\tfine-pitch technology; \n\t\t\tflip-chip devices; \n\t\t\tintegrated circuit interconnections; \n\t\t\tintegrated circuit manufacture; \n\t\t\tintegrated circuit packaging; \n\t\t\tintegrated circuit reliability; \n\t\t\tsilicon; \n\t\t\tsystem-in-package; \n\t\t\t1000TCB; \n\t\t\t8+1 coreless substrates; \n\t\t\tBGA-side capacitance; \n\t\t\tBGA-side capacitors; \n\t\t\tBOM package; \n\t\t\tELK silicon technology; \n\t\t\tHTS; \n\t\t\tL1 reliability tests; \n\t\t\tMCM; \n\t\t\tMSL-4 preconditioning; \n\t\t\tSi; \n\t\t\tSiP; \n\t\t\tassembly method; \n\t\t\tbill of materials; \n\t\t\tconsequential reliability; \n\t\t\thigh bandwidth-high speed networking devices; \n\t\t\thigh speed interconnection; \n\t\t\thigh speed network packaging; \n\t\t\tinterconnect density; \n\t\t\tlarge body size ASIC package test vehicle; \n\t\t\tlarge body size flip chip BGA packages; \n\t\t\tmanufacturability risks; \n\t\t\tmanufacturing process; \n\t\t\tmanufacturing technology; \n\t\t\tmixed pitch BGA packaging; \n\t\t\tmixed pitch ball grid array; \n\t\t\tmpBGA packaging design; \n\t\t\tnext generation ASIC; \n\t\t\toptimal package decoupling; \n\t\t\tpackage reliability risks; \n\t\t\tpackage size growth mitigation; \n\t\t\tpreferred board level design stack-up; \n\t\t\tpreferred package design footprint; \n\t\t\tsize 0.4 mm; \n\t\t\tsize 40 nm; \n\t\t\tsystem-in package; \n\t\t\tthin core substrates; \n\t\t\tthin-core test vehicle; \n\t\t\tuHAST; \n\t\t\tAssembly; \n\t\t\tCapacitors; \n\t\t\tQualifications; \n\t\t\tReliability; \n\t\t\tSilicon; \n\t\t\tSubstrates;", "name": "Mixed Pitch BGA (mpBGA) packaging development for high bandwidth-high speed networking devices", "author": "Savic, J.Nagar, M.Weidong XieAhmad, M.Senk, D.Bansal, A.Islam, N.Park Gun OhPendse, R.Choi HangChulLee SangHo", "series_t": "May 29 2012-June 1 2012", "genre_s": "IEEE", "id": "978-1-4673-1966-9", "cat": "\n\t\t\tHigh speed network packaging solutions have pushed the limits of known manufacturing technology into previously untested realms. Next generation ASIC's and SiP/MCM's are requiring packages in excess of 60mm × 60mm. These large package sizes present both significant manufacturability and reliability challenges. Developing new solutions which can adequately accommodate the needs of high speed interconnect while concurrently mitigating package size growth and the consequential reliability and manufacturability risks which result, is essential for maintaining a supply equilibrium at a sustainable cost. This paper discusses the manufacturing process and the component reliability of a large body size (55×55mm) ASIC package TV using 40nm ELK Si technology and a Mixed Pitch Ball Grid Array (mpBGA) with BGA-side capacitance on both thin core (0.4mm) and 8+1 coreless substrates. Suitable for use at any body size, mpBGA combines tighter BGA pitch (0.94mm) and the option for BGA-side capacitance to enable optimal package decoupling and increased interconnect density. mpBGA provides a means for mitigating package size growth by inherently extending the usefulness of smaller package sizes, thereby minimizing both the package reliability risks as well as the cost associated with proving in the “next” body size up (i.e increasing from 55×55mm to 60×60mm packages). The preferred method for assembly and design of mpBGA packages on both coreless and thin core substrates will be discussed including: (1) assembly process capability, (2) preferred board level design stack-up and (3) preferred package design footprint incorporating the BGA-side capacitors. A preferred BOM has been identified for the thin-core 55×55mm package which has resulted in full-pass of all relevant L1 reliability tests (MSL-4 preconditioning, HTS, uHAST and 1000TCB). Additionally, it is shown that the package co-planarity of the 55×55mm thin-core te- t vehicle is within the required 8 mil maximum for large body size flip chip BGA packages.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6132414&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DAnalytical+Prediction+of+Crosstalk+Among+Vias+in+Multilayer+Printed+Circuit+Boards", "features": " \n\t\t\tjitter; \n\t\t\tprinted circuit design; \n\t\t\tvias; \n\t\t\tPCB design; \n\t\t\tanalytical crosstalk prediction; \n\t\t\tcircuit density; \n\t\t\tcritical nets; \n\t\t\thigh-speed multilayer printed circuit board; \n\t\t\tinfinite parallel-plane assumption; \n\t\t\tjitter; \n\t\t\tproblematic nets; \n\t\t\tsignal quality; \n\t\t\ttwo-step via crosstalk evaluation; \n\t\t\tCrosstalk; \n\t\t\tGeometry; \n\t\t\tImpedance; \n\t\t\tInductance; \n\t\t\tIntegrated circuit modeling; \n\t\t\tNonhomogeneous media; \n\t\t\tTransmission line matrix methods; \n\t\t\tPhysics-based via circuit model; \n\t\t\tprinted circuit board (PCB); \n\t\t\tsignal integrity; \n\t\t\tvia crosstalk; \n\t\t\tvia models;", "name": "Analytical Prediction of Crosstalk Among Vias in Multilayer Printed Circuit Boards", "author": "Songping WuJun Fan", "series_t": "April 2012", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tCrosstalk among vias is a significant problem in high-speed multilayer printed circuit boards (PCBs), deteriorating signal quality and increasing jitter, especially when circuit density is high. In this paper, a two-step via crosstalk evaluation procedure is proposed. A fast approach for crosstalk estimation is developed for net screening as the first step. Then, more accurate but more time-consuming modeling can be performed for critical nets or the problematic nets identified in the screening. The main contribution of this study includes the analytical prediction of crosstalk among vias based on an infinite parallel-plane assumption. Its effectiveness and efficiency to predict the trends in the crosstalk among vias in practical PCB designs are demonstrated.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6248974&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAn+evaluation+of+effects+of+molding+compound+and+substrate+material+properties+on+reliability+of+Cu+wire+BGA+components", "features": " \n\t\t\tX-ray chemical analysis; \n\t\t\tball grid arrays; \n\t\t\tcopper; \n\t\t\tfailure analysis; \n\t\t\tfocused ion beam technology; \n\t\t\tgold; \n\t\t\thalogens; \n\t\t\thigh-temperature effects; \n\t\t\tmaterials testing; \n\t\t\tmoulding; \n\t\t\tpH; \n\t\t\treliability; \n\t\t\tscanning electron microscopy; \n\t\t\ttransmission electron microscopy; \n\t\t\tAu-Cu; \n\t\t\tCl; \n\t\t\tEDX; \n\t\t\tFIB; \n\t\t\tHTS test; \n\t\t\tSEM; \n\t\t\tTEM; \n\t\t\tacceleration tests; \n\t\t\tbetter-controlled packaging material formulations; \n\t\t\tbiased-HAST; \n\t\t\tbiased-highly accelerated stress testing; \n\t\t\tcopper wire BGA component reliability; \n\t\t\tenergy dispersive X-ray; \n\t\t\tfailure mechanisms; \n\t\t\tfailure rates; \n\t\t\tfocus ion beam; \n\t\t\thalogen free substrate; \n\t\t\thigh temperature storage test; \n\t\t\thigh-halogen substrate; \n\t\t\thigh-reliability electronic systems; \n\t\t\tmission-critical electronic systems; \n\t\t\tmolding compound chemistry; \n\t\t\torganic BGA package; \n\t\t\torganic ball grid array packages; \n\t\t\treliability testing; \n\t\t\tscanning electron microscopy; \n\t\t\tsemiconductor components; \n\t\t\tsubstrate halogen content; \n\t\t\tsubstrate material properties; \n\t\t\ttransmission electron microscopy; \n\t\t\tAcceleration; \n\t\t\tCompounds; \n\t\t\tHigh temperature superconductors; \n\t\t\tReliability; \n\t\t\tSubstrates; \n\t\t\tWires;", "name": "An evaluation of effects of molding compound and substrate material properties on reliability of Cu wire BGA components", "author": "Peng SuSeki, H.Nishitani, Y.Chen PingZenbutsu, S.Itoh, S.Huang, L.Liao, N.Liu, B.Chen, C.Tai, W.Tseng, A.", "series_t": "May 29 2012-June 1 2012", "genre_s": "IEEE", "id": "978-1-4673-1966-9", "cat": "\n\t\t\tThe transitions to copper (Cu) from gold (Au) bond wires is occurring for an increasingly broader range of semiconductor components. For ball grid array (BGA) packages, key packaging materials including molding compound and substrate all need to be re-evaluated as they may interact with Cu wire bond differently from Au wires and introduce new failure mechanisms. In this work, we investigate the impact of molding compound chemistry and halogen content of substrate on the reliability performance of an organic BGA package. For the molding compound, two material properties, pH level and C1-concentration are varied and a total of 9 formulations are generated. For substrates, a high-halogen substrate and a Halogen Free substrate are evaluated. Two types of acceleration tests, HTS (High Temperature Storage) test and biased-HAST (Highly Accelerated Stress Testing) are performed on the components. The effects of molding compound pH/C1-levels and substrate halogen content on the failure rates will be discussed. Additionally, analytical results on the failed components using FIB (Focus Ion Beam), SEM (Scanning Electron Microscopy), TEM (Transmission Electron Microscopy), and EDX (Energy Dispersive X-ray) will be reported. The reliability testing and analytical results will demonstrate the importance of controlling packaging material properties and provide guidelines for the selection of these materials. For high-reliability and mission-critical electronic systems, improved and better-controlled packaging material formulations will be needed to ensure the long-term reliability of components using Cu bond wires.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6241832&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DSystem-level+reliability+using+component-level+failure+signatures", "features": " \n\t\t\tfailure analysis; \n\t\t\tintegrated circuit reliability; \n\t\t\tInternet switches; \n\t\t\tMTBF; \n\t\t\tRAS analysis; \n\t\t\tRAS evaluation; \n\t\t\tRAS metrics; \n\t\t\tcomponent failure modes; \n\t\t\tcomponent-level failure signatures; \n\t\t\tfailure classification; \n\t\t\tfault management; \n\t\t\thierarchical modeling format; \n\t\t\tindividual component-level reliability metrics; \n\t\t\treliability availability and serviceability metrics; \n\t\t\tsystem failure signatures; \n\t\t\tsystem level modeling; \n\t\t\tsystem reliability requirements; \n\t\t\tsystem-level failures; \n\t\t\tsystem-level mean time between failures; \n\t\t\tsystem-level reliability; \n\t\t\ttop-down hierarchical fashion; \n\t\t\tHardware; \n\t\t\tIntegrated circuits; \n\t\t\tMeasurement; \n\t\t\tReliability engineering; \n\t\t\tSoftware; \n\t\t\tSoftware reliability; \n\t\t\tFIT; \n\t\t\tcomponent-level failures; \n\t\t\thard errors; \n\t\t\tmemory failures; \n\t\t\tsoft errors; \n\t\t\tsystem-level failures;", "name": "System-level reliability using component-level failure signatures", "author": "Wong, R.Bhuva, B.L.Evans, A.Wen, S.", "series_t": "15-19 April 2012", "genre_s": "IEEE", "id": "978-1-4577-1678-2", "cat": "\n\t\t\tSystem-level Mean Time Between Failures (MTBF) is usually evaluated using individual component-level reliability metrics. System-level failures are categorized by Reliability, Availability and Serviceability (RAS) metrics. However, RAS evaluation at the system-level requires precise mapping between component failure modes, their system failure signatures and system reliability requirements. In this paper, RAS analysis carried out on internet switches in a top-down hierarchical fashion is presented. Results show availability of failure classification at a lower-level of design allows for better fault management and improved RAS metrics at the system-level. A hierarchical modeling format is proposed to standardize the reporting of component failure modes to improve the system level modeling of RAS.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6167565&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DCloud-assisted+streaming+for+low-latency+applications", "features": " \n\t\t\tMarkov processes; \n\t\t\tcloud computing; \n\t\t\tdynamic programming; \n\t\t\tmedia streaming; \n\t\t\tmobile computing; \n\t\t\tstochastic programming; \n\t\t\tMarkov decision process framework; \n\t\t\tapplication playout latency; \n\t\t\tcloud-assisted architecture; \n\t\t\tcloud-assisted streaming; \n\t\t\tgreedy heuristic schemes; \n\t\t\tlow-latency mobile media streaming applications; \n\t\t\tmedia cloud services; \n\t\t\tmedia proxy; \n\t\t\tnetwork round-trip-time; \n\t\t\tonline gaming; \n\t\t\toptimal media adaptation decisions; \n\t\t\tproxy-based intelligent frame skipping problem; \n\t\t\tstochastic dynamic programing approach; \n\t\t\tstream packet delivery delays; \n\t\t\tvideo conferencing; \n\t\t\tvideo contents; \n\t\t\twireless channel conditions; \n\t\t\twireless link throughput; \n\t\t\tDelay; \n\t\t\tMedia; \n\t\t\tMobile communication; \n\t\t\tReceivers; \n\t\t\tStreaming media; \n\t\t\tThroughput; \n\t\t\tWireless communication; \n\t\t\tcloud computing; \n\t\t\tlow latency media streaming; \n\t\t\tmobile video conferencing; \n\t\t\tvideo adaptation;", "name": "Cloud-assisted streaming for low-latency applications", "author": "Xiaoqing ZhuJiang ZhuRong PanPrabhu, M.S.Bonomi, F.", "series_t": "Jan. 30 2012-Feb. 2 2012", "genre_s": "IEEE", "id": "978-1-4673-0008-7", "cat": "\n\t\t\tMedia cloud services offer an unique opportunity for alleviating many of the technical challenges faced by mobile media streaming, especially for applications with stringent latency requirements. In this paper, we propose a novel cloud-assisted architecture for supporting low-latency mobile media streaming applications such as onling gaming and video conferencing. A media proxy at the cloud is envisioned to calculate the optimal media adaptation decisions on behalf of the mobile sender, based on past observations of packet delivery delays of each stream. The proxy-based intelligent frame skipping problem is formulated within the Markov Decisio Process (MDP) framework, which captures both the time-varying nature of video contents as well as bursty fluctuations in wireless channel conditions. The optimal frame skipping policy is calculated using the stochastic dynamic programing (SDP) approach, and is shown to consistently outperform greedy heuristic schemes. Our simulation studies further characterize how system performance is influenced by various key factors, such as application playout latency, network round-trip-time, and wireless link throughput.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=6249381&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DResilient+packet+rings+with+heterogeneous+link", "features": " \n\t\t\tIEEE standards; \n\t\t\tchannel capacity; \n\t\t\tmetropolitan area networks; \n\t\t\ttelecommunication links; \n\t\t\ttelecommunication network topology; \n\t\t\ttelecommunication standards; \n\t\t\twide area networks; \n\t\t\tIEEE 802.17; \n\t\t\tcapacity links; \n\t\t\theterogeneous links; \n\t\t\tmetropolitan area networks; \n\t\t\tresilient packet rings; \n\t\t\tstandardized ring topology network architecture; \n\t\t\twide area networks; \n\t\t\tBandwidth; \n\t\t\tOscillators; \n\t\t\tProtocols; \n\t\t\tSONET; \n\t\t\tSimulation; \n\t\t\tUSA Councils; \n\t\t\tMAN; \n\t\t\tWAN; \n\t\t\tactive queue management; \n\t\t\tfairness; \n\t\t\tring networks; \n\t\t\tspatial reuse;", "name": "Resilient packet rings with heterogeneous links", "author": "Yilmaz, M.Ansari, N.", "series_t": "1-4 July 2012", "genre_s": "IEEE", "id": "978-1-4673-2712-1", "cat": "\n\t\t\tIEEE 802.17 is a standardized ring topology network architecture, called the Resilient Packet Ring (RPR), to be used mainly in metropolitan and wide area networks. The standard calls for establishing rings utilizing uniform links of the same capacity. The impact of using different capacity links on the same ring has not been investigated before from the ring utilization and fairness point of view. This paper investigates supporting non-uniform links in RPR.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5747554&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DConsiderations+for+cloud+data+centers%3A+Framework%2C+architecture+and+adoption", "features": " \n\t\t\tcloud computing; \n\t\t\tcomputer centres; \n\t\t\tinformation systems; \n\t\t\tservice-oriented architecture; \n\t\t\tcloud data center; \n\t\t\tend to end IaaS cloud computing infrastructure; \n\t\t\tenterprise computing; \n\t\t\tinformation system reliability; \n\t\t\tinfrastructure as a service; \n\t\t\tvirtualization framework; \n\t\t\tCloud computing; \n\t\t\tComputational modeling; \n\t\t\tComputer architecture; \n\t\t\tOrganizations; \n\t\t\tSecurity; \n\t\t\tStandards organizations; \n\t\t\tVirtual machining;", "name": "Considerations for cloud data centers: Framework, architecture and adoption", "author": "Bakshi, K.", "series_t": "5-12 March 2011", "genre_s": "IEEE", "id": "978-1-4244-7350-2", "cat": "\n\t\t\tCloud computing is one of the fastest growing opportunities for enterprises and service providers. Enterprises use the Infrastructure-as-a-service (IaaS) model to build private clouds, and virtual private clouds that reduce operating and capital expenses and increase the agility and reliability of their critical information systems. Service providers build public clouds to offer on-demand, secure, multi-tenant, pay-per-use IT infrastructure to businesses and government agencies that use cloud services to offload, or augment, their internal resources using a public cloud infrastructure. This paper starts with the cloud taxonomy and model overview. Then the paper describes the Cloud framework and architecture, with characteristics of virtualization and multi-tenancy to build an end-to-end IaaS cloud-computing infrastructure. Logical building blocks for cloud data centers including the virtualized network, compute, and storage resources, which are overlaid with Service orchestration, modular approach and service differentiation elements. The paper also describes phases of adoption of cloud data center by an enterprise.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5898672&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DMethod+for+early+detection+of+PCB+bending+induced+pad+cratering", "features": " \n\t\t\tWeibull distribution; \n\t\t\tacoustic emission; \n\t\t\tball grid arrays; \n\t\t\tbending; \n\t\t\treliability; \n\t\t\tPCB bending induced pad cratering; \n\t\t\tWeibull distributions; \n\t\t\tacoustic emission; \n\t\t\tacoustic method; \n\t\t\telectrical resistance monitoring; \n\t\t\tlong term reliability; \n\t\t\treliability tests; \n\t\t\tAcoustics; \n\t\t\tFailure analysis; \n\t\t\tMonitoring; \n\t\t\tSensors; \n\t\t\tSoldering; \n\t\t\tStrain; \n\t\t\tSurface finishing;", "name": "Method for early detection of PCB bending induced pad cratering", "author": "Bansal, A.Ramakrishna, G.Kuo-Chuan Liu", "series_t": "May 31 2011-June 3 2011", "genre_s": "IEEE", "id": "978-1-61284-497-8", "cat": "\n\t\t\tThe pad cratering phenomenon has caused considerable concern as a type of latent defect that can impact long term reliability. Studies have concluded that the risk for pad cratering is elevated as the industry transitions to lead-free assemblies. In the past, characterization of pad cratering resistance has been problematic because typical board level reliability tests rely on monitoring the electrical resistance of daisy chain components. However, it has been known for some time that the initiation of pad cratering failures does not result in an instantaneous rise in electrical resistance. Therefore several studies have highlighted the need for a board-level methodology to detect the onset of pad cratering. In our recent study a new approach based on monitoring acoustic emission (AE) was introduced. It was shown that in comparison with conventional electrical resistance monitoring, the acoustic method is able to detect the onset of pad cratering failures in board-level mechanical bending tests. This paper builds upon our recent work by evaluating the effects of several variables on the propensity for pad cratering. The tests have been conducted on 1 mm pitch HSBGA, 1 mm pitch FCBGA and 0.8 mm pitch CABGA packages. The effects of strain rate, OSP or ENIG PCB surface finish, and multiple reflows have been evaluated. The results show that the AE method can be used to detect the onset of both pad cratering and brittle solder joint fracture. Based on the measured PCB strain at the onset of failure, Weibull distributions have been used to predict the PCB strain limits.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5934884&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DA+QoS+aware+multicore+hash+scheduler+for+network+applications", "features": " \n\t\t\tWeb services; \n\t\t\tcloud computing; \n\t\t\tmicroprocessor chips; \n\t\t\tmultimedia computing; \n\t\t\tmultiprocessing systems; \n\t\t\toptimisation; \n\t\t\tpeer-to-peer computing; \n\t\t\tprocessor scheduling; \n\t\t\tquality of service; \n\t\t\tradio spectrum management; \n\t\t\tresource allocation; \n\t\t\ttranscoding; \n\t\t\tQoS; \n\t\t\tWeb servers; \n\t\t\tcache awareness; \n\t\t\tcloud computing; \n\t\t\tdeep packet inspection; \n\t\t\tgeneral processor sharing; \n\t\t\tload balancing; \n\t\t\tmulticore architectures; \n\t\t\tmulticore chips; \n\t\t\tmulticore hash scheduling; \n\t\t\tmulticore network; \n\t\t\tmultimedia transcoding; \n\t\t\tnetwork development; \n\t\t\tnetwork spectrum; \n\t\t\toptimization; \n\t\t\tLoad management; \n\t\t\tMulticore processing; \n\t\t\tProcessor scheduling; \n\t\t\tQuality of service; \n\t\t\tScheduling; \n\t\t\tServers; \n\t\t\tTopology; \n\t\t\tCache Locality; \n\t\t\tDPI; \n\t\t\tLoad Balancing; \n\t\t\tMulticore; \n\t\t\tMultimedia; \n\t\t\tQoS; \n\t\t\tScheduling;", "name": "A QoS aware multicore hash scheduler for network applications", "author": "Danhua GuoBhuyan, L.N.", "series_t": "10-15 April 2011", "genre_s": "IEEE", "id": "978-1-4244-9919-9", "cat": "\n\t\t\tAs the line speed of the network evolves at an unprecedented rate, a wide spectrum of network applications call for increasing processing density on network devices. The prevalence of multicore chips ameliorates the stress on processing power, but the QoS guarantee is often ignored. In addition, results of legacy QoS studies are difficult to apply to multicore web servers. Therefore, a multicore scheduler that incorporates QoS concerns is missing. As the network development moves towards cloud computing, we see an increasing importance of QoS guarantees on high performance multicore network appliances. In this paper, we propose a proportional share hash based scheduler, PS-HRW, which extends existing optimizations in multicore scheduling with QoS concerns. We address the network QoS requirement by assigning weights to each connection following the classic General Processor Sharing (GPS) theory. Based on our previous multicore scheduling studies, PS-HRW allocates computing resources based on the QoS requirement, such that the workload is balanced at the packet level, and the connection locality is maintained. To provide accurate QoS guarantee, PS-HRW allocates an integral number of cores first and then allocates the residuals using a partitioning theory. However, different from traditional simulation based approach, we target at two popular applications on modern network appliances: Deep Packet Inspection (DPI) and multimedia transcoding. In addition, we generalize the topology of different multicore architectures into a communication matrix and optimize PS-HRW to incorporate cache awareness. Essentially, PS-HRW schedules incoming traffic efficiently by balancing between connection locality, load balancing, core/cache topology and QoS guarantees.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5963324&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DOn+the+User-Centric+Connection+Availability+of+Mobile+Wireless+Networks", "features": " \n\t\t\tMarkov processes; \n\t\t\tmobile radio; \n\t\t\ttelecommunication congestion control; \n\t\t\tMarkov renewal process; \n\t\t\tasymptotic bound; \n\t\t\taverage speed; \n\t\t\tend user; \n\t\t\tmobile wireless network; \n\t\t\tmobility; \n\t\t\tneighbor connection time; \n\t\t\tneighbor isolation time; \n\t\t\tnode density; \n\t\t\ttransmission range; \n\t\t\tuser connectivity; \n\t\t\tuser-centric connection availability; \n\t\t\tAvailability; \n\t\t\tMarkov processes; \n\t\t\tMeasurement; \n\t\t\tMobile communication; \n\t\t\tMobile computing; \n\t\t\tPeer to peer computing; \n\t\t\tWireless networks;", "name": "On the User-Centric Connection Availability of Mobile Wireless Networks", "author": "Fei XingWenye Wang", "series_t": "5-9 June 2011", "genre_s": "IEEE", "id": "978-1-61284-232-5", "cat": "\n\t\t\tIn this paper we study the connection availability of wireless networks from the perspective of end users with individual mobility, in contrast to existing studies mainly focusing on network-centric connectivity. Specifically, we evaluate the user connectivity by two metrics: neighbor connection time and neighbor isolation time. The former is the time for a node being connected with at least one neighbor; while the latter is the time for a node being isolated before it is connected to new neighbors. By using the theory of Markov renewal process, we obtain the asymptotic bounds on the expected neighbor connection and isolation times, which are dependent on the node density, transmission range, and average speed.We find that if the network is super-critical, implying the existence of a unique giant (connected) component, both asymptotic bounds scale with the number of nodes in the network; otherwise, expected connection and isolation times are constant.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5875729&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DRealistic+approaches+to+scaling+the+IP+network+using+optics", "features": " \n\t\t\tIP networks; \n\t\t\twavelength division multiplexing; \n\t\t\tIP layer over DWDM; \n\t\t\tIP network; \n\t\t\tflexible spectrum; \n\t\t\tHigh speed optical techniques; \n\t\t\tIP networks; \n\t\t\tOptical packet switching; \n\t\t\tOptical switches; \n\t\t\tTransceivers; \n\t\t\tWavelength division multiplexing;", "name": "Realistic approaches to scaling the IP network using optics", "author": "Gerstel, O.", "series_t": "6-10 March 2011", "genre_s": "IEEE", "id": "978-1-4577-0213-6", "cat": "\n\t\t\tWe compare the relative cost and complexity of network architectures that reduce the cost of the IP layer over DWDM. We conclude that a combination of IPoDWDM and flexible spectrum provide the most promising direction.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5772481&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DPractical+architecture+considerations+for+Smart+Grid+WAN+network", "features": " \n\t\t\tIP networks; \n\t\t\tprotocols; \n\t\t\tsmart power grids; \n\t\t\twide area networks; \n\t\t\tCRAS; \n\t\t\tIP infrastructure; \n\t\t\tSCADA data; \n\t\t\tphysical access security; \n\t\t\tpractical architecture consideration; \n\t\t\tsmart grid WAN network; \n\t\t\tstand alone propriety protocol; \n\t\t\tstandardized IP platform; \n\t\t\tstorage; \n\t\t\tsynchrophasor; \n\t\t\ttelephony; \n\t\t\tvideo; \n\t\t\tvoice; \n\t\t\tBandwidth; \n\t\t\tIP networks; \n\t\t\tMultiprotocol label switching; \n\t\t\tQuality of service; \n\t\t\tSubstations; \n\t\t\tVirtual private networks; \n\t\t\tWide area networks;", "name": "Practical architecture considerations for Smart Grid WAN network", "author": "Gobena, Y.Durai, A.Birkner, M.Pothamsetty, V.Varakantam, V.", "series_t": "20-23 March 2011", "genre_s": "IEEE", "id": "978-1-61284-789-4", "cat": "\n\t\t\tOver the past few years, utility applications and services have been evolving from stand alone propriety protocol based to a standardized IP platform based [1]. These utility applications include Synchrophasors, CRAS, SCADA etc. During the same period, use of the enterprise network has moved from simple IP applications to an ever increasing number of advanced technologies being collapsed onto the IP infrastructure. These enterprise applications include video, telephony, storage and physical access security. As critical services such as Voice, Video and SCADA data converge on IP, the resiliency; scalability and availability of the WAN infrastructures become critical. The new converged network must adopt to meet the new stringent requirements while still maintaining flexibility and ease of operations. This paper will start by describing the services and the corresponding communication requirements that the future utility WAN must support. The paper will then propose various architecture models to satisfy the requirements. The paper concludes with comparison of the proposed models against various network optimization criteria.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5898628&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DEffects+of+multiple+rework+on+the+reliability+of+lead-free+Ball+Grid+Array+assemblies", "features": " \n\t\t\tball grid arrays; \n\t\t\tcopper; \n\t\t\tcopper alloys; \n\t\t\tintegrated circuit reliability; \n\t\t\tlead; \n\t\t\tprinted circuits; \n\t\t\tsilver alloys; \n\t\t\ttin alloys; \n\t\t\tCu; \n\t\t\tIMC layer; \n\t\t\tPCB; \n\t\t\tPb; \n\t\t\tSnAgCu; \n\t\t\taccelerated thermal cycling; \n\t\t\tlead-free ball grid array assemblies reliability; \n\t\t\tmicrovias; \n\t\t\tmultiple rework effects; \n\t\t\tplated through hole vias; \n\t\t\tsolder joints; \n\t\t\tDegradation; \n\t\t\tFatigue; \n\t\t\tGold; \n\t\t\tLead; \n\t\t\tReliability; \n\t\t\tSoldering;", "name": "Effects of multiple rework on the reliability of lead-free Ball Grid Array assemblies", "author": "Hongtao MaWeidong XieSubbarayan, G.Kuo-Chuan Liu", "series_t": "May 31 2011-June 3 2011", "genre_s": "IEEE", "id": "978-1-61284-497-8", "cat": "\n\t\t\tIn this work, the effect of multiple rework cycles (up to 5x) on reliability of lead-free assemblies has been investigated. The test vehicle was designed to capture the reliability impact of rework processes on interconnects of BGA devices, the solder joints of its adjacent components and BGA devices of clamshelled devices. The effects on high aspect ratio plated through hole (PTH) vias and microvias were also considered. A variety of BGA packages, such as FCBGA, PBGA, CABGA, etc. were selected to represent different package technologies and stress levels. The effects of multiple reworks on accelerated thermal cycling (ATC) of lead-free solder joints are extensively explored in this study The experimental and analytical findings showed that multiple reworks significantly degraded the ATC performance of the reworked assemblies by up to 50% in terms of characteristic life. It was also found that multiple reworks affect the PTH vias significantly. The combination of increased lead-free rework temperature excursions and high-end PCB aspect ratios may incur higher stresses in the PTH copper barrel. Early failures were observed post multiple reworks and the subsequent ATC test due to PTH barrel cracking. However, the effects of multiple reworks are less severe for devices with microvias compared to that with PTH vias. Multiple reworks also caused severe degradation of long term performance of devices with clamshell designs. With proper control in rework process, multiple reworks have minimum effects on the adjacent BGA solder joints. In addition, failure analysis was performed in order to study the impact of multiple rework on the microstructure of SnAgCu solder joints. It was found that the IMC layer grows thicker as the number of reworks increases; however, the IMC growth rate and morphology are dependent on the surface finish of the package substrate. The failure mode and failure mechanism after ATC were also compared for different number of rework cycles. The implicat- - ions of these results for the reliability of lead-free solder joints are discussed in this paper.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5759735&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DIsothermal+Aging+Effects+on+the+Mechanical+Shock+Performance+of+Lead-Free+Solder+Joints", "features": " \n\t\t\tageing; \n\t\t\tball grid arrays; \n\t\t\tcopper alloys; \n\t\t\telectronic products; \n\t\t\telectronics industry; \n\t\t\tfailure analysis; \n\t\t\tflip-chip devices; \n\t\t\timpact (mechanical); \n\t\t\tsolders; \n\t\t\ttin alloys; \n\t\t\tCu<sub>3</sub>Sn; \n\t\t\tCu<sub>6</sub>Sn<sub>5</sub>; \n\t\t\tIMC growth; \n\t\t\tboard-level dynamic performance; \n\t\t\telectronic products; \n\t\t\tfailure analysis; \n\t\t\tflip-chip ball grid array package; \n\t\t\tintermetallic compound failures; \n\t\t\tisothermal aging effects; \n\t\t\tlead-free FCBGA packages; \n\t\t\tlead-free solder joints; \n\t\t\tmechanical shock performance; \n\t\t\ttemperature 100 degC; \n\t\t\ttemperature 150 degC; \n\t\t\ttemperature 75 degC; \n\t\t\tAging; \n\t\t\tDegradation; \n\t\t\tElectric shock; \n\t\t\tLead; \n\t\t\tMaterials; \n\t\t\tMicrostructure; \n\t\t\tSoldering; \n\t\t\tAging effects; \n\t\t\tball grid array packages; \n\t\t\tlead-free solder joints; \n\t\t\tmechanical shock; \n\t\t\tpad cratering;", "name": "Isothermal Aging Effects on the Mechanical Shock Performance of Lead-Free Solder Joints", "author": "Hongtao MaTae-Kyu LeeDong Hyun KimPark, H.G.Sang Ha KimKuo-Chuan Liu", "series_t": "May 2011", "genre_s": "IEEE", "id": "2156-3950", "cat": "\n\t\t\tIsothermal aging effects on lead-free solders have been extensively investigated in recent studies. Researches show that aging effects significantly degrade the mechanical properties of lead-free solders. However, limited work has been done on the effects of aging on the board-level dynamic performance of lead-free solder joints, especially for large flip-chip ball grid array (FCBGA) packages. Due to the sensitivity of aging effects on lead-free solders, it is crucial to investigate the aging effects on the board-level dynamic performance of lead-free solders. In this paper, dynamic performance of lead-free solder joints has been characterized and isothermal aging effects have been investigated. It was found that the dynamic shock performance of lead-free FCBGA packages significantly degrades up to 20-35% after aging at elevated temperatures. It was also observed that aging at 100°C shows more severe degradation than aging at 75°C and 150°C. This is an important finding because many electronic products operate in the 100°C range for long periods. The unique finding of aging effects is related to the growth of Cu3Sn and Cu6Sn5 intermetallics after aging. Even though failure analysis shows mixed failure of pad cratering and intermetallic compound (IMC) failures, the IMC growth is the most sensitive factor contributing to the failure observed.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5738857&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DIdentification+of+Carnatic+raagas+using+Hidden+Markov+Models", "features": " \n\t\t\tacoustic signal processing; \n\t\t\tfeature extraction; \n\t\t\thidden Markov models; \n\t\t\tmusic; \n\t\t\tCarnatic musician; \n\t\t\tCarnatic raaga; \n\t\t\tRaaga identification; \n\t\t\tSpecmurt analysis; \n\t\t\thidden Markov model backend system; \n\t\t\tinformation extraction; \n\t\t\tlog frequency domain; \n\t\t\tmusic sample extraction; \n\t\t\tEstimation; \n\t\t\tFrequency estimation; \n\t\t\tHarmonic analysis; \n\t\t\tHidden Markov models; \n\t\t\tMathematical model; \n\t\t\tMultiple signal classification; \n\t\t\tMusic; \n\t\t\thidden markov models; \n\t\t\tmusic recognition; \n\t\t\traaga; \n\t\t\tspecmurt; \n\t\t\tswara;", "name": "Identification of Carnatic raagas using Hidden Markov Models", "author": "Krishna, A.S.Rajkumar, P.V.Saishankar, K.P.John, M.", "series_t": "27-29 Jan. 2011", "genre_s": "IEEE", "id": "978-1-4244-7429-5", "cat": "\n\t\t\tRaaga identification is one of the key areas for budding Carnatic musicians and avid listeners. Identification and knowledge of the raaga of a song not only implies knowledge of music but also helps establish the mood of a song. We propose to identify a Carnatic raaga by extracting from the music sample, information about the 12 distinguishable frequencies in an octave. The proposed technique is Specmurt analysis which involves the analysis of a signal in its log-frequency domain. The extracted information is fed to the Hidden Markov Model back-end system where each raaga has its associated model.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5738326&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DDifferential+Extrapolation+Method+for+Separating+Dielectric+and+Rough+Conductor+Losses+in+Printed+Circuit+Boards", "features": " \n\t\t\tadhesion; \n\t\t\tconductors (electric); \n\t\t\tdielectric losses; \n\t\t\textrapolation; \n\t\t\tpermittivity; \n\t\t\tprinted circuit interconnections; \n\t\t\tprinted circuits; \n\t\t\tscanning electron microscopy; \n\t\t\tsurface roughness; \n\t\t\tPCB substrate dielectrics; \n\t\t\taverage peak-to-valley amplitude; \n\t\t\tconductor roughness; \n\t\t\tdielectric loss; \n\t\t\tdifferential extrapolation method; \n\t\t\tdistance-to-ground planes; \n\t\t\thigh-speed digital designs; \n\t\t\tprinted circuit board transmission lines; \n\t\t\tprinted circuit boards interconnects; \n\t\t\trough conductor loss; \n\t\t\tscanning electron microscopy images; \n\t\t\tsignal trace geometry parameters; \n\t\t\tsurface roughness; \n\t\t\tthree transmission lines; \n\t\t\tConductors; \n\t\t\tDielectric losses; \n\t\t\tRough surfaces; \n\t\t\tSurface impedance; \n\t\t\tSurface roughness; \n\t\t\tTransmission line measurements; \n\t\t\t<formula formulatype=\"inline\"><tex Notation=\"TeX\">$hbox{S}$</tex></formula>-parameters; \n\t\t\tConductor surface roughness; \n\t\t\tdielectric constant (Dk); \n\t\t\tdissipation factor (Df); \n\t\t\tloss tangent; \n\t\t\tprinted circuit board (PCB);", "name": "Differential Extrapolation Method for Separating Dielectric and Rough Conductor Losses in Printed Circuit Boards", "author": "Koul, A.Koledintseva, M.Y.Hinaga, S.Drewniak, J.L.", "series_t": "April 2012", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tCopper foil in printed circuit board (PCB) transmission lines/interconnects is roughened to promote adhesion to dielectric substrates. It is important to characterize PCB substrate dielectrics and correctly separate dielectric and conductor losses, especially as data rates in high-speed digital designs increase. Herein, a differential method is proposed for separating conductor and dielectric losses in PCBs with rough conductors. This approach requires at least three transmission lines with identical, or at least as close as technologically possible, basic geometry parameters of signal trace, distance-to-ground planes, and dielectric properties, while the average peak-to-valley amplitude of surface roughness of the conductor would be different. The peak-to-valley amplitude of conductor roughness is determined from scanning electron microscopy images.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5944543&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DEffects+of+circuit+and+operating+parameters+on+the+small-signal+dynamics+of+average-current-mode-controlled+DC-DC+converters", "features": " \n\t\t\tDC-DC power convertors; \n\t\t\telectric current control; \n\t\t\ttransfer functions; \n\t\t\taverage-current-mode-controlled DC-DC converters; \n\t\t\taveraged-current- mode-controlled buck converter; \n\t\t\tcontrol-to-output voltage transfer function; \n\t\t\tconverter circuit; \n\t\t\tsmall-signal dynamics; \n\t\t\tGain; \n\t\t\tIntegrated circuit modeling; \n\t\t\tPulse width modulation; \n\t\t\tResonant frequency; \n\t\t\tTransfer functions; \n\t\t\tVoltage control; \n\t\t\tAverage current mode control; \n\t\t\tDC-DC converters; \n\t\t\tparameter effects; \n\t\t\tsmall-signal average models;", "name": "Effects of circuit and operating parameters on the small-signal dynamics of average-current-mode-controlled DC-DC converters", "author": "Ruqi LiO'Brien, T.Lee, J.Beecroft, J.", "series_t": "May 30 2011-June 3 2011", "genre_s": "IEEE", "id": "978-1-61284-958-4", "cat": "\n\t\t\tThis paper presents a detailed and quantitative analysis of parameter effects on the small signal dynamics of DC-DC converters with average current mode control. The parameters under study include the converter circuit and its operating parameters. Their effects on the converter frequency response are analyzed and clearly characterized in low, mid, and high frequency ranges of the control-to-output voltage transfer function of the control scheme. In addition, new insights into average current mode control are uncovered and discussed. Measurable results on an experimental averaged-current mode-controlled Buck converter are provided to facilitate the analytical study with good correlation.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5685561&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DRate-Distortion+Optimized+Joint+Source%2FChannel+Coding+of+WWAN+Multicast+Video+for+a+Cooperative+Peer-to-Peer+Collective", "features": " \n\t\t\tcombined source-channel coding; \n\t\t\tcooperative communication; \n\t\t\tpeer-to-peer computing; \n\t\t\trate distortion theory; \n\t\t\twide area networks; \n\t\t\twireless LAN; \n\t\t\tWWAN multicast video; \n\t\t\tcooperative peer-to-peer collective; \n\t\t\tforward error correction; \n\t\t\tjoint source-channel coding; \n\t\t\trate distortion; \n\t\t\tsub-optimal video quality; \n\t\t\twireless local area network; \n\t\t\twireless packet losses; \n\t\t\twireless wide area networks; \n\t\t\tCooperative peer-to-peer repair; \n\t\t\tjoint source-channel coding; \n\t\t\tnetwork coding;", "name": "Rate-Distortion Optimized Joint Source/Channel Coding of WWAN Multicast Video for a Cooperative Peer-to-Peer Collective", "author": "Liu, L.X.Gene CheungChuah, Chen-Nee", "series_t": "Jan. 2011", "genre_s": "IEEE", "id": "1051-8215", "cat": "\n\t\t\tBecause of unavoidable wireless packet losses and inapplicability of retransmission-based schemes due to the well-known negative acknowledgment implosion problem, providing high quality video multicast over wireless wide area networks (WWAN) remains difficult. Traditional joint source/channel coding (JSCC) schemes for video multicast target a chosen th-percentile WWAN user. Users with poorer reception than th-percentile user (poor users) suffer substantial channel losses, while users with better reception (rich users) have more channel coding than necessary, resulting in sub-optimal video quality. In this paper, we recast the WWAN JSCC problem in a new setting called cooperative peer-to-peer repair (CPR), where users have both WWAN and wireless local area network (WLAN) interfaces and use the latter to exchange received WWAN packets locally. Given CPR can mitigate some WWAN losses via cooperative peer exchanges, a CPR-aware JSCC scheme can now allocate more bits to source coding to minimize source quantization noise without suffering more packet losses, leading to smaller overall visual distortion. Through CPR, this quality improvement is in fact reaped by all peers in the collective, not just a targeted th-percentile user. To efficiently implement both WWAN forward error correction and WLAN CPR repairs, we propose to use network coding for this dual purpose to reduce decoding complexity and maximize packet recovery at the peers. We show that a CPR-aware JSCC scheme dramatically improves video quality: by up to 8.7 dB in peak signal-to-noise ratio for the entire peer group over JSCC scheme without CPR, and by up to 6.0 dB over a CPR-ignorant JSCC scheme with CPR.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5744078&contentType=Early+Access+Articles&searchField%3DSearch_All%26queryText%3DQoS-Driven+Service+Composition+with+Reconfigurable+Services", "features": " \n\t\t\tdecision making; \n\t\t\tquality of service; \n\t\t\treconfigurable architectures; \n\t\t\tsearch problems; \n\t\t\tservice-oriented architecture; \n\t\t\tCDP; \n\t\t\tQoS-driven service composition; \n\t\t\tcompositional decision making process; \n\t\t\tconfiguration parameter settings; \n\t\t\tdecision space; \n\t\t\toptimal QoS-driven composition solutions; \n\t\t\tperformance gains; \n\t\t\trapid system composition; \n\t\t\trapid system deployment; \n\t\t\treconfigurable service modeling; \n\t\t\tsearch space reduction; \n\t\t\tservice composition decision making; \n\t\t\tservice-oriented architecture; \n\t\t\tsystem QoS requirements; \n\t\t\tAuthentication; \n\t\t\tConcrete; \n\t\t\tEncoding; \n\t\t\tMedia; \n\t\t\tQuality of service; \n\t\t\tXML; \n\t\t\tService-oriented architecture; \n\t\t\tquality of service (QoS); \n\t\t\treconfigurable services; \n\t\t\tservice composition;", "name": "QoS-Driven Service Composition with Reconfigurable Services", "author": "Hui MaBastani, F.I-Ling YenHong Mei", "series_t": "First Quarter 2013", "genre_s": "IEEE", "id": "1939-1374", "cat": "\n\t\t\tService-oriented architecture provides a framework for achieving rapid system composition and deployment. To satisfy different system QoS requirements, it is possible to select an appropriate set of concrete services and compose them to achieve the QoS goals. In addition, some of the services may be reconfigurable and provide various QoS tradeoffs. To make use of these reconfigurable services, the composition process should consider not only service selection, but also configuration parameter settings. However, existing QoS-driven service composition research does not consider reconfigurable services. Moreover, the decision space may be enormous when reconfigurable services are considered. In this paper, we deal with the issues of reconfigurable service modeling and efficient service composition decision making. We introduce a novel compositional decision making process, CDP, which explores optimal solutions of individual component services and uses the knowledge to derive optimal QoS-driven composition solutions. Experimental studies show that the CDP approach can significantly reduce the search space and achieve great performance gains. We also develop a case study system to validate the proposed approach and the results confirm the feasibility and effectiveness of reconfigurable services.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5783492&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DNeighborhood-Centric+Congestion+Control+for+Multihop+Wireless+Mesh+Networks", "features": " \n\t\t\tminimax techniques; \n\t\t\ttelecommunication congestion control; \n\t\t\ttransport protocols; \n\t\t\twireless mesh networks; \n\t\t\tAIMD-based rate-control protocol; \n\t\t\tTCP; \n\t\t\tWCPCap; \n\t\t\tcapacity estimation; \n\t\t\tdistributed rate controller; \n\t\t\tmax-min optimal rates; \n\t\t\tneighborhood-centric congestion control; \n\t\t\tstatic multihop wireless mesh networks; \n\t\t\ttransport protocol performance; \n\t\t\twireless congestion; \n\t\t\twireless control protocol; \n\t\t\tEstimation; \n\t\t\tIEEE 802.11 Standards; \n\t\t\tProtocols; \n\t\t\tSpread spectrum communication; \n\t\t\tTopology; \n\t\t\tWireless networks; \n\t\t\tCongestion control; \n\t\t\tWireless Control Protocol (WCP); \n\t\t\tWireless Control Protocol with Capacity estimation (WCPCap); \n\t\t\tmesh; \n\t\t\tmultihop; \n\t\t\twireless;", "name": "Neighborhood-Centric Congestion Control for Multihop Wireless Mesh Networks", "author": "Rangwala, S.Jindal, A.Ki-Young JangPsounis, K.Govindan, R.", "series_t": "Dec. 2011", "genre_s": "IEEE", "id": "1063-6692", "cat": "\n\t\t\tComplex interference in static multihop wireless mesh networks can adversely affect transport protocol performance. Since TCP does not explicitly account for this, starvation and unfairness can result from the use of TCP over such networks. In this paper, we explore mechanisms for achieving fair and efficient congestion control for multihop wireless mesh networks. First, we design an AIMD-based rate-control protocol called Wireless Control Protocol (WCP), which recognizes that wireless congestion is a neighborhood phenomenon, not a node-local one, and appropriately reacts to such congestion. Second, we design a distributed rate controller that estimates the available capacity within each neighborhood and divides this capacity to contending flows, a scheme we call Wireless Control Protocol with Capacity estimation (WCPCap). Using analysis, simulations, and real deployments, we find that our designs yield rates that are both fair and efficient. WCP assigns rates inversely proportional to the number of bottlenecks a flow passes through while remaining extremely easy to implement. An idealized version of WCPCap is max-min fair, whereas a practical implementation of the scheme achieves rates within 15% of the max-min optimal rates while still being distributed and amenable to real implementation.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5898565&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DImpact+of+isothermal+aging+on+Sn-Ag-Cu+solder+interconnect+board+level+high+G+mechanical+shock+performance", "features": " \n\t\t\tcopper; \n\t\t\tintegrated circuit interconnections; \n\t\t\tmasks; \n\t\t\tmechanical stability; \n\t\t\tsilver; \n\t\t\tsolders; \n\t\t\ttin; \n\t\t\tAg; \n\t\t\tCu; \n\t\t\tSn; \n\t\t\tisothermal aging; \n\t\t\tjoint stability; \n\t\t\tmechanical shock performance; \n\t\t\tmechanical stability; \n\t\t\tsolder interconnect board level; \n\t\t\tsolder mask; \n\t\t\tAging; \n\t\t\tElectric shock; \n\t\t\tIsothermal processes; \n\t\t\tJoints; \n\t\t\tMicrostructure; \n\t\t\tScanning electron microscopy; \n\t\t\tStrain;", "name": "Impact of isothermal aging on Sn-Ag-Cu solder interconnect board level high G mechanical shock performance", "author": "Tae-Kyu LeeWeidong XieKuo-Chuan Liu", "series_t": "May 31 2011-June 3 2011", "genre_s": "IEEE", "id": "978-1-61284-497-8", "cat": "\n\t\t\tThe mechanical stability of solder joints with Sn-Ag-Cu was an issue since the material was applied to the consumer electronic field. Various shock test methods were developed and standardized tests are used in the industry worldwide. Although it is applied for several years, the detailed mechanism of the shock induced failure mechanism is still under investigation. The work reported here concerns the root cause of shock failures with High G shock, the joint stability under various strain and shock level combinations and the impact of isothermal aging on board level shock performance. A test vehicle is developed to have various strain and shock level conditions in one board. Along with no aged 17×17mm CABGA package samples, isothermal aging were applied to the samples to observe the impact of different interface microstructures. The result revealed a clear indication of the strain and shock correlation with a trend of isothermal aging induced degradation. The impact of isothermal aging, strain and shock level on two different pad designs, non solder mask defined and solder mask defined are also discussed.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5990598&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DEmbedded+approach+for+device+inventory+collection+utilizing+OS+programmability", "features": " \n\t\t\tcomputer network management; \n\t\t\tdistributed processing; \n\t\t\toperating systems (computers); \n\t\t\tprogramming; \n\t\t\tCLI information; \n\t\t\tOS programmability; \n\t\t\tSNMP information; \n\t\t\tcomputer network management; \n\t\t\tdevice inventory collection; \n\t\t\tdistributed embedded approach; \n\t\t\tnetwork device information; \n\t\t\tnetwork management; \n\t\t\tFires; \n\t\t\tHeating; \n\t\t\tHome appliances; \n\t\t\tIndexes; \n\t\t\tLogic gates; \n\t\t\tServers; \n\t\t\tStandards;", "name": "Embedded approach for device inventory collection utilizing OS programmability", "author": "Lin, S.S.Thompson, G.S.Malaviya, V.", "series_t": "23-27 May 2011", "genre_s": "IEEE", "id": "978-1-4244-9219-0", "cat": "\n\t\t\tA major task of managing a computer network is to gather the inventory of the devices, including hardware, software, and the configuration. It is desirable to collect this information efficiently. Traditional Network Management tools require an appliance that resides on the network to collect device information. This paper introduces a distributed, embedded approach to collect network device information without an extra appliance. Utilizing device programmability with add on scripts, the network devices can communicate with each other and perform the inventory collection tasks. The collected inventory information can be sent to network management stations or hosted inventory reporting applications. This mechanism is used on Cisco devices without any device OS upgrade by using a set of scripts to collect CLI and SNMP information from the devices. Utilizing the computing power on multiple networking devices, this distributed mechanism can concurrently collect the whole network inventory efficiently. This paper gives the overview of the approach, then drills into the architecture, mechanism of the scripts, the coding standards, performance, impact to the devices, scalability, benefits, and discusses future work.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5714751&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DLayered+Internet+Video+Adaptation+.LB.LIVA.RB.%3A+Network-Assisted+Bandwidth+Sharing+and+Transient+Loss+Protection+for+Video+Streaming", "features": " \n\t\t\tInternet; \n\t\t\tLinux; \n\t\t\ttelecommunication traffic; \n\t\t\tvideo coding; \n\t\t\tvideo streaming; \n\t\t\tLinux-based demonstration; \n\t\t\tfair-rate allocation; \n\t\t\tforward error correction protection; \n\t\t\tlayered internet video adaptation; \n\t\t\tmedia-aware bandwidth sharing; \n\t\t\tnetwork-assisted bandwidth sharing; \n\t\t\ttransient loss protection; \n\t\t\tvideo rate-distortion characteristics; \n\t\t\tvideo streaming; \n\t\t\tBandwidth; \n\t\t\tForward error correction; \n\t\t\tInternet; \n\t\t\tResource management; \n\t\t\tStatic VAr compensators; \n\t\t\tStreaming media; \n\t\t\tTransient analysis; \n\t\t\tExplicit congestion notification (ECN); \n\t\t\tforward error correction (FEC); \n\t\t\tmedia-aware bandwidth sharing; \n\t\t\tscalable video coding (SVC);", "name": "Layered Internet Video Adaptation (LIVA): Network-Assisted Bandwidth Sharing and Transient Loss Protection for Video Streaming", "author": "Xiaoqing ZhuRong PanPrabhu, M.S.Dukkipati, N.Subramanian, V.Bonomi, F.", "series_t": "Aug. 2011", "genre_s": "IEEE", "id": "1520-9210", "cat": "\n\t\t\tAs video traffic increases in the Internet and competes for limited bandwidth resources, it is important to design bandwidth-sharing and loss-protection schemes that account for video characteristics, beyond the traditional paradigm of fair-rate allocation among data flows. Ideally, such a scheme should handle both persistent and transient congestion as video streaming applications demand low-latency transmissions and low packet-loss ratios. This paper presents a novel scheme, layered Internet video adaptation (LIVA), in which network nodes feed back virtual congestion levels to video senders to assist both media-aware bandwidth sharing and transient-loss protection. The video senders respond to such feedback by adapting the rates of encoded scalable bitstreams based on their respective video rate-distortion (R-D) characteristics. The same feedback is employed to calculate the amount of forward error correction (FEC) protection for combating transient losses. Simulation studies show that LIVA can minimize the total distortion of all participating video streams and hence maximize their overall quality. At steady state, video streams experience no queueing delays or packet losses. In the face of transient congestion, the network-assisted adaptive FEC promptly protects video packets from losses. Our Linux-based demonstration showcases how LIVA can be implemented in a simple manner in real systems. We also present a solution for LIVA streams to coexist with TCP flows based on explicit congestion notification signaling. Finally, our theoretical analysis guarantees system stability for an arbitrary number of streams with round-trip delays below a prescribed limit.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5780224&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAutomatic+Particle+Picking+from+Cryo-Electron+Microscopy+Images+by+Using+Partial+Least+Squares", "features": " \n\t\t\tbiological techniques; \n\t\t\tbiology computing; \n\t\t\tbiothermics; \n\t\t\tfeature extraction; \n\t\t\timage reconstruction; \n\t\t\tleast squares approximations; \n\t\t\tmolecular biophysics; \n\t\t\ttransmission electron microscopy; \n\t\t\t3D reconstruction; \n\t\t\tautomatic particle picking; \n\t\t\tcomputer screen; \n\t\t\tcryoelectron microscopy images; \n\t\t\tmicrographs; \n\t\t\tpartial least squares; \n\t\t\tparticle selection; \n\t\t\tprojections; \n\t\t\tsingle-particle analysis; \n\t\t\tthree-dimensional structure; \n\t\t\tBiology; \n\t\t\tFeature extraction; \n\t\t\tImage reconstruction; \n\t\t\tMicroscopy; \n\t\t\tPrincipal component analysis; \n\t\t\tThree dimensional displays; \n\t\t\tTraining;", "name": "Automatic Particle Picking from Cryo-Electron Microscopy Images by Using Partial Least Squares", "author": "Xiaorong Wu", "series_t": "10-12 May 2011", "genre_s": "IEEE", "id": "978-1-4244-5088-6", "cat": "\n\t\t\tSingle-particle analysis is a three-dimensional (3D) structure determining technique using electron microscopy. In this technique, a large number of projections is required to create 3D reconstruction. Manual selection of particles, by visual observation of the micrographs on a computer screen, is recognized as a bottleneck in automated single-particle reconstruction. In this paper, we established a brand-new method which is based on partial least squares theory. After initial selection for candidate particles, a PLS recognition model is set up to identify the needed particles from the candidates.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5974386&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DResearch+of+the+personalized+recommender+for+E-Commerce+based+on+web+usage+mining+and+collaborative+filtering+technique", "features": " \n\t\t\tInternet; \n\t\t\tdata mining; \n\t\t\telectronic commerce; \n\t\t\tgroupware; \n\t\t\tinformation filtering; \n\t\t\trecommender systems; \n\t\t\tWeb log mining; \n\t\t\tWeb usage mining; \n\t\t\taccess matrix; \n\t\t\tcollaborative filtering technique; \n\t\t\te-commerce; \n\t\t\tpersonalized recommender; \n\t\t\tBusiness; \n\t\t\tCollaboration; \n\t\t\tManganese; \n\t\t\tRecommender systems; \n\t\t\tTin; \n\t\t\tWriting; \n\t\t\tE-commerce; \n\t\t\tPersonalized Recommendation; \n\t\t\tweb usage mining;", "name": "Research of the personalized recommender for E-Commerce based on web usage mining and collaborative filtering technique", "author": "Xinmeng ZhangShengYi Jiang", "series_t": "27-29 June 2011", "genre_s": "IEEE", "id": "978-1-4244-9762-1", "cat": "\n\t\t\tPersonalized recommender services of E-Commerce provides users with the preference items based on their Interest.Through web log mining,Forms the users' access matrix,Calculate the similarity of users' browsing habits and get the k-nearest neighbor users,According to neighbors' project evaluation,forecast the target user's evaluation of the project and give A top-N recommended items. Experiments show that the algorithm efficiency are achieved satisfactory recommendation results and solve the problem of new users in a degree.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5875690&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DDesign+green+and+cost-effective+translucent+optical+networks", "features": " \n\t\t\toptical fibre communication; \n\t\t\toptical repeaters; \n\t\t\ttelecommunication network topology; \n\t\t\tall-optical 2R regenerators; \n\t\t\tnetwork design algorithm; \n\t\t\tpower consumption; \n\t\t\ttranslucent optical networks; \n\t\t\tBit error rate; \n\t\t\tNonlinear optics; \n\t\t\tOptical amplifiers; \n\t\t\tOptical fiber amplifiers; \n\t\t\tOptical fiber networks; \n\t\t\tRepeaters;", "name": "Design green and cost-effective translucent optical networks", "author": "Zuqing Zhu", "series_t": "6-10 March 2011", "genre_s": "IEEE", "id": "978-1-4577-0213-6", "cat": "\n\t\t\tWe report a network design algorithm to effectively reduce the cost and power consumption of translucent networks by using all-optical 2R regenerators. Simulation results show that the number of O/E/O 3R can be effectively reduced.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5771956&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DMixed+Placement+of+1R%2F2R%2F3R+Regenerators+in+Translucent+Optical+Networks+to+Achieve+Green+and+Cost-Effective+Design", "features": " \n\t\t\tenvironmental factors; \n\t\t\terror statistics; \n\t\t\toptical fibre networks; \n\t\t\toptical repeaters; \n\t\t\t1R-2R-3R regenerator; \n\t\t\tBER evolution; \n\t\t\tall-optical 2R regenerator; \n\t\t\tcost-effective design; \n\t\t\tgreen design; \n\t\t\tjitter effect; \n\t\t\treshaping nonlinearity; \n\t\t\ttranslucent optical network; \n\t\t\tAdaptive optics; \n\t\t\tAlgorithm design and analysis; \n\t\t\tBit error rate; \n\t\t\tJitter; \n\t\t\tNoise; \n\t\t\tOptical fiber networks; \n\t\t\tRepeaters; \n\t\t\tOptical regeneration; \n\t\t\tgreen networks; \n\t\t\tregenerator placement; \n\t\t\ttranslucent optical networks;", "name": "Mixed Placement of 1R/2R/3R Regenerators in Translucent Optical Networks to Achieve Green and Cost-Effective Design", "author": "Zuqing Zhu", "series_t": "July 2011", "genre_s": "IEEE", "id": "1089-7798", "cat": "\n\t\t\tWe develop a theoretical model to estimate the BER evolutions in optical translucent networks in a more accurate way. The model calculates the BER increment at each regeneration site with considerations of reshaping nonlinearity and jitter effect for 40 Gb/s signals. Based on the model, we propose a novel translucent optical network infrastructure that includes all-optical 2R regenerators and uses mixed operation of 1R/2R/3R regenerators for cost and power consumption savings. Simulation results show that our proposed infrastructure reduces the number of O/E/O 3R regenerators to less than 50% and achieves effective power saving.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5453343&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DGenerating+Reliable+Code+from+Hybrid-Systems+Models", "features": " \n\t\t\tdistributed processing; \n\t\t\tembedded systems; \n\t\t\tformal specification; \n\t\t\tprogram compilers; \n\t\t\tcode generation; \n\t\t\tcommunication delays; \n\t\t\tcontinuous dynamics; \n\t\t\tdiscrete control; \n\t\t\tdistributed embedded systems; \n\t\t\tembedded systems; \n\t\t\thybrid systems; \n\t\t\tmodel heater system; \n\t\t\tComputational modeling; \n\t\t\tDifferential equations; \n\t\t\tEquations; \n\t\t\tInstruments; \n\t\t\tMathematical model; \n\t\t\tNumerical models; \n\t\t\tVehicles; \n\t\t\tFormal languages; \n\t\t\tsoftware engineering.;", "name": "Generating Reliable Code from Hybrid-Systems Models", "author": "Anand, M.Fischmeister, S.Hur, Y.Jesung KimInsup Lee", "series_t": "Sept. 2010", "genre_s": "IEEE", "id": "0018-9340", "cat": "\n\t\t\tHybrid systems have emerged as an appropriate formalism to model embedded systems as they capture the theme of continuous dynamics with discrete control. Under this paradigm, distributed embedded systems can be modeled as a network of communicating hybrid automata. Several techniques for code generation from these models have also been proposed and commercially implemented. Providing formal guarantees of the generated code with respect to the model, however, has turned out to be a hard problem. While the model is set in continuous time with concurrent execution and instantaneous switching, the code running on an inherently discrete platform, can be affected by the sampling interval, round-off errors, and communication delays between the sensor, controller, and actuators. Consequently, semantic differences between the model and its code can arise with potentially different system behavior. This paper proposes a criterion for faithful implementation of the hybrid-systems model with a focus on its switching semantics. We discuss different techniques to ensure a faithful implementation of the model, and test the feasibility of our concepts by implementing a model heater system. In this heater case study, we successfully eliminate all fault transitions and, thereby, generate code with correct behavior complying with the specification.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5421780&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DOn+the+Scalability+of+RTCP-Based+Network+Tomography+for+IPTV+Services", "features": " \n\t\t\tIPTV; \n\t\t\tquality of service; \n\t\t\ttransport protocols; \n\t\t\tIPTV service; \n\t\t\tQoE diagnostics; \n\t\t\tQoE monitoring; \n\t\t\tQoE reporting; \n\t\t\tRTCP-based network tomography; \n\t\t\tRTP control protocol; \n\t\t\tquality of experience; \n\t\t\treal-time transport protocol; \n\t\t\tservice provider; \n\t\t\tCable TV; \n\t\t\tCommunications Society; \n\t\t\tFeedback; \n\t\t\tIPTV; \n\t\t\tMonitoring; \n\t\t\tPower cables; \n\t\t\tSatellite broadcasting; \n\t\t\tScalability; \n\t\t\tTomography; \n\t\t\tTransport protocols;", "name": "On the Scalability of RTCP-Based Network Tomography for IPTV Services", "author": "Begen, A.C.Perkins, C.Ott, J.", "series_t": "9-12 Jan. 2010", "genre_s": "IEEE", "id": "978-1-4244-5175-3", "cat": "\n\t\t\tQuality of experience (QoE) is an important, and admittedly overloaded, concept for the emerging IPTV services. Service providers are continuously working towards delivering a better TV experience. To this effect, cost-effective and scalable tools are highly desirable for QoE monitoring, diagnostics and reporting. In this paper, we demonstrate that the RTP control protocol and its network tomography extensions can satisfy the needs of the providers in collecting and reporting both detailed and summarized information using several numerical examples based on real-life scenarios.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5677777&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DRotated+Face+Detection+Using+AdaBoost", "features": " \n\t\t\tartificial intelligence; \n\t\t\tcomputer vision; \n\t\t\tface recognition; \n\t\t\tAdaBoost; \n\t\t\tcomputer vision; \n\t\t\timage plane; \n\t\t\tmachine intelligence; \n\t\t\trotated face detection; \n\t\t\tClassification algorithms; \n\t\t\tDetectors; \n\t\t\tFace; \n\t\t\tFace detection; \n\t\t\tFeature extraction; \n\t\t\tPixel; \n\t\t\tTraining;", "name": "Rotated Face Detection Using AdaBoost", "author": "Bi LiAiming YangJun Yang", "series_t": "25-26 Dec. 2010", "genre_s": "IEEE", "id": "978-1-4244-7939-9", "cat": "\n\t\t\tFace detection is a challenging problem in the field of computer vision and a key component of machine intelligence. Viola and Jones put forward a face detection framework in 2001 that can process images extremely rapidly while achieving high detection rates. This paper extends the framework to handle rotated faces through a simple improvement. The method is to rotate the detected sub-windows by 30 degree clockwise and counterclockwise within the image plane. Experimental results show that the proposed algorithm has a good detection rate and reduces the false positives regardless of the rotation of the faces.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5448078&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DSEU+concept+to+reality+.LB.allocation%2C+prediction%2C+mitigation.RB.", "features": " \n\t\t\tcircuit reliability; \n\t\t\telectronics industry; \n\t\t\tfailure analysis; \n\t\t\ttransient analysis; \n\t\t\tSEU allocation; \n\t\t\tSEU mitigation; \n\t\t\tSEU prediction; \n\t\t\talpha particle; \n\t\t\tatmospheric neutron; \n\t\t\tavailability modeling; \n\t\t\telectronic circuitry; \n\t\t\tfailure rate allocation; \n\t\t\treliability analysis; \n\t\t\treturned material authorization; \n\t\t\tsingle event upset; \n\t\t\tsoft error failure; \n\t\t\ttransient fault; \n\t\t\tAlpha particles; \n\t\t\tAuthorization; \n\t\t\tAvailability; \n\t\t\tCircuit faults; \n\t\t\tFailure analysis; \n\t\t\tImpurities; \n\t\t\tNeutrons; \n\t\t\tReliability engineering; \n\t\t\tSilicon; \n\t\t\tSingle event upset; \n\t\t\tFault; \n\t\t\tFault Management; \n\t\t\tHardware; \n\t\t\tLatch up; \n\t\t\tMulti-Bit Error; \n\t\t\tSER; \n\t\t\tSEU; \n\t\t\tSingle Bit Error; \n\t\t\tSoft Error; \n\t\t\tSoftware;", "name": "SEU concept to reality (allocation, prediction, mitigation)", "author": "Bidokhti, N.", "series_t": "25-28 Jan. 2010", "genre_s": "IEEE", "id": "978-1-4244-5102-9", "cat": "\n\t\t\tFor a number of years products are being impacted by transient faults that cause the systems to fail and returned to suppliers as returned material authorization (RMA). After further analysis, they deemed to be good and no problem found and ultimately sent back out to potential customers and replacements. These returns are most likely being caused by Single Event Upsets. The phenomenon of Single Event Upset (SEU) is a well known and documented and affects electronic circuitry. SEUs are caused by either atmospheric neutrons or alpha particles emitted by trace impurities in the silicon processing and packaging materials. SEUs could cause single or multiple bit errors in the components such as ASCIs, FPGAs, processors and memories. All of these components are susceptible to SEU, but in the traditional reliability analysis of products, these failures are not included. Reliability engineers calculate the failure rate for components based on hard failures and are totally discounting the Soft Error failures. In addition, when reliability engineers are performing availability modeling and failure allocation, SEUs are not included in their analysis. Therefore, the accuracy of their analysis could be questionable. The goal of this paper is to discuss the allocation, Prediction and mitigation of SEU in the design. It is hard to believe a reliability analysis of a component or a board is completed without any consideration to SEU. This paper will discuss the following: 1) Concept of SEU and what is Single Event Upset (SEU) and sources of SEU 2) Example of field events 3) SEU failure rate allocation 4) SEU prediction 5) SEU Mitigation 6) SEU best practices The methodology discussed in this paper can be applied to any integrated system that is required to meet a particular high availability target.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5711342&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DEnabling+terabit+per+second+switch+linecard+design+through+chip%2Fpackage%2FPCB+co-design", "features": " \n\t\t\tball grid arrays; \n\t\t\tintegrated circuit interconnections; \n\t\t\tintegrated circuit modelling; \n\t\t\tintegrated circuit packaging; \n\t\t\tprinted circuit design; \n\t\t\ttelecommunication equipment; \n\t\t\tWeb 2.0 Internet; \n\t\t\tball grid array; \n\t\t\tbandwidth network equipment; \n\t\t\tchannel design; \n\t\t\tchip/package/PCB codesign; \n\t\t\tdesign complexity; \n\t\t\tfull wave 3D modeling; \n\t\t\thigher speed product; \n\t\t\tlow loss interconnect; \n\t\t\tmodel cascading; \n\t\t\tmodel optimization; \n\t\t\tmultiGHz signal integrity; \n\t\t\toptimal model segmentation; \n\t\t\tpin backdrill; \n\t\t\tprinted circuit board; \n\t\t\tterabit per second network switch linecard design; \n\t\t\tDielectric losses; \n\t\t\tInsertion loss; \n\t\t\tIntegrated circuit modeling; \n\t\t\tLoss measurement; \n\t\t\tMaterials; \n\t\t\tScattering parameters; \n\t\t\tSolid modeling;", "name": "Enabling terabit per second switch linecard design through chip/package/PCB co-design", "author": "Chen, Q.B.Jianmin ZhangQiu, K.Padilla, D.Zhiping YangScogna, A.C.Jun Fan", "series_t": "25-30 July 2010", "genre_s": "IEEE", "id": "978-1-4244-6305-3", "cat": "\n\t\t\tWidespread use of the Web 2.0 Internet applications such as video streaming and social networking are continuously demanding higher bandwidth network equipment. Electrical designers increasingly face more and more challenges to deliver higher speed products within short development cycle due to design complexity and new multi-GHz signal integrity problems. This paper presents a modeling and simulation methodology through chip/package/PCB (printed circuit board) co-design and co-optimization to enable a terabit per second network switch linecard design. Channel design techniques such as BGA (Ball Grid Array) pin backdrill, via tuning, and low loss interconnects are outlined. Full wave 3D modeling techniques with optimal model segmentation, model cascading and model optimization are discussed. At the end, correlation between lab measurement and simulation in both frequency and time domains are investigated.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5558055&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DReliability+and+Field+Aging+Time+Using+Temperature+Sensors", "features": " \n\t\t\treliability; \n\t\t\ttemperature sensors; \n\t\t\tIT infrastructure system management; \n\t\t\tdata center electronic systems; \n\t\t\tfailure rate; \n\t\t\tfield aging time; \n\t\t\tfield temperature effects; \n\t\t\ttemperature sensors reliability; \n\t\t\ttemperature-related parameters control; \n\t\t\tAcceleration; \n\t\t\tMonitoring; \n\t\t\tReliability; \n\t\t\tTemperature distribution; \n\t\t\tTemperature measurement; \n\t\t\tTemperature sensors; \n\t\t\tdata center; \n\t\t\tembedded sensors; \n\t\t\treliability; \n\t\t\ttemperature sensors;", "name": "Reliability and Field Aging Time Using Temperature Sensors", "author": "Civilini, M.", "series_t": "18-25 July 2010", "genre_s": "IEEE", "id": "978-1-4244-7538-4", "cat": "\n\t\t\tIn the last few years the IT infrastructure system management has evolved adding features and automating most of the IT operations. Temperature sensor management is now available throughout the entire infrastructure, allowing a direct control of temperature-related parameters at the single endpoint level. This paper presents a deviation from the standard, pre-release definition of reliability, and includes field temperature effects on the failure rate, thus moving from a statistical to a more endpoint-specific definition of reliability. An implementation example of a cumulative reliability factor for data center electronic systems is also presented.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5488430&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DNETradamus%3A+A+forecasting+system+for+system+event+messages", "features": " \n\t\t\tcomputer network management; \n\t\t\tdata mining; \n\t\t\tforecasting theory; \n\t\t\tNETradamus; \n\t\t\tevent forecasting system; \n\t\t\tproactive service assurance; \n\t\t\tproblem event patterns; \n\t\t\tsyslog messages; \n\t\t\tsystem event messages; \n\t\t\tCharacter recognition; \n\t\t\tComputer crashes; \n\t\t\tDegradation; \n\t\t\tFault diagnosis; \n\t\t\tMonitoring; \n\t\t\tNetwork servers; \n\t\t\tPattern recognition; \n\t\t\tPrediction methods; \n\t\t\tRobustness; \n\t\t\tWeather forecasting; \n\t\t\tForecasting; \n\t\t\tNetwork Fault Diagnosis; \n\t\t\tNetworks; \n\t\t\tPrediction Methods;", "name": "NETradamus: A forecasting system for system event messages", "author": "Clemm, A.Hartwig, M.", "series_t": "19-23 April 2010", "genre_s": "IEEE", "id": "978-1-4244-5366-5", "cat": "\n\t\t\tProactive service assurance depends on the ability to anticipate problems in a network. This paper presents a system to forecast high-severity system event messages before they occur. Forecasts are based on a stream of syslog messages from devices, which is compared and scored against a set of codes that are representative of known problem event patterns. The system includes a component to mine relevant event patterns from past problem occurrences. In addition to describing the techniques and algorithms that the system is based on, the paper also provides an assessment of the effectiveness of those techniques.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5746723&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DBuilt+In+Self+Test+.LB.BIST.RB.+Survey+-+an+industry+snapshot+of+HVM+component+BIST+usage+at+board+and+system+test", "features": " \n\t\t\tbuilt-in self test; \n\t\t\tintegrated circuit manufacture; \n\t\t\tintegrated circuit testing; \n\t\t\tHVM component BIST usage; \n\t\t\tIC BIST; \n\t\t\tIC built-in self test; \n\t\t\thigh volume manufacturing board test; \n\t\t\tintegrated circuit BIST; \n\t\t\tBuilt-in self-test; \n\t\t\tCompanies; \n\t\t\tIntegrated circuit modeling; \n\t\t\tManufacturing; \n\t\t\tStandards;", "name": "Built In Self Test (BIST) Survey - an industry snapshot of HVM component BIST usage at board and system test", "author": "Conroy, Z.Hui LiBalangue, J.", "series_t": "Nov. 30 2010-Dec. 2 2010", "genre_s": "IEEE", "id": "978-1-4244-8825-4", "cat": "\n\t\t\tWith board and component technology and integration rapidly increasing and becoming more complex, the testing of boards standalone and in a system is becoming more difficult, time consuming and costly. This paper addresses integrated circuit (IC) Built In Self Test (BIST) usage at the board and system test levels to provide increased test coverage, reduced test time and cost. This paper presents the results of an IC BIST usage survey developed by the International Electronics Manufacturing Initiative (iNEMI). The survey was intended to gauge the current adoption rate of IC BIST for board and system test, identify any impediments to widespread use, and select areas for future research.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4674373&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DOn+the+Survivability+of+Wireless+Ad+Hoc+Networks+with+Node+Misbehaviors+and+Failures", "features": " \n\t\t\tMarkov processes; \n\t\t\tad hoc networks; \n\t\t\tcomputer network performance evaluation; \n\t\t\tnetwork topology; \n\t\t\tprobability; \n\t\t\tdenial-of-service attack; \n\t\t\tk-connected network; \n\t\t\tnetwork survivability; \n\t\t\tnetwork topology; \n\t\t\tnode behavior; \n\t\t\tnode failure; \n\t\t\tnode isolation; \n\t\t\tnumerical analysis; \n\t\t\tperformance evaluation; \n\t\t\tsemi-Markov process; \n\t\t\twireless adhoc network; \n\t\t\twireless network; \n\t\t\tAnalytical models; \n\t\t\tComputer crime; \n\t\t\tDegradation; \n\t\t\tFailure analysis; \n\t\t\tMobile ad hoc networks; \n\t\t\tNumerical analysis; \n\t\t\tNumerical simulation; \n\t\t\tPerformance analysis; \n\t\t\tTelecommunication network topology; \n\t\t\tUpper bound; \n\t\t\tNetwork Architecture and Design; \n\t\t\tNetwork survivability; \n\t\t\tNetwork topology; \n\t\t\tProbability and Statistics; \n\t\t\tReliability; \n\t\t\tStochastic processes; \n\t\t\tSurvival analysis; \n\t\t\tand serviceability; \n\t\t\tavailability; \n\t\t\tk-connectivity; \n\t\t\tnode behavior modeling; \n\t\t\tnode isolation problem; \n\t\t\tnode misbehaviors; \n\t\t\tsemi-Markov process; \n\t\t\twireless ad hoc networks.;", "name": "On the Survivability of Wireless Ad Hoc Networks with Node Misbehaviors and Failures", "author": "Fei XingWenye Wang", "series_t": "July-Sept. 2010", "genre_s": "IEEE", "id": "1545-5971", "cat": "\n\t\t\tNetwork survivability is the ability of a network to stay connected under failures and attacks, which is a fundamental issue to the design and performance evaluation of wireless ad hoc networks. In this paper, we focus on the analysis of network survivability in the presence of node misbehaviors and failures. First, we propose a novel semi-Markov process model to characterize the evolution of node behaviors. As an immediate application of the proposed model, we investigate the problem of node isolation where the effects of denial-of-service (DoS) attacks are considered. Then, we present the derivation of network survivability and obtain the lower and upper bounds on the topological survivability for k-connected networks. We find that the network survivability degrades very quickly with the increasing likelihood of node misbehaviors, depending on the requirements of disjoint outgoing paths or network connectivity. Moreover, DoS attacks have a significant impact on the network survivability, especially in dense networks. Finally, we validate the proposed model and analytical result by simulations and numerical analysis, showing the effects of node misbehaviors on both topological survivability and network performance.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5693816&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DResource+Allocation+for+Multihomed+Scalable+Video+Streaming+to+Multiple+Clients", "features": " \n\t\t\tinteger programming; \n\t\t\tresource allocation; \n\t\t\tvideo streaming; \n\t\t\tdatagram congestion control protocol; \n\t\t\tdeterministic packet scheduling; \n\t\t\theterogeneous access networks; \n\t\t\tmultihomed scalable video streaming; \n\t\t\tmultiple clients; \n\t\t\trandomized packet scheduling; \n\t\t\trate control algorithms; \n\t\t\tresource allocation; \n\t\t\tservice differentiation; \n\t\t\tvideo distortion; \n\t\t\tquality optimization; \n\t\t\trate control; \n\t\t\tstream adaptation; \n\t\t\tvideo streaming;", "name": "Resource Allocation for Multihomed Scalable Video Streaming to Multiple Clients", "author": "Freris, N.M.Cheng-Hsin HsuXiaoqing ZhuSingh, J.P.", "series_t": "13-15 Dec. 2010", "genre_s": "IEEE", "id": "978-1-4244-8672-4", "cat": "\n\t\t\tWe consider multihomed scalable video streaming, where videos are transmitted by a single server to multiple clients over heterogeneous access networks. The specific problem that we address is to determine which video packets to transmit over each network, in order to minimize a cost function of the expected video distortion at the clients. We present a network model and a video model that capture the network conditions and video characteristics, respectively. We develop an integer program for deterministic packet scheduling. We propose different cost functions in order to provide service differentiation and address fairness among users. We propose several suboptimal convex problems for randomized packet scheduling, and study their performance and complexity. We propose an algorithm that yields a good performance and is suitable for real-time applications. We conduct extensive trace-driven simulations to evaluate the proposed algorithms using real network conditions and scalable video streams. The simulation results show that the proposed algorithm: (i) outperforms the rate control algorithms defined in the Datagram Congestion Control Protocol (DCCP) by about 10 dB, (ii) results in video quality, of 4.33 dB and 1.84 dB higher than the two heuristics developed in [1], (iii) runs efficiently, up to six times faster than one of the heuristics, and (iv) indeed can provide service differentiation among users.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5451126&contentType=Journals+%26+Magazines&queryText%3DA+General+Framework+for+Service+Availability+for+Bandwidth-Efficient+Connection-Oriented+Networks", "features": " \n\t\t\tbandwidth allocation; \n\t\t\ttelecommunication switching; \n\t\t\tbandwidth-efficient connection-oriented network; \n\t\t\trevenue model; \n\t\t\tservice availability; \n\t\t\tProtection switching; \n\t\t\tservice availability; \n\t\t\tservice level agreements; \n\t\t\tsurvivable networks;", "name": "A General Framework for Service Availability for Bandwidth-Efficient Connection-Oriented Networks", "author": "Gerstel, O.Sasaki, G.", "series_t": "June 2010", "genre_s": "IEEE", "id": "1063-6692", "cat": "\n\t\t\tAvailability in connection-oriented service in networks has traditionally been “all-or-nothing,” i.e., when a failure occurs, a connection either is unprotected or fully protected. The differences in availability and cost between these two extremes can be quite high. A general framework for service availability will be presented that fills the gap. It is shown how network resources and cost are related to service parameters of the framework for networks that are bandwidth-efficient. In addition, a simple revenue model is presented and characterized, revealing when nontraditional service agreements may be attractive.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5621500&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DIncreased+IP+layer+protection+bandwidth+due+to+router+bypass", "features": " \n\t\t\tIP networks; \n\t\t\ttelecommunication network routing; \n\t\t\tIP layer protection bandwidth; \n\t\t\trouter bypass; \n\t\t\tBandwidth; \n\t\t\tContainers; \n\t\t\tFabrics; \n\t\t\tFailure analysis; \n\t\t\tIP networks; \n\t\t\tOptical fiber networks; \n\t\t\tWavelength division multiplexing;", "name": "Increased IP layer protection bandwidth due to router bypass", "author": "Gerstel, O.Batchellor, R.", "series_t": "19-23 Sept. 2010", "genre_s": "IEEE", "id": "978-1-4244-8536-9", "cat": "\n\t\t\tCounter to previous works on router bypass, that assume protection bandwidth in routers is independent of the amount of bypass, we show that more bypass implies more IP protection bandwidth to cope with reduced likelihood of sharing.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5677228&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DA+Simplified+Image+Recognition+Algorithm+Based+on+Simple+Scenarios", "features": " \n\t\t\tfeature extraction; \n\t\t\timage matching; \n\t\t\timage recognition; \n\t\t\tobject recognition; \n\t\t\tdynamic object recognition; \n\t\t\tfeature based matching; \n\t\t\timage recognition algorithm; \n\t\t\tregion based matching; \n\t\t\ttarget position identification; \n\t\t\tvideo track; \n\t\t\tAccuracy; \n\t\t\tFeature extraction; \n\t\t\tHeuristic algorithms; \n\t\t\tImage color analysis; \n\t\t\tImage recognition; \n\t\t\tObject recognition; \n\t\t\tTransforms;", "name": "A Simplified Image Recognition Algorithm Based on Simple Scenarios", "author": "Hongtao Huang", "series_t": "10-12 Dec. 2010", "genre_s": "IEEE", "id": "978-1-4244-5391-7", "cat": "\n\t\t\tThis paper presents a simplified image recognition algorithm. This algorithm, with a combination of region-based matching and feature-based matching, uses only a small amount of computation to achieve rapid identification of a target positioning. Experiments indicate that the algorithm shows smooth and fast recognition and accurate positioning on a single video track of the dynamic object recognition.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5711337&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DDC+blocking+via+structure+optimization+and+measurement+correlation+for+SerDes+channels", "features": " \n\t\t\tapplication specific integrated circuits; \n\t\t\tdata communication; \n\t\t\telectromagnetic compatibility; \n\t\t\tlocal area networks; \n\t\t\toptical fibre communication; \n\t\t\toptimisation; \n\t\t\tprinted circuits; \n\t\t\tASIC; \n\t\t\tDC blocking; \n\t\t\tPCB; \n\t\t\tSerDes channels; \n\t\t\tapplication-specific integrated circuit; \n\t\t\tfiber-optic communication systems; \n\t\t\tgigabit Ethernet systems; \n\t\t\thigh-speed data transmission; \n\t\t\tmeasurement correlation; \n\t\t\tpackage pin numbers; \n\t\t\tprinted circuit board; \n\t\t\tserializer/deserializer channels; \n\t\t\tsignal transmission; \n\t\t\tstorage applications; \n\t\t\tstructure optimization; \n\t\t\tCapacitors; \n\t\t\tDielectric losses; \n\t\t\tInsertion loss; \n\t\t\tOptimization; \n\t\t\tPeriodic structures; \n\t\t\tScattering parameters;", "name": "DC blocking via structure optimization and measurement correlation for SerDes channels", "author": "Jianmin ZhangChen, Q.B.Jun FanDrewniak, J.L.Orland, A.Archambeault, B.", "series_t": "25-30 July 2010", "genre_s": "IEEE", "id": "978-1-4244-6305-3", "cat": "\n\t\t\tSerDes (Serializer/DeSerializer) is widely used in gigabit Ethernet systems, fiber-optic communication systems, and storage applications for high-speed data transmission between different ASICs (application-specific integrated circuit) with the significant advantage of saving package pin numbers. The channel connecting the Serializer/DeSerializer in two different ASICs on a PCB (Printed Circuit Board) is the SerDes channel defined in the paper. Since DC biases in different ASICs are usually different for their Serializer/DeSerializer circuits, DC blocking capacitors are then necessary to block the DC path for signal transmission through the SerDes channel. It is known that the trace impedance on a PCB can be well controlled in manufacturing while it is difficult for a DC blocking via structure. Therefore, the blocking via structure is the main discontinuity contributor of the SerDes channel. In this paper, two different DC blocking via structures are studied. The performances of the two structures are compared and correlated up to 20 GHz with full-wave modelling and measurements. This study reveals the advantages/disadvantages of the two via blocking structures. A via optimization tool, which is based on the cavity resonance algorithm to speed up the optimization, is used to obtain the optimized parameters for the two blocking via structures, and the following full-wave simulations give further performance explorations of the two via structures.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5683010&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DStub+length+prediction+for+back-drilled+vias+using+a+fast+via+tool", "features": " \n\t\t\tdrilling; \n\t\t\telectronics packaging; \n\t\t\tfinite element analysis; \n\t\t\tprinted circuits; \n\t\t\tsensitivity analysis; \n\t\t\tFEM; \n\t\t\tback-drilled vias; \n\t\t\tfast via tool; \n\t\t\tground vias; \n\t\t\tinsertion loss; \n\t\t\tphysics based via model; \n\t\t\tresonant frequency; \n\t\t\tsensitivity analysis; \n\t\t\tsingle-ended mode; \n\t\t\tstub length prediction; \n\t\t\tvia capacitance; \n\t\t\tCapacitance; \n\t\t\tElectromagnetic compatibility; \n\t\t\tFrequency measurement; \n\t\t\tInsertion loss; \n\t\t\tLength measurement; \n\t\t\tResonant frequency; \n\t\t\tTransmission line measurements;", "name": "Stub length prediction for back-drilled vias using a fast via tool", "author": "Jianmin ZhangChen, Q.B.Hanfeng WangJun FanOrlandi, A.Drewniak, J.L.", "series_t": "7-9 Dec. 2010", "genre_s": "IEEE", "id": "978-1-4244-9068-4", "cat": "\n\t\t\tThis paper presents a fast via tool to predict the via stub length after back-drilling. The fast via tool is developed associated with the physics based via model and is combined with the calculation of plane impedance and via capacitance block by block. The entire via model is built by connecting those via blocks one after another accordingly. The plane impedance is calculated from an analytical formula and the via capacitance is computed from the point of view of energy by solving the potential distribution on each via block using FEM. Via stub length is predicted with the observation of strong resonant trough on the insertion loss, which can be in single-ended mode or mixed mode. Two cases, one signal via surrounded by eight ground vias and four signal vias surrounded by four ground vias, are used to verify the modelling accuracy of the fast via tool by correlating to the measurements. The third case is about via stub length extraction as well as the sensitivity investigation between the stub length and the resonant frequency.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5352214&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DCausal+RLGC.LB.+f+.RB.+Models+for+Transmission+Lines+From+Measured+S+-Parameters", "features": " \n\t\t\tHilbert transforms; \n\t\t\tS-parameters; \n\t\t\tcoupled transmission lines; \n\t\t\tpermittivity; \n\t\t\tskin effect; \n\t\t\tstrip lines; \n\t\t\tHilbert transform; \n\t\t\tRLGC(f) Models; \n\t\t\tS-parameters measurement; \n\t\t\tcoupled transmission lines; \n\t\t\tdielectric dispersion; \n\t\t\tedge-coupled differential stripline pair; \n\t\t\tfrequency-dependent causal models; \n\t\t\tsingle-ended microstrip line; \n\t\t\tskin-effect loss; \n\t\t\ttransmission line conductors; \n\t\t\tAnalytical models; \n\t\t\tConductivity; \n\t\t\tConductors; \n\t\t\tCouplings; \n\t\t\tDielectric losses; \n\t\t\tDielectric substrates; \n\t\t\tFrequency dependence; \n\t\t\tFrequency domain analysis; \n\t\t\tStripline; \n\t\t\tTransmission lines; \n\t\t\tCausality; \n\t\t\tHilbert transforms; \n\t\t\tdielectric materials; \n\t\t\tscattering parameters; \n\t\t\ttransmission line modeling;", "name": "Causal <emphasis emphasistype=\"italic\">RLGC</emphasis>(<formula formulatype=\"inline\"> <img src=\"/images/tex/600.gif\" alt=\"f\"> </formula>) Models for Transmission Lines From Measured <formula formulatype=\"inline\"> <img src=\"/images/tex/397.gif\" alt=\"S\"> </formula> -Parameters", "author": "Jianmin ZhangDrewniak, J.L.Pommerenke, D.J.Koledintseva, M.Y.DuBroff, R.E.Cheng, W.Zhiping YangChen, Q.B.Orlandi, A.", "series_t": "Feb. 2010", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tFrequency-dependent causal RLGC(f) models are proposed for single-ended and coupled transmission lines. Dielectric loss, dielectric dispersion, and skin-effect loss are taken into account. The dielectric substrate is described by the two-term Debye frequency dependence, and the transmission line conductors are of finite conductivity. In this paper, three frequency-dependent RLGC models are studied. One is the known frequency-dependent analytical RLGC model (RLGC-I), the second is the RLGC( f) model (RLGC-II) proposed in this paper, and the third (RLGC-III) is same as the RLGC -II, but with causality enforced by the Hilbert transform in frequency domain. The causalities of the three RLGC models are corroborated in the time domain by examining the propagation of a well-defined pulse through three different transmission lines: a single-ended stripline, a single-ended microstrip line, and an edge-coupled differential stripline pair. A clear time-domain start point is shown on each received pulse for the RLGC-II model and the RLGC-III model, where their corresponding start points overlap. This indicates that the proposed RLGC(f) model (RLGC-II) is causal. Good agreement of simulated and measured S-parameters has also been achieved in the frequency domain for the three transmission lines by using the proposed frequency-dependent RLGC(f) model.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5711320&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DDesign+and+modeling+for+chip-to-chip+communication+at+20+Gbps", "features": " \n\t\t\tS-parameters; \n\t\t\tequalisers; \n\t\t\tprinted circuit design; \n\t\t\t12-layer organic; \n\t\t\t21-layer ceramic; \n\t\t\t22-layer PCB; \n\t\t\tFR4 substrate material; \n\t\t\tbit rate 20 Gbit/s; \n\t\t\tchannel S-parameter; \n\t\t\tequalization; \n\t\t\thigh-speed channel design; \n\t\t\tlow loss channel; \n\t\t\tmicroprobe; \n\t\t\tprinted circuit board; \n\t\t\tprobing station; \n\t\t\tserial chip-to-chip communication; \n\t\t\tComputational modeling; \n\t\t\tCrosstalk; \n\t\t\tDielectric losses; \n\t\t\tInsertion loss; \n\t\t\tIntegrated circuit modeling; \n\t\t\tScattering parameters; \n\t\t\tTime domain analysis;", "name": "Design and modeling for chip-to-chip communication at 20 Gbps", "author": "Jianmin ZhangChen, Q.B.Qiu, K.Scogna, A.C.Schauer, M.Romo, G.Drewniak, J.L.Orlandi, A.", "series_t": "25-30 July 2010", "genre_s": "IEEE", "id": "978-1-4244-6305-3", "cat": "\n\t\t\tThis paper presents the design of serial chip-to-chip communication at 20 Gbps including modeling and correlation for PCBs (Printed Circuit Boards) with FR4 substrate materials. The entire channel under investigation includes two packages, a 21-layer ceramic and a 12-layer organic, and a 22-layer PCB. A probing station, microprobes and a VNA are used to measure the entire channel S-parameters and the measurement is correlated to the simulation up to 20 GHz. Extended study for the channel with low loss PCB substrate material is simulated. Time-domain eye comparisons for the FR4 channel, low loss channel, and the FR4 channel with equalization are given. A general design rule as well as new technologies for the high-speed channel design at 20 Gbps and beyond are discussed and given in the conclusion.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5484717&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DDesign+and+Analysis+of+a+Cooperative+Multichannel+MAC+Protocol+for+Heterogeneous+Networks", "features": " \n\t\t\taccess protocols; \n\t\t\telectronic data interchange; \n\t\t\ttelecommunication networks; \n\t\t\twireless channels; \n\t\t\tWiFlex; \n\t\t\tasynchronous split phase protocol; \n\t\t\tcooperative multichannel MAC protocol; \n\t\t\tdata exchange; \n\t\t\theterogeneous networks; \n\t\t\tmedia centers; \n\t\t\tmedium access control protocol; \n\t\t\tmultichannel hidden-node problem; \n\t\t\tmultichannel physical layer; \n\t\t\tmultiple collision domain environments; \n\t\t\tspectrum-sharing coordination; \n\t\t\tunlicensed bands; \n\t\t\twireless protocols; \n\t\t\twireless sensors; \n\t\t\tApplication specific processors; \n\t\t\tBidirectional control; \n\t\t\tBit rate; \n\t\t\tMedia Access Protocol; \n\t\t\tPerformance analysis; \n\t\t\tPermission; \n\t\t\tPhysical layer; \n\t\t\tThroughput; \n\t\t\tWireless application protocol; \n\t\t\tWireless sensor networks; \n\t\t\tAsynchronous split phase (ASP); \n\t\t\theterogeneous devices; \n\t\t\thidden-node problem; \n\t\t\tmultichannel hidden-node problem; \n\t\t\tmultichannel medium-access control (MAC);", "name": "Design and Analysis of a Cooperative Multichannel MAC Protocol for Heterogeneous Networks", "author": "Jiwoong LeeJeonghoon MoTran Minh TrungWalrand, J.Hoi-Sheung So", "series_t": "Sept. 2010", "genre_s": "IEEE", "id": "0018-9545", "cat": "\n\t\t\tMany incompatible wireless protocols proliferate in unlicensed bands, creating complex coexistence and connectivity problems. If the trend continues, such problems will continue to exist in future unlicensed bands. We take a different approach to spectrum sharing. Instead of proposing a distinct medium-access control (MAC) protocol for each type of application, we propose a family of parameterized MAC protocols called WiFlex, which can be tailored to different application needs, ranging from wireless sensors to media centers. However, these protocols allow communication and spectrum-sharing coordination among different types of devices. We envision this family to be based on a multichannel physical layer. The contributions of this paper include a novel asynchronous split phase (ASP) protocol with dynamic priority support, even in multiple-collision-domain environments. When links are bidirectional, WiFlex resolves the multichannel hidden-node problem, achieving collision-free data exchange in a multihop environment. ASP provides a mechanism for prioritization and fairness. The performance of the protocol is evaluated through analysis and simulation. The coexistence of heterogeneous devices and the support for different applications with high performance are demonstrated.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5724818&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAppFlow%3A+Autonomic+Performance-Per-Watt+Management+of+Large-Scale+Data+Centers", "features": " \n\t\t\tcomputer centres; \n\t\t\tenergy conservation; \n\t\t\tmicroprocessor chips; \n\t\t\tmultiprocessing systems; \n\t\t\tpower aware computing; \n\t\t\tvirtual machines; \n\t\t\tAppFlow; \n\t\t\tautonomic performance per watt management; \n\t\t\tautonomic power management scheme; \n\t\t\tlarge scale data centers; \n\t\t\tmulticore processors; \n\t\t\tservice level agreement; \n\t\t\ttotal cost of ownership; \n\t\t\tvirtual machine resources; \n\t\t\tDelay; \n\t\t\tMathematical model; \n\t\t\tMemory management; \n\t\t\tMonitoring; \n\t\t\tOptimization; \n\t\t\tProgram processors; \n\t\t\tAutonomic Computing; \n\t\t\tData Center; \n\t\t\tPower Management;", "name": "AppFlow: Autonomic Performance-Per-Watt Management of Large-Scale Data Centers", "author": "Khargharia, B.Haoting LuoAl-Nashif, Y.Hariri, S.", "series_t": "18-20 Dec. 2010", "genre_s": "IEEE", "id": "978-1-4244-9779-9", "cat": "\n\t\t\tThe characteristic of dramatic fluctuation in the resource provisioning for real-time applications calls for an elastic delivery of computing services. Current data center deployment schemes, which feature a strong tie between servers and applications, are increasingly challenged to ensure power efficiency in terms of multiple peak loads provisioning, optimal average resources utilization, variable runtime workloads profiling, data center manageability and overhead control on the data center Total Cost of Ownership (TCO). Researchers have exploited paradigms such as virtualization and migration for large-scale computing systems, however, there is still a long way before we can optimally address the power-performance trade-off. This paper provides an autonomic power management scheme for the resource provisioning process for large-scale data centers while meeting the Service-Level Agreement (SLA) and power requirements. The system status is continuously monitored using a cross-layered hierarchy to optimally scale up and down the virtual machine resources such that power and performance can be optimized. We have applied our technique to autonomically manage high performance platforms with multi-core processors and multi rank memory subsystems. Our experimental results show around 56.25 percent platform energy savings for memory-intensive workload, 63.75 percent platform energy savings for processor-intensive workload and 47.5 percent platform energy savings for mixed workload while maintaining.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5490790&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DEffects+of+isothermal+aging+and+in-situ+current+stress+on+the+reliability+of+lead-free+solder+joints", "features": " \n\t\t\tAging; \n\t\t\tCurrent density; \n\t\t\tElectronic packaging thermal management; \n\t\t\tEnvironmentally friendly manufacturing techniques; \n\t\t\tIsothermal processes; \n\t\t\tLead; \n\t\t\tSoldering; \n\t\t\tTesting; \n\t\t\tThermal degradation; \n\t\t\tThermal stresses;", "name": "Effects of isothermal aging and in-situ current stress on the reliability of lead-free solder joints", "author": "Bansal, A.Tae-Kyu LeeKuo-Chuan LiuJie Xue", "series_t": "1-4 June 2010", "genre_s": "IEEE", "id": "978-1-4244-6410-4", "cat": "\n\t\t\tThe microstructure and mechanical behavior of Sn-Ag-Cu (SAC) soldering alloys can change significantly over time when exposed to isothermal aging and in-situ current stress. Electronics assemblies built with SAC solder joints are exposed to elevated ambient temperatures and relatively high current densities for prolonged periods of time. Therefore it is important to understand the impact of these stresses on the long term reliability. In this study, board level thermal cycle reliability tests have been performed on daisy chain lead-free 0.5 mm pitch CTBGA, 1.0 mm pitch PBGA, and 0.5 mm pitch MLF packages. The tests were performed with and without isothermal pre-aging. During the thermal cycling tests, the daisy chained solder joints were subjected to different levels of constant current density. The thermal cycle profiles were tailored in order to evaluate the effect of current density on solder joint fatigue, while minimizing the secondary effects of joule heating. The results show that the effects of both thermal aging and current stress are consistent for a given package type, but the trends can be different for different package designs. In 0.5 mm pitch CTBGA, isothermal aging significantly reduced the solder joint life, while current stress caused the solder joint life to slightly increase at moderate current densities, and eventually degrade at higher current densities. In PBGAs, the effect of thermal aging was insignificant but current stress caused a slight degradation in life. In MLF packages isothermal aging caused a serious degradation in solder fatigue life, while the effect of current stress was not significant.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5594119&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DEnhanced+Lee+Model+from+Rough+Terrain+Sampling+Data+Aspect", "features": " \n\t\t\tantennas; \n\t\t\tLee propagation prediction model; \n\t\t\tantenna gain; \n\t\t\tdiffraction loss; \n\t\t\tfield terrain; \n\t\t\tline of site; \n\t\t\tman-made structures; \n\t\t\tmultiple knife edge scenario; \n\t\t\tnatural terrain variation; \n\t\t\trough terrain sampling data aspect; \n\t\t\tshadow loss calculation; \n\t\t\tsingle knife edge scenario; \n\t\t\tvalidation process; \n\t\t\twireless industry; \n\t\t\tAntenna measurements; \n\t\t\tAntennas; \n\t\t\tData models; \n\t\t\tGain; \n\t\t\tMobile communication; \n\t\t\tPrediction algorithms; \n\t\t\tReflection;", "name": "Enhanced Lee Model from Rough Terrain Sampling Data Aspect", "author": "Lee, D.J.Y.Lee, W.C.Y.", "series_t": "6-9 Sept. 2010", "genre_s": "IEEE", "id": "978-1-4244-3573-9", "cat": "\n\t\t\tThe Lee propagation prediction model has been well recognized by the wireless industry as one of the most accurate propagation prediction models. This paper discusses innovative approaches dealing with rough digital samples of terrain data and enhancements to the Lee model during the validation process. In general, the Lee model is composed of two parts, the impact of man-made structures and the impact of the natural terrain variation. There are other papers discuss innovative algorithms on calculating effective antenna gain and diffraction loss as well as on enhancing the Lee model. This paper focuses on the natural (terrain) factor. The new algorithm presented in this paper is quite different than others as it integrates both Line Of Site (LOS) and shadow loss calculation together for the Lee model. First, in the LOS scenario, it addresses the issue of big swing of effective antenna gain due to non-continuous terrain data. Second, in the non-LOS situation, the effective antenna gain is integrated with shadow loss. Both single knife edge and multiple knife edge scenarios are discussed. The new algorithm is developed based on the analysis of measured and predicted (the theoretical shadow loss and effective antenna gain) data. The new algorithm involves more calculation but it improves the accuracy of the predicted value. This algorithm was implemented and verified using field terrain and measurement data from a variety of different environments and different countries including Italy, US, Spain, Japan, South Korea, Taiwan and Romania.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5490774&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DThe+interaction+between+grain+orientation+evolution+and+thermal+cycling+as+a+function+of+position+in+ball+grid+arrays+using+orientation+image+microscopy", "features": " \n\t\t\tAging; \n\t\t\tElectronics packaging; \n\t\t\tFatigue; \n\t\t\tHistory; \n\t\t\tMicrostructure; \n\t\t\tOptical imaging; \n\t\t\tOptical microscopy; \n\t\t\tOptical polarization; \n\t\t\tSoldering; \n\t\t\tTin;", "name": "The interaction between grain orientation evolution and thermal cycling as a function of position in ball grid arrays using orientation image microscopy", "author": "Tae-Kyu LeeZhou, B.Blair, L.Kuo-Chuan LiuJie XueBieler, T.R.", "series_t": "1-4 June 2010", "genre_s": "IEEE", "id": "978-1-4244-6410-4", "cat": "\n\t\t\tThermally cycled PBGA packages with a full array of 196 solder joints after various pre-conditions are examined to observe the microstructure evolution of Sn-Ag-Cu solder joints during aging and thermal cycling, focusing on Sn grain orientation. Each PBGA package was polished to obtain plan view cross sections of every solder joint, and characterized using both Polarized Optical microscopy and Orientation Imaging Microscopy (OIM). Based on observations using OIM images, we obtained a distribution map based on the Sn crystal c-axis orientation. Each precondition show its own signature distribution related to the thermal aging and thermal cycling history. Further analysis, combining the dye and pry and plan view observation, revealed the correlation between the c-axis orientations and the fatigue cracks caused by thermal cycling. A strong relationship between evolving crystal orienations where the c-axis becomes aligned with the plane of the package and cracking is identified. A combined study and observation of Polarized light images and OIM provides further understanding about deformation and microstructure evolution processes that occur during thermal cycling. A continuous recrystallization mechanism may account for the changes in grain orientation that lead to susceptibility to cracking.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5488791&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DReliability+of+microelectronics+packaging+in+the+era+of+EnergyWise+and+Borderless+networks", "features": " \n\t\t\tintegrated circuit packaging; \n\t\t\tintegrated circuit reliability; \n\t\t\tBorderless networks; \n\t\t\tEnergyWise networks; \n\t\t\tmanufacturing process; \n\t\t\tmicroelectronic device; \n\t\t\tmicroelectronics packaging reliability; \n\t\t\tnetwork attached device; \n\t\t\treduced energy consumption; \n\t\t\tsecure communication; \n\t\t\tComputer networks; \n\t\t\tCosts; \n\t\t\tEnergy consumption; \n\t\t\tMaterials reliability; \n\t\t\tMicroelectronics; \n\t\t\tNext generation networking; \n\t\t\tPackaging machines; \n\t\t\tPower system reliability; \n\t\t\tTechnological innovation; \n\t\t\tTelecommunication network reliability; \n\t\t\tEnergyWise; \n\t\t\tlow power design; \n\t\t\tmicroelectronics packaging; \n\t\t\treliability; \n\t\t\ttemperature and humidity effect;", "name": "Reliability of microelectronics packaging in the era of EnergyWise and Borderless networks", "author": "Li LiJie Xue", "series_t": "2-6 May 2010", "genre_s": "IEEE", "id": "978-1-4244-5430-3", "cat": "\n\t\t\tIn an ever-increasingly connected world, the boundaries or obstacles to accessing information are being torn down by business necessity, personal preferences and technical innovations. The Borderless Network is creating the ability for customers to work anywhere, with any device using services and applications like video, collaboration, with a secure, reliable and seamless communication experience. The customer will also experience reduced energy consumption from network attached devices thanks to innovations made in the microelectronic devices, systems that enable the next generation of smart and EnergyWise networks. In this paper, challenges and opportunities in reliability of microelectronics packaging for the next generation of EnergyWise, Borderless networks will be reviewed. The impact of materials, manufacturing processes and field environmental conditions on the packaging reliability will be discussed with one case study.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5490719&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAcceleration+factor+study+of+lead-free+solder+joints+under+wide+range+thermal+cycling+conditions", "features": " \n\t\t\tAcceleration; \n\t\t\tEnvironmentally friendly manufacturing techniques; \n\t\t\tFailure analysis; \n\t\t\tLead; \n\t\t\tLife testing; \n\t\t\tPackaging; \n\t\t\tPerformance evaluation; \n\t\t\tSoldering; \n\t\t\tThermal factors; \n\t\t\tVehicles;", "name": "Acceleration factor study of lead-free solder joints under wide range thermal cycling conditions", "author": "Hongtao MaAhmad, M.Kuo-Chuan Liu", "series_t": "1-4 June 2010", "genre_s": "IEEE", "id": "978-1-4244-6410-4", "cat": "\n\t\t\tIn this study, a comprehensive set of tests were performed on test vehicles with different package types, sizes, pitches, and solder joints metallurgies. Accelerated Thermal Cycling (ATC) testing was performed using four different thermal cycling profiles: 0–100 °C, −40–125 °C, −55–125 °C, and −60–150 °C. Data from the tests were analyzed for failure mode and failure rate using Weibull statistics, and the characterized life for each test condition was determined and analyzed. The impact of solder alloy metallurgies, package types, sizes, and pitches on acceleration factors was also analyzed. The data will help quantify discrepancies due to test condition variations, and will also provide valuable guidance on effects of package types, size, pitches, and solder joints metallurgies. In addition, failure analysis was performed at different stages of the tests for each thermal cycling condition. The failure modes and failure mechanism were compared and discussed across all the thermal cycling profiles.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5490797&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DEffects+of+PCB+design+variations+on+bend+and+ATC+performance+of+lead-free+solder+joints", "features": " \n\t\t\tAging; \n\t\t\tCopper alloys; \n\t\t\tDegradation; \n\t\t\tEnvironmentally friendly manufacturing techniques; \n\t\t\tLead; \n\t\t\tPerformance evaluation; \n\t\t\tSoldering; \n\t\t\tTesting; \n\t\t\tThermal stresses; \n\t\t\tWeb design;", "name": "Effects of PCB design variations on bend and ATC performance of lead-free solder joints", "author": "Hongtao MaKuo-Chuan LiuTae-Kyu LeeDong Hyun Kim", "series_t": "1-4 June 2010", "genre_s": "IEEE", "id": "978-1-4244-6410-4", "cat": "\n\t\t\tSn-Ag-Cu (SAC) solder alloys, such as Sn-3.0Ag-0.5 Cu (SAC305) are the popular choices of lead-free solders replacing SnPb solders. However, SAC solders are more brittle in nature due to high stiffness and excessive intermetallic compounds growth at the solder joint to pad interface. This leads to higher risks in solder joints failures. Memory module type lead-free BGA packages are constantly under dynamic stresses during handling and thermal stresses during operations. It is important to understand the dynamic performance and long term reliability of memory module lead-free BGAs. It is believed that the PCB design variations cause dynamic and long term failure discrepancies in the fields. In this study, different pad and trace designs were introduced to evaluate the effects of PCB design variations on the bend and Accelerate Thermal Cycling (ATC) performance of lead-free solder joints. Pad designs with NSMD (Non-solder mask defined), SMD (Solder mask defined), and a unique web design were assembled and tested. Different solder alloys including SAC305, SAC105, and SnPb solders, have been evaluated in this study. Different PCB materials have also been evaluated in the test. Four point monotonic bend tests were performed to characterize the bending performance variations with different PCB designs and compared with conventional Sn-Pb solder. SMD pad is shown to have the best bend performance among all other types of designs in this study. In addition, this design also shows improvement in mitigation of PCB pad cratering with lead-free solders. Wide trace width seems to degrade the strength and is not preferred. Same as its superior shock resistance comparing with SAC305, SAC105 solder alloy shows better bend performance. There is no significant improvement of bend performance with Web Design. After aging treatment, bend performance of both SAC305 and SAC105 degraded by up to 34% and 29% respectively. However, the bend performance of eutectic SnPb was actually improved- - after aging. ATC tests were performed to investigate the effects of design variations on the long term reliability of lead-free solder joints; SMD design shows less reliability life than others. The implications of these results for the reliability of lead-free solder joints are discussed in this paper.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5499987&contentType=Conference+Publications&queryText%3DEnergy+footprint+and+opportunities+of+ICT+networks", "features": " \n\t\t\tinformation technology; \n\t\t\toptical fibre subscriber loops; \n\t\t\tCAGR; \n\t\t\tICT networks; \n\t\t\taccess network; \n\t\t\tenergy consumption; \n\t\t\tenergy footprint; \n\t\t\tCMOS technology; \n\t\t\tEnergy consumption; \n\t\t\tEnergy efficiency; \n\t\t\tOptical fiber networks; \n\t\t\tOptical interconnections; \n\t\t\tOptical receivers; \n\t\t\tOptical transmitters; \n\t\t\tPhotonic integrated circuits; \n\t\t\tTelecommunication traffic; \n\t\t\tWavelength division multiplexing;", "name": "Energy footprint and opportunities of ICT networks", "author": "Paraschis, L.", "series_t": "16-21 May 2010", "genre_s": "IEEE", "id": "978-1-55752-890-2", "cat": "\n\t\t\tThe access network currently dominates energy consumption, which has otherwise been contained benefiting by IC and optical advancements, despite the multi-year > 50% CAGR of traffic. Further network technology, architectural, and application opportunities exist.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5553697&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DData+center+transport+in+the+zettabyte+IP+network", "features": " \n\t\t\tIP networks; \n\t\t\tcomputer centres; \n\t\t\tmultiprotocol label switching; \n\t\t\toptical fibre networks; \n\t\t\ttelecommunication services; \n\t\t\twavelength division multiplexing; \n\t\t\tDWDM transport; \n\t\t\tIP/MPLS networks; \n\t\t\tZettabyte IP network; \n\t\t\tdata center transport; \n\t\t\tservice delivery; \n\t\t\tGoogle; \n\t\t\tIP networks; \n\t\t\tMultiprotocol label switching; \n\t\t\tPhotonics;", "name": "Data center transport in the zettabyte IP network", "author": "Paraschis, L.Modali, S.", "series_t": "19-21 July 2010", "genre_s": "IEEE", "id": "978-1-4244-3730-6", "cat": "\n\t\t\tAdvancements in virtualization, consolidated switching fabric, packet transport, and 10/40/100 GE photonics, have enabled data-centers to evolve to a new converged architecture. This new architecture improves significantly the data center resource utilization, and scalability. It has also enabled direct interconnection to the IP/MPLS networks, and leveraging of the significant advancements in packet and DWDM transport. Data centers play an increasingly important role in this emerging Zettabyte network, becoming the foundation for the future private and public \"cloud\" service delivery. In this paper, the author gives an overview of the data center optical fiber Zettabyte IP network.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5345839&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DGigahertz-Range+Analysis+of+Impedance+Profile+and+Cavity+Resonances+in+Multilayered+PCBs", "features": " \n\t\t\tcapacitors; \n\t\t\tcavity resonators; \n\t\t\tcircuit resonance; \n\t\t\tdigital integrated circuits; \n\t\t\telectric impedance; \n\t\t\telectromagnetic compatibility; \n\t\t\thigh-speed integrated circuits; \n\t\t\tinductance; \n\t\t\tintegrated circuit design; \n\t\t\tintegrated circuit packaging; \n\t\t\tmicrowave integrated circuits; \n\t\t\tprinted circuits; \n\t\t\tIC packages; \n\t\t\tPCB power bus; \n\t\t\tcavity mode resonance; \n\t\t\tcavity model method; \n\t\t\tdecoupling capacitors; \n\t\t\telectromagnetic compatibility; \n\t\t\tfull-wave field solver; \n\t\t\tgigahertz-range analysis; \n\t\t\tglobal decoupling; \n\t\t\thigh-speed digital integrated circuits; \n\t\t\timpedance envelope; \n\t\t\timpedance profile; \n\t\t\tlocal decoupling; \n\t\t\tmultilayer printed circuit boards; \n\t\t\tmultilayered PCB; \n\t\t\tnetwork analyzer; \n\t\t\tparallel-plane cavity resonators; \n\t\t\tparasitic inductance; \n\t\t\tplane spacing; \n\t\t\tpower vias; \n\t\t\tswitching noise; \n\t\t\tCapacitors; \n\t\t\tDigital integrated circuits; \n\t\t\tHigh speed integrated circuits; \n\t\t\tImpedance; \n\t\t\tIntegrated circuit noise; \n\t\t\tIntegrated circuit packaging; \n\t\t\tNonhomogeneous media; \n\t\t\tPrinted circuits; \n\t\t\tResonance; \n\t\t\tSwitching circuits; \n\t\t\tContact inductance of decoupling components to a power bus; \n\t\t\tcontrol of parallel-plane impedance by a plane spacing and decoupling techniques; \n\t\t\tmultilayered printed circuit boards as stacked parallel-plane resonators;", "name": "Gigahertz-Range Analysis of Impedance Profile and Cavity Resonances in Multilayered PCBs", "author": "Pajovic, M.M.Jinghan YuPotocnik, Z.Bhobe, A.", "series_t": "Feb. 2010", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tAs is known, undesired simultaneous switching noise produced by high-speed digital integrated circuits (ICs) and power vias may propagate along parallel-plane structures of multilayer printed circuit boards (PCBs) and IC packages, which act as parallel-plane cavity resonators. To minimize effects of the parallel-plane cavities, we need to minimize the impedance profile of a PCB power bus in the frequency range of interest. We can minimize the impedance profile by reducing power bus plane spacings, and by using local and global decoupling techniques that employ decoupling capacitors. But, in the gigahertz-range, discrete capacitors are not efficient due to the parasitic inductance of their connections to the power bus. In this paper, in addition to the analysis of cavity-mode resonances in multilayered PCBs, we derived expressions for the impedance envelope that can be used for predicting the impedance profile of a power bus. This theoretical approach and the derived envelope expressions are confirmed analytically by the cavity-model method, by a full-wave field solver, and by laboratory measurements carried out by a network analyzer.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5582470&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DScaling+system+performance+through+packaging+and+interconnect%3A+A+study+in+networking+applications", "features": " \n\t\t\telemental semiconductors; \n\t\t\tintegrated circuit interconnections; \n\t\t\toptimisation; \n\t\t\tsemiconductor device packaging; \n\t\t\tsilicon; \n\t\t\tSi; \n\t\t\tcost optimization; \n\t\t\tinterconnection; \n\t\t\tnetworking applications; \n\t\t\tnetworking chips; \n\t\t\tpackaging; \n\t\t\tpackaging design; \n\t\t\tscaling system performance; \n\t\t\tsilicon integration; \n\t\t\tCapacitors; \n\t\t\tClocks; \n\t\t\tJitter; \n\t\t\tPackaging; \n\t\t\tPerformance evaluation; \n\t\t\tSilicon; \n\t\t\tSubstrates;", "name": "Scaling system performance through packaging and interconnect: A study in networking applications", "author": "Priest, J.", "series_t": "16-19 Aug. 2010", "genre_s": "IEEE", "id": "978-1-4244-8140-8", "cat": "\n\t\t\tHigh end networking and computing applications continue to drive silicon technologies to higher data rates, increased storage capacity, and increased bandwidth. Interfaces are transitioning more toward serial technologies, even for short distance data transfer. Voltage supply rails continue to drop and consequently, the noise margins become reduced, even with increasing numbers of simultaneously switched signals. The ratio of leakage current to active current is also increasing for high performance silicon processes, as is the demand for more instantaneous switching current. Power integrity and power distribution design becomes a more prevalent issue in electrical design as it dictates the efficiency of current draw available to switch on-chip circuits. Silicon integration and device scaling still leads to overall higher performance, but there are practical limits to the yield and assembly reliability of very large die. Packaging begins to play a more critical role in the improvement of performance through scaling of interconnect. This paper will examine the design tradeoffs for high end networking chips for performance and cost optimization. Two examples are shown where packaging design is directly linked to enabling system level performance impact.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5562805&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DStakeholder+Identification+in+Agile+Software+Product+Development+Organizations%3A+A+Model+for+Understanding+Who+and+What+Really+Counts", "features": " \n\t\t\tproduct development; \n\t\t\tsoftware development management; \n\t\t\tsoftware houses; \n\t\t\tsoftware prototyping; \n\t\t\tagile software product development organization; \n\t\t\tglobal product development company; \n\t\t\tmultiyear transition; \n\t\t\tstakeholder identification; \n\t\t\tstakeholder theory; \n\t\t\tstakeholders mapping; \n\t\t\tstrategic management; \n\t\t\tContext; \n\t\t\tOrganizations; \n\t\t\tPlanning; \n\t\t\tPortfolios; \n\t\t\tProduct development; \n\t\t\tProgramming; \n\t\t\tSoftware; \n\t\t\tagile; \n\t\t\tlean; \n\t\t\tproduct development; \n\t\t\tsalience; \n\t\t\tstakeholder; \n\t\t\tstakeholder group;", "name": "Stakeholder Identification in Agile Software Product Development Organizations: A Model for Understanding Who and What Really Counts", "author": "Power, K.", "series_t": "9-13 Aug. 2010", "genre_s": "IEEE", "id": "978-1-4244-7731-9", "cat": "\n\t\t\tStakeholder Theory is an area of strategic management that defines a stakeholder as someone who affects or is affected by the actions of the organization. The principles and concepts of stakeholder theory can be applied to software development organizations to give managers a better understanding of the diverse community of stakeholders that influence product development efforts. A deeper understanding of the broad community of stakeholders can help an organization that is transitioning to agile methods by highlighting the stakeholders that are affected. This paper describes the application of stakeholder theory to product development organizations in the context of a global product development company undergoing a multi-year transition to agile development. A model is presented for mapping stakeholders into stakeholder groups, and for quantifying the influence of stakeholders. This paper further uses a stakeholder approach to demonstrate how traditional organization roles map to roles in an agile product development organization.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5711339&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DStressed+jitter+analysis+for+physical+link+characterization", "features": " \n\t\t\tS-parameters; \n\t\t\tdesign engineering; \n\t\t\tfrequency-domain analysis; \n\t\t\tinterference (signal); \n\t\t\tjitter; \n\t\t\tdevice qualification; \n\t\t\tdevice selection; \n\t\t\tengineering design; \n\t\t\tfrequency-domain S-parameter; \n\t\t\tlink path optimization; \n\t\t\tlink-path analysis; \n\t\t\tphysical link characterization; \n\t\t\tstressed jitter analysis; \n\t\t\tstressed link path analysis; \n\t\t\tBit error rate; \n\t\t\tHistograms; \n\t\t\tJitter; \n\t\t\tMathematical model; \n\t\t\tNoise; \n\t\t\tReceivers; \n\t\t\tSignal analysis;", "name": "Stressed jitter analysis for physical link characterization", "author": "Radhakrishnan, N.Achkir, B.Jun FanDrewniak, J.L.", "series_t": "25-30 July 2010", "genre_s": "IEEE", "id": "978-1-4244-6305-3", "cat": "\n\t\t\tA link-path analysis approach is introduced in this paper based on the frequency-domain S-parameters of the link path. Different jitter components are also modelled and can be injected into the analysis to characterize the link responses to different types of jitter input. Stressed link path analysis can be very useful in practical engineering designs in terms of link path optimization, device selection and qualification, etc.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5490845&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAssembly+and+reliability+of+advanced+packaging+technologies+in+high+speed+networking+applications", "features": " \n\t\t\tApplication specific integrated circuits; \n\t\t\tAssembly; \n\t\t\tCapacitors; \n\t\t\tComputer applications; \n\t\t\tElectric variables measurement; \n\t\t\tHigh-speed networks; \n\t\t\tIntegrated circuit packaging; \n\t\t\tNoise measurement; \n\t\t\tPower measurement; \n\t\t\tSilicon;", "name": "Assembly and reliability of advanced packaging technologies in high speed networking applications", "author": "Savic, J.Aria, P.Priest, J.Ahmad, M.Hubbard, K.Pomerleau, R.Sue TengNagar, M.Jie Xue", "series_t": "1-4 June 2010", "genre_s": "IEEE", "id": "978-1-4244-6410-4", "cat": "\n\t\t\tHigh end networking and computing applications continue to drive silicon technologies for higher data rates and increased bandwidth. The push for silicon performance with 45nm and 32nm devices also drives a need for packaging performance to deliver clean and efficient power to the device. This paper compares the electrical performance, assembly and reliability of various advanced packaging technologies, which are aimed to improve the DC and AC power delivery network (PDN) in a network ASIC (Application Specific Integrated Circuit). A baseline ASIC component was redesigned and fabricated into (1) a hybrid package placing the baseline ASIC onto a customized interposer board fabricated with both conventional and advanced high-capacitance laminate systems (2) a package utilizing a conventional substrate having capacitors interspersed between the BGA-balls, (3) a package utilizing an organic substrate with an embedded bulk array capacitor, and (4) a package using a coreless substrate. The bare substrates and ASIC component were assembled through conventional high volume processes whenever possible. The ASIC components were then assembled onto line cards using conventional board level assembly parameters and techniques. Electrical and reliability testing were performed at both device level and product level. For electrical measurement, improvements to the PDN were quantified by measuring the power rail noise and clock jitter and comparing each package variant to the performance of the baseline ASIC. The package design, signal routing, device, and system, assembly and test environments are essentially unchanged; the differences are attributed primarily to the substrate and package technology itself. A strong correlation between simulation results and electrical performance data was observed. A qualitative/quantitative system of comparing the cost, complexity and capability of each solution was used to evaluate their viability for implementation into high volume manufacturi- - ng. Package and Board Level Reliability (BLR) was conducted on the most viable solutions.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5488681&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DThermal+neutron+soft+error+rate+for+SRAMS+in+the+90NM%E2%80%9345NM+technology+range", "features": " \n\t\t\tSRAM chips; \n\t\t\tintegrated circuit reliability; \n\t\t\tthermal analysis; \n\t\t\tSER sensitivity; \n\t\t\tSRAM cell; \n\t\t\tsize 90 nm to 45 nm; \n\t\t\tthermal neutron soft error rate; \n\t\t\tContamination; \n\t\t\tCosmic rays; \n\t\t\tError analysis; \n\t\t\tInductors; \n\t\t\tNeutrons; \n\t\t\tParticle beams; \n\t\t\tPollution measurement; \n\t\t\tRadiography; \n\t\t\tRandom access memory; \n\t\t\tTesting; \n\t\t\tSRAM; \n\t\t\tThermal neutron; \n\t\t\tsoft error rate;", "name": "Thermal neutron soft error rate for SRAMS in the 90NM&#x2013;45NM technology range", "author": "ShiJie WenWong, R.Romain, M.Tam, N.", "series_t": "2-6 May 2010", "genre_s": "IEEE", "id": "978-1-4244-5430-3", "cat": "\n\t\t\tThe thermal neutron soft error rate (SER) was measured systematically on SRAM cells in the technology range of 90 nm to 45 nm. We report here a substantial SER sensitivity with neutron energies below 0.4 eV for many SRAM cells.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5490767&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DAn+evaluation+of+die+crack+risk+of+over-molded+packages+due+to+external+impact", "features": " \n\t\t\tAssembly; \n\t\t\tFailure analysis; \n\t\t\tGeometry; \n\t\t\tPackaging machines; \n\t\t\tPerformance evaluation; \n\t\t\tProcess design; \n\t\t\tProtection; \n\t\t\tSilicon; \n\t\t\tStress; \n\t\t\tTesting;", "name": "An evaluation of die crack risk of over-molded packages due to external impact", "author": "Peng SuKhan, B.Ming Ding", "series_t": "1-4 June 2010", "genre_s": "IEEE", "id": "978-1-4244-6410-4", "cat": "\n\t\t\tComponent failures due to physical damage to the silicon are occasionally observed on board assembly processes. Such failures typically are not detected until electrical testing is performed at the end of the process, making it challenging to identify where and how such damages could occur. While process steps are designed to apply the lowest force possible on components, excessive load can be introduced by unexpected events such as machine malfunction or accidental external impact. For over-molded packages, particularly for packages with a large die and thin mold cap thickness, protection for such abnormal impact is reduced and even low levels of force can induce damage to the silicon. In this work, impact test is performed on two types of over-molded packages that have different die and package geometries. External load is applied on the top of the packages through the drop of a probe from different heights. The damages induced in the silicon are evaluated with ultrasonic scan and cross-section. The results from these analytical steps will help identify the threshold force for the die crack failures. A finite element model is constructed to simulate the impact test for one of the packages. The time-history of the load is analyzed and the maximum stress levels in the silicon for the different drop heights are compared. Two different mold cap thicknesses are also simulated. By comparing the stress levels from the model and the real-life testing results, we are able to obtain general guidelines for the maximal impact allowed for the package investigated in this study and provide references for analysis of future failures.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5656775&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DComparative+Study+of+Secure+vs.+Non-secure+Transport+Protocols+on+the+SIP+Proxy+Server+Performance%3A+An+Experimental+Approach", "features": " \n\t\t\tIP networks; \n\t\t\tInternet telephony; \n\t\t\tsecurity of data; \n\t\t\tsignalling protocols; \n\t\t\ttransport protocols; \n\t\t\tIP network; \n\t\t\tInternet; \n\t\t\tInternet conferencing; \n\t\t\tSIP Register; \n\t\t\tSIP proxy server; \n\t\t\tSIP session establishment; \n\t\t\tcall control software package; \n\t\t\tcall routing; \n\t\t\tevents notification; \n\t\t\tinstant messaging; \n\t\t\tmessage signaling; \n\t\t\tnetwork performance; \n\t\t\tnonsecure transport protocol; \n\t\t\tpacket voice network; \n\t\t\tsecure real time protocol; \n\t\t\tservice provider; \n\t\t\tsession initiation protocol; \n\t\t\tsignaling protocol; \n\t\t\ttelephony; \n\t\t\ttransport layer security; \n\t\t\tvoice over IP; \n\t\t\twide scale deployment; \n\t\t\tAuthentication; \n\t\t\tLocal area networks; \n\t\t\tServers; \n\t\t\tSoftware; \n\t\t\tTransport protocols; \n\t\t\tPerformance; \n\t\t\tSIP; \n\t\t\tSRTP; \n\t\t\tTCP; \n\t\t\tTLS; \n\t\t\tUDP;", "name": "Comparative Study of Secure vs. Non-secure Transport Protocols on the SIP Proxy Server Performance: An Experimental Approach", "author": "Subramanian, S.V.Dutta, R.", "series_t": "16-17 Oct. 2010", "genre_s": "IEEE", "id": "978-1-4244-8093-7", "cat": "\n\t\t\tThe wide scale deployment of Internet combined with several advancements in hardware and software technologies created opportunities for several Internet based applications such as Voice Over IP (VoIP) that involves the delivery of voice, video and data to the end user. SIP, the Session Initiation Protocol, is a signaling protocol for Internet conferencing, telephony, presence, events notification and instant messaging. The SIP Proxy Server is a call control software package that enables service providers to build scalable, reliable Voice over IP networks today and it provides a full array of call routing capabilities to maximize network performance in both small and large packet voice networks. The SIP Proxy Server can perform a digest authentication of SIP Register, invite requests, and can encrypt SIP requests and responses using Transport Layer Security (TLS). For secure communication, user authentication, confidentiality and integrity of signaling message and SIP session establishment are essential. TLS is used for the secured SIP signaling and Secure Real Time Protocol (SRTP) for secured SIP session establishment. This paper is focused on evaluating the performance impacts of SIP proxy servers when secured (TLS) over non-secured transport protocols (TCP/UDP) are used to transport SIP messages. Several experiments were conducted in a lab environment to evaluate key performance parameters such as Call setup time, Mean number of calls, Memory utilization, CPU utilization and queue size.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5656772&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DPerformance+Measurements+and+Analysis+of+M%2FM%2Fc+Queuing+Model+Based+SIP+Proxy+Servers+in+Local+and+Wide+Area+Networks", "features": " \n\t\t\tInternet telephony; \n\t\t\thypermedia; \n\t\t\tlocal area networks; \n\t\t\tmultimedia communication; \n\t\t\tpeer-to-peer computing; \n\t\t\tqueueing theory; \n\t\t\tsignalling protocols; \n\t\t\ttelecommunication network routing; \n\t\t\ttransport protocols; \n\t\t\twide area networks; \n\t\t\tASCII; \n\t\t\tHTTP; \n\t\t\tIP protocol; \n\t\t\tIP telephony; \n\t\t\tInternet Engineering Task Force; \n\t\t\tInternet protocol telephony; \n\t\t\tM/M/c queuing model; \n\t\t\tSIP proxy server; \n\t\t\tcall routing service; \n\t\t\tlocal area network; \n\t\t\tpeer-to-peer multimedia signaling protocol; \n\t\t\tperformance measurement; \n\t\t\treliable packet voice network; \n\t\t\tsession initiation protocol; \n\t\t\twide area network; \n\t\t\tIP networks; \n\t\t\tLocal area networks; \n\t\t\tProtocols; \n\t\t\tRouting; \n\t\t\tServers; \n\t\t\tSoftware; \n\t\t\tWide area networks; \n\t\t\tLAN; \n\t\t\tM/M/c; \n\t\t\tPerformance; \n\t\t\tSIP; \n\t\t\tWAN;", "name": "Performance Measurements and Analysis of M/M/c Queuing Model Based SIP Proxy Servers in Local and Wide Area Networks", "author": "Subramanian, S.V.Dutta, R.", "series_t": "16-17 Oct. 2010", "genre_s": "IEEE", "id": "978-1-4244-8093-7", "cat": "\n\t\t\tIn recent years, Internet Protocol (IP) telephony is becoming popular because it offers more flexibility in the implementation of new features and services. Session Initiation Protocol (SIP) is a peer-to-peer, multimedia signaling protocol standardized by the Internet Engineering Task Force (IETF) plays a vital role in providing services to IP telephony. SIP is ASCII-based, resembling HTTP, and reuses existing IP protocols such as Domain Name Service (DNS), Real Time Protocol (RTP), Session Description Protocol (SDP) etc. to provide media setup and teardown. The SIP Proxy Server (SPS) is a software application that provides call routing services for the SIP based IP telephony network. The efficiency of this process can create large scale, highly reliable packet voice networks for service providers and enterprises. We established that the efficient design and implementation of the SPS architecture can enhance the performance characteristics of a SPS significantly. In this paper, we studied the SPS performance that can be characterized by its transaction states of each SIP session of a M/M/c based SIP proxy server performance model in Local and Wide Area Networks.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5433748&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DDefect-Tolerant+Design+and+Optimization+of+a+Digital+Microfluidic+Biochip+for+Protein+Crystallization", "features": " \n\t\t\tbioMEMS; \n\t\t\tcircuit optimisation; \n\t\t\tcrystallisation; \n\t\t\tlab-on-a-chip; \n\t\t\tmicrofluidics; \n\t\t\tmolecular biophysics; \n\t\t\tnetwork synthesis; \n\t\t\tproteins; \n\t\t\tamino acid 3-D arrangement; \n\t\t\tbiological function; \n\t\t\tdefect-tolerant design; \n\t\t\tdigital microfluidic biochip optimization; \n\t\t\tdroplet-based digital microfluidics; \n\t\t\tdrug design; \n\t\t\telectrowetting-on-dielectric; \n\t\t\tmultiwell-plate microfluidic biochip; \n\t\t\ton-chip electrodes; \n\t\t\tpin-assignment plan; \n\t\t\tpin-constrained chip design; \n\t\t\tprotein crystallization; \n\t\t\tAmino acids; \n\t\t\tCrystallization; \n\t\t\tDesign optimization; \n\t\t\tDrugs; \n\t\t\tHumans; \n\t\t\tLaboratories; \n\t\t\tManufacturing; \n\t\t\tMicrofluidics; \n\t\t\tNanobioscience; \n\t\t\tProteins; \n\t\t\tDigital microfluidics; \n\t\t\tdroplet routing; \n\t\t\tlab-on-chip; \n\t\t\tpin-constrained biochip design; \n\t\t\troute scheduling; \n\t\t\twell-plate chip;", "name": "Defect-Tolerant Design and Optimization of a Digital Microfluidic Biochip for Protein Crystallization", "author": "Tao XuChakrabarty, K.Pamula, V.K.", "series_t": "April 2010", "genre_s": "IEEE", "id": "0278-0070", "cat": "\n\t\t\tProtein crystallization is a commonly used technique for protein analysis and subsequent drug design. It predicts the 3-D arrangement of the constituent amino acids, which in turn indicates the specific biological function of a protein. Protein crystallization experiments are typically carried out in well-plates in the laboratory. As a result, these experiments are slow, expensive, and error-prone due to the need for repeated human intervention. Recently, droplet-based Â¿digitalÂ¿ microfluidics have been used for executing protein assays on a chip. Protein samples in the form of nanoliter-volume droplets are manipulated using the principle of electrowetting-on-dielectric. We present the design of a multi-well-plate microfluidic biochip for protein crystallization; this biochip can transfer protein samples, prepare candidate solutions, and carry out crystallization automatically. To reduce the manufacturing cost of such devices, we present an efficient algorithm to generate a pin-assignment plan for the proposed design. The resulting biochip enables control of a large number of on-chip electrodes using only a small number of pins. Based on the pin-constrained chip design, we present an efficient shuttle-passenger-like droplet manipulation method and test procedure to achieve high-throughput and defect-tolerant well loading.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5742053&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DThermal+aware+test+scheduling+for+stacked+multi-chip-modules", "features": " \n\t\t\tcircuit testing; \n\t\t\tmultichip modules; \n\t\t\tscheduling; \n\t\t\tthermal management (packaging); \n\t\t\t3D structure; \n\t\t\tdie temperatures; \n\t\t\tglobal peak power model; \n\t\t\theat flow; \n\t\t\tpower profile partitions; \n\t\t\tstacked multichip-modules; \n\t\t\tstacked structures; \n\t\t\tthermal aware test scheduling; \n\t\t\tCost function; \n\t\t\tHeating; \n\t\t\tPartitioning algorithms; \n\t\t\tResistance; \n\t\t\tSchedules; \n\t\t\tTesting; \n\t\t\tThree dimensional displays;", "name": "Thermal aware test scheduling for stacked multi-chip-modules", "author": "Vinay, N.S.Rawaty, I.Larssonz, E.Gaurx, M.S.Singh, V.", "series_t": "17-20 Sept. 2010", "genre_s": "IEEE", "id": "978-1-4244-9555-9", "cat": "\n\t\t\tIn an attempt to increase the area utilization of multi-chip packages, manufacturers have started looking at 3D packaging. The 3D structures have either dies or chips stacked one above the other. These 3D structures have low thermal capabilities, and hence the thermal issues get aggravated during testing. In this paper, thermal aware test scheduling techniques for stacked structures is proposed. Care is taken to schedule the stacked partitions appropriately to prevent local heating and achieve uniform vertical temperature spread. Concurrent testing of dies is considered for reduced test time and existing test architecture is employed. The widely used global peak power model gives a pessimistic estimate of the power profile. A new partition scheme is proposed for the power profile based on power variations and true power. This scheme of power profile partitioning which is a trade-off between a cycle accurate model and global peak model offers both flexibility during scheduling and also reduces total false power. The power profile partitions are scheduled through algorithms based on heuristics. System model of the 3D stack is obtained from the linear RC-models after considering the various factors that affect the heat flow and die temperatures. Simulation results show that the proposed technique achieves uniform temperature spread across the 3D structure.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5499476&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DOn+Nodal+Encounter+Patterns+in+Wireless+LAN+Traces", "features": " \n\t\t\tad hoc networks; \n\t\t\tgraph theory; \n\t\t\tmobile radio; \n\t\t\twireless LAN; \n\t\t\tcorporate campuses; \n\t\t\tgraph analysis; \n\t\t\tinfrastructureless network; \n\t\t\tmobile network; \n\t\t\tmobile nodal encounter patterns; \n\t\t\tmultiple wireless LAN traces; \n\t\t\tnoncooperative nodes; \n\t\t\trobust ad hoc communication network; \n\t\t\tshort lived encounter event; \n\t\t\tstore-carry-forward message dissemination; \n\t\t\ttime-varying internode connectivity; \n\t\t\tuniversity campuses; \n\t\t\tCommunication networks; \n\t\t\tInformation analysis; \n\t\t\tInformation science; \n\t\t\tPattern analysis; \n\t\t\tPressing; \n\t\t\tProtocols; \n\t\t\tRobustness; \n\t\t\tTelecommunication traffic; \n\t\t\tWireless LAN; \n\t\t\tWireless networks; \n\t\t\tComputer systems organization; \n\t\t\tcommunication/networking and information technology; \n\t\t\tmobile computing; \n\t\t\tmobile environments; \n\t\t\twide-area networks; \n\t\t\twireless.;", "name": "On Nodal Encounter Patterns in Wireless LAN Traces", "author": "Wei-jen HsuHelmy, A.", "series_t": "Nov. 2010", "genre_s": "IEEE", "id": "1536-1233", "cat": "\n\t\t\tIn this paper, we analyze multiple wireless LAN (WLAN) traces from university and corporate campuses. In particular, we consider important events between mobile nodes in wireless networks-encounters. We seek to understand encounter patterns in the mobile network from a holistic view, using a graph analysis approach. Such an analysis sheds light on the diverse, nonhomogeneous nature of users in the given environments in terms of their encounter events with other nodes. Furthermore, we evaluate the feasibility of forming an infrastructureless network to reach most of the nodes utilizing time-varying internode connectivity through encounters, and the robustness of such an ad hoc communication network. Our analysis shows that while the encounter events are “sparse” (i.e., any given node does not encounter with many other nodes), the connectivity of the whole network is well-maintained, and a Small World pattern of nodal encounter emerges for the observation periods longer than one day. More interestingly, the encounter events collectively form a robust communication network, in which store-carry-forward message dissemination can be successful even with over 20 percent noncooperative nodes or removal of short-lived (up to minutes) encounter events.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5556538&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DTransforming+telemedicine+for+rural+and+urban+communities+Telemedicine+2.0+-+any+doctor%2C+any+place%2C+any+time", "features": " \n\t\t\tbiomedical telemetry; \n\t\t\tcomputer centres; \n\t\t\thealth care; \n\t\t\tteleconferencing; \n\t\t\ttelemedicine; \n\t\t\tvideo communication; \n\t\t\taudio telemetry; \n\t\t\tdata center; \n\t\t\thigh definition videoconferencing; \n\t\t\thigh quality video telemetry; \n\t\t\tintelligent transport; \n\t\t\tquality healthcare; \n\t\t\trural communities; \n\t\t\ttelemedicine 2.0; \n\t\t\turban communities; \n\t\t\tBiomedical monitoring; \n\t\t\tFacsimile; \n\t\t\tMedical services; \n\t\t\tMonitoring; \n\t\t\tMultiprotocol label switching; \n\t\t\tTV; \n\t\t\tWide area networks; \n\t\t\tHealthcare; \n\t\t\tHigh Definition; \n\t\t\tQoS; \n\t\t\tTelemedicine; \n\t\t\tTelemetry; \n\t\t\tVideoconference;", "name": "Transforming telemedicine for rural and urban communities Telemedicine 2.0 - any doctor, any place, any time", "author": "Wen-Pai LuLeung, H.Estrada, E.", "series_t": "1-3 July 2010", "genre_s": "IEEE", "id": "978-1-4244-6374-9", "cat": "\n\t\t\tProviding quality healthcare in both rural and urban settings introduces many challenges. While today's Telemedicine attempts to address these challenges, the current approach is limited. This paper defines a new system architecture that leverages the network as the platform for intelligent transport and services to support high-definition videoconferencing and high-quality video and audio telemetry without the usual prohibitive cost. We describe the intelligent system components used at the end points and in the data center, and the requirements for a robust network both in the enterprise and in the service provider arenas. We contrast today's Telemedicine workflow with the workflow of Telemedicine 2.0. Finally, we offer a view of possible extensions Telemedicine 2.0 to further capitalize on the infrastructure and architecture proposed in this paper.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5462240&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DLayered+Internet+Video+Engineering+.LB.LIVE.RB.%3A+Network-Assisted+Bandwidth+Sharing+and+Transient+Loss+Protection+for+Scalable+Video+Streaming", "features": " \n\t\t\tInternet; \n\t\t\tdata compression; \n\t\t\tforward error correction; \n\t\t\ttransport protocols; \n\t\t\tvideo coding; \n\t\t\tvideo streaming; \n\t\t\tH.264/SVC streams; \n\t\t\tTCP flows; \n\t\t\texplicit congestion notification framework; \n\t\t\tfeedback virtual congestion levels; \n\t\t\tforward error correction protection; \n\t\t\tlayered Internet video engineering; \n\t\t\tmedia-aware bandwidth sharing; \n\t\t\tnetwork nodes; \n\t\t\tnetwork-assisted bandwidth sharing; \n\t\t\tpacket losses; \n\t\t\tqueuing delays; \n\t\t\tscalable video streaming; \n\t\t\ttransient loss protection; \n\t\t\tvideo rate-distortion characteristics; \n\t\t\tBandwidth; \n\t\t\tDelay; \n\t\t\tFeedback; \n\t\t\tForward error correction; \n\t\t\tIP networks; \n\t\t\tProtection; \n\t\t\tRate-distortion; \n\t\t\tStatic VAr compensators; \n\t\t\tStreaming media; \n\t\t\tVideo sharing;", "name": "Layered Internet Video Engineering &#40;LIVE&#41;: Network-Assisted Bandwidth Sharing and Transient Loss Protection for Scalable Video Streaming", "author": "Xiaoqing ZhuRong PanDukkipati, N.Subramanian, V.Bonomi, F.", "series_t": "14-19 March 2010", "genre_s": "IEEE", "id": "978-1-4244-5836-3", "cat": "\n\t\t\tThis paper presents a novel scheme, Layered Internet Video Engineering (LIVE), in which network nodes feedback virtual congestion levels to video senders to assist both media-aware bandwidth sharing and transient loss protection. The video senders respond to such feedback by adapting the rates of encoded H.264/SVC streams based on their respective video rate-distortion (R-D) characteristics. The same feedback is employed to calculate the amount of forward error correction (FEC) protection for combating transient losses. Simulation studies show that LIVE can minimize the total distortion of all participating video streams and hence maximize their overall quality. At steady state, video streams experience no queuing delays or packet losses. In face of transient congestion, the network-assisted adaptive FEC effectively protect video packets from losses while keeping a minimum overhead. Our theoretical analysis further guarantees system stability for arbitrary number of streams with arbitrary round trip delays below a prescribed limit. Finally, we show that LIVE streams can coexist with TCP flows within the existing explicit congestion notification (ECN) framework.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5490777&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DPb-free+solder+joint+reliability+of+fine+pitch+chip-scale+packages", "features": " \n\t\t\tAging; \n\t\t\tAssembly; \n\t\t\tChip scale packaging; \n\t\t\tElectronics packaging; \n\t\t\tFoot; \n\t\t\tGrain size; \n\t\t\tIsothermal processes; \n\t\t\tLead; \n\t\t\tSoldering; \n\t\t\tStress;", "name": "Pb-free solder joint reliability of fine pitch chip-scale packages", "author": "Weidong XieTae-Kyu LeeKuo-Chuan LiuJie Xue", "series_t": "1-4 June 2010", "genre_s": "IEEE", "id": "978-1-4244-6410-4", "cat": "\n\t\t\tChip-scale package (CSP) is commonly seen on high density boards as it minimizes the foot print while packed more functionality into one component. Board level reliability concern over CSPs is that finer pitch limits the solder ball size attached and the stencil thickness used in assembly which leads to much smaller joint volume and standoff while larger die-to-package ratio typically means higher stress level caused by the CTE mismatch. Prior studies have shown that the grain orientation may impact SnAgCu solder joint reliability. With less solder volume, the joint reliability of fine pitch SnAgCu solder may be more sensitive to the grain size, grain orientation, and IMC formation within the bulk solder. The purpose of the study is to evaluate the board level reliability of Pb-free ball grid array (BGA) packages with ball pitch smaller than 0.5mm under different packaging and assembly conditions. Based on a test vehicle with 0.4mm pitch daisy-chained CVBGA, the impact on solder joint reliability from a wide spectrum of variables such as PCB thickness, SMT configuration, die size, package pad finish, and mini cycle profiling has been investigated. The results of this study enable us to better understand the Pb-free fine pitch joint behaviors under different conditions and the factors that have significant impact on joint reliability. Isothermal aging effect has also been studied, will be presented in a separated paper, which demonstrated that isothermal aging could significantly degrade joint reliability for fine pitch packages. The ATC results proved that the fine pitch packages may underperform the components with regular 0.8–1.0mm pitch therefore extra attention needs to be paid on fine pitch components while converting high reliability products to Pb-free.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5607341&contentType=Journals+%26+Magazines&searchField%3DSearch_All%26queryText%3DWeighted+Fairness+and+Correct+Sizing+of+the+Secondary+Transit+Queue+in+Resilient+Packet+Rings", "features": " \n\t\t\tmetropolitan area networks; \n\t\t\tprotocols; \n\t\t\tqueueing theory; \n\t\t\ttelecommunication network topology; \n\t\t\twide area networks; \n\t\t\tIEEE 802.17; \n\t\t\tMAN; \n\t\t\tRPR protocol; \n\t\t\tWAN; wide area networks; \n\t\t\tcorrect sizing; \n\t\t\tresilient packet ring; \n\t\t\tresilient packet rings; \n\t\t\tsecondary transit queue; \n\t\t\tstandardized ring topology network architecture; \n\t\t\tweighted fairness; \n\t\t\tBandwidth; \n\t\t\tColor; \n\t\t\tInternet; \n\t\t\tOptimized production technology; \n\t\t\tSONET; \n\t\t\tServers; \n\t\t\tThroughput; \n\t\t\tFairness; \n\t\t\tMAN; \n\t\t\tRing networks; \n\t\t\tSpatial reuse; \n\t\t\tWAN;", "name": "Weighted Fairness and Correct Sizing of the Secondary Transit Queue in Resilient Packet Rings", "author": "Yilmaz, M.Ansari, N.", "series_t": "November 2010", "genre_s": "IEEE", "id": "1943-0620", "cat": "\n\t\t\tThe IEEE 802.17 is a standardized ring topology network architecture, called the Resilient Packet Ring (RPR), to be used mainly in metropolitan and wide area networks. After a brief overview of the IEEE 802.17 RPR protocol, this article investigates the weighted fairness aspects as well as the requirements for sizing the secondary transit queue of IEEE 802.17 RPR stations (in the aggressive mode of operation). The analysis and suggested improvements presented in this article are then supported by performance evaluation results and theoretical calculations.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5501503&contentType=Conference+Publications&searchField%3DSearch_All%26queryText%3DInformation+Theory%2C+Information+View%2C+and+Software+Testing", "features": " \n\t\t\tinformation theory; \n\t\t\tprogram testing; \n\t\t\tShannon theory; \n\t\t\tinformation theory; \n\t\t\tinformation view; \n\t\t\tsoftware testing; \n\t\t\tDrugs; \n\t\t\tEntropy; \n\t\t\tEquations; \n\t\t\tHardware; \n\t\t\tInformation technology; \n\t\t\tInformation theory; \n\t\t\tPetroleum; \n\t\t\tSoftware quality; \n\t\t\tSoftware testing; \n\t\t\tUncertainty; \n\t\t\tInformation theory; \n\t\t\tentropy; \n\t\t\tinformation view; \n\t\t\tsoftware testing; \n\t\t\tuncertainty;", "name": "Information Theory, Information View, and Software Testing", "author": "Zuo, R.", "series_t": "12-14 April 2010", "genre_s": "IEEE", "id": "978-1-4244-6270-4", "cat": "\n\t\t\tInformation theory was founded by Claude Shannon in 1948 for communication and has also been applied in many other areas since then. With the basic concepts from information theory, this paper studies software testing from a new view, called information view. From information view, the purpose of software testing is to generate information for the software under test to reduce its uncertainty, and the product from the testing is information. As demonstrated in several simple examples, equations used in information theory can help to calculate the information quantity generated from a test case, and use it as a measurement to improve testing processes. From information view, this paper also raises several new fundamental questions, which cannot be answered by either Shannon's information theory or current software testing theory, for future research to get a better understanding of the nature of software testing.\n\t\t"}]