[{"id": "868673", "name": "{\"id\": \"266\\n\\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\\n\\nCarrier Sense Multiple Access Communications on\\n\\nMultipacket Reception Channels: Theory and\\n\\nApplications to IEEE 802.11 Wireless Networks\\n\\nDouglas S. Chan, Senior Member, IEEE, Toby Berger, Life Fellow, IEEE, and Lang Tong, Fellow, IEEE\\n\\nAbstract\\u2014Multipacket reception (MPR) refers to physical\\nlayers where receivers can decode multiple simultaneously trans-\\nmitted packets. In this paper we investigate the resulting perfor-\\nmance of conjoining carrier sense multiple access (CSMA) com-\\nmunications with MPR. We report on its maximum achievable\\nstable throughput with decentralized control and show there can\\nbe throughput gain over slotted ALOHA (S-ALOHA), the non-\\nchannel-sensing protocol of choice. However, this gain diminishes\\nas the physical layer\\u2019s MPR strength increases, thereby dimin-\\nishing the need for channel sensing. Nonetheless, for systems\\nevolving from a single-user (SU) to a multiple-user (MU) channel,\\nCSMA can furnish signi\\ufb01cantly more ef\\ufb01cient utilization of MPR\\ncapacity than S-ALOHA. This is meaningful in practice because\\nthe emerging generation of the widely deployed IEEE 802.11\\nwireless local area networks (WLAN) \\u2014 802.11ac \\u2014 is adapting\\nMPR and will operate in said region. In that regard, we also\\ndiscuss the effective usage of a channel\\u2019s resources for MPR\\nand highlight the advantages multiuser-MIMO (MU-MIMO),\\nan MPR technique, can offer to WLANs. Using early design\\nspeci\\ufb01cations of 802.11ac, we show that the existing SU-oriented\\n802.11 MAC parameters can under-utilize the MPR capacity\\noffered by a MU-oriented physical layer.\\n\\nIndex Terms\\u2014Multiple access theory, CSMA, multipacket\\nreception, IEEE 802.11ac, wireless local area networks, cross-\\nlayer design, slotted ALOHA.\\n\\nI. INTRODUCTION\\n\\nT RADITIONALLY, practical design and theoretical anal-\\n\\nysis of random multiple access protocols have assumed\\nthe classical collision channel model \\u2014 namely, a trans-\\nmitted packet\\nis considered successfully received as long\\nas it does not overlap or \\u201ccollide\\u201d with another. Although\\nthis model is analytically amenable and re\\ufb02ected the state\\n\\nPaper approved by A. Pattavina,\\n\\nthe Editor for Switching Architecture\\nPerformance of the IEEE Communications Society. Manuscript received May\\n6, 2011; revised February 1 and May 23, 2012.\\n\\nThis paper was presented in part at the 42nd Annual Allerton Conference\\non Communications, Control, and Computing, Allerton, IL, USA, 2004, and\\nthe 116th IEEE 802.11 Wireless Local Area Network Working Group Session,\\nSan Francisco, CA, USA, 2009.\\n\\nD. S. Chan is with Cisco Systems, San Jose, CA 95134, USA. He was\\nwith the School of Electrical and Computer Engineering, Cornell University,\\nIthaca, NY 14853, USA, where he researched the main body of this paper\\u2019s\\nwork (e-mail: douglas.chan@ieee.org).\\n\\nT. Berger is with the Charles L. Brown Dept. of Electrical and Computer\\nEngineering, University of Virginia, Charlottesville, VA 22904, USA, and the\\nSchool of Electrical and Computer Engineering, Cornell University, Ithaca,\\nNY 14853, USA (e-mail: tb6n@virginia.edu).\\n\\nL. Tong is with the School of Electrical and Computer Engineering, Cornell\\n\\nUniversity, Ithaca, NY 14853, USA (e-mail: ltong@ece.cornell.edu).\\n\\nThe work of L. Tong was supported in part by the National Science\\n\\nFoundation under award CCF 1018115.\\n\\nDigital Object Identi\\ufb01er 10.1109/TCOMM.2012.120512.110285\\n\\n0090-6778/13$31.00 c(cid:2) 2013 IEEE\\n\\nof technology when networking was an emerging \\ufb01eld, the\\nclassical collision model does not represent the capabilities of\\ntoday\\u2019s transceivers. In particular, present transceiver technolo-\\ngies enable users to correctly receive multiple simultaneously\\ntransmitted data packets. With proper design, this capability\\n\\u2014 commonly referred to as multiple packet reception (MPR)\\n[1][2] \\u2014 can signi\\ufb01cantly enhance network performance.\\nMany fundamental ideas behind MPR already have been\\nwell researched and widely applied [3, \\u00a71]. Such examples\\ninclude code division multiple access (CDMA) and frequency\\ndivision multiple access (FDMA). But while MPR is applied\\ntherein as the basis for enabling multiple users to share a\\nchannel, for networks that employ packet-by-packet random\\nmultiple access, MPR represents a paradigm shift from the\\ntypical single-user (SU) to multiple-user (MU) models \\u2014\\nsomething that is only beginning to happen in practice. Em-\\nploying MPR in the physical (PHY) layer also expands the\\nset of parameters for the media access control (MAC) layer to\\nconsider in its scheduling process, thus underscoring the im-\\nportance for cross-layer design that strives to jointly optimize\\nthe functions of these layers [4]. Providing further insights\\nfor doing so in random multiple access communications with\\nMPR \\u2014 both in theory and in practice \\u2014 is the main goal of\\nthe present paper.\\n\\nA. Development of MPR in CSMA and 802.11 WLANs\\n\\nThe concept of random access on MPR channels was\\nintroduced by Ghez, Verd\\u00b4u and Schwartz in [1] and [2],\\nwhere they studied the performance of slotted ALOHA (S-\\nALOHA) with MPR. Since then there has been much research\\non multiple access with MPR. However, until only recently,\\nthere has been no research published on carrier sense multiple\\naccess (CSMA) with MPR.\\n\\nCSMA refers to a family of\\n\\nrandom multiple access\\nschemes wherein a station (STA) with packets to transmit\\nwill attempt to do so only when the channel is detected to\\nbe idle. It was \\ufb01rst shown by Kleinrock and Tobagi [5] that\\nthis provides signi\\ufb01cant performance improvement over S-\\nALOHA on the collision channel. CSMA have become the\\nfoundations of many networking technologies. For example,\\nCSMA and CSMA with collision avoidance (CSMA/CA) are\\nemployed in the MAC layers of IEEE 802.11-based wireless\\nlocal area networks (WLAN) [6]. However, none of these\\ntechnologies have deployed MPR yet.\\n\\n\\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\\n\\n267\\n\\nFig. 1. Typical realization of channel activities with the CSMA protocol based on our network model.\\n\\nThe \\ufb01rst substantial research on CSMA with MPR did not\\nappear until 2004 when we reported in [7] on conjoining the\\ntwo concepts and studied the resulting performance. Recog-\\nnizing the bene\\ufb01ts that MPR can bring to WLANs, in 2005\\nwe presented the idea in a proposal [8] to the 802.11 WLAN\\nWorking Group for a future WLAN standard that incorporates\\nMPR. Two years later, the notion of adapting a MU model in\\nWLAN began garnering more consideration from members of\\nthe Working Group (eg. [9]). In late 2008, the 802.11ac Task\\nGroup (TGac) was established to develop a WLAN standard\\nthat supports a maximum aggregate throughput of at least 1\\nGbps [10]. In order to realize the targeted data rates, TGac\\nrecognizes the need for higher data multiplexing ef\\ufb01ciency and\\nhas identi\\ufb01ed MPR techniques like OFDMA and spatial divi-\\nsion multiple access (SDMA), also known as MU multiple-\\ninput-multiple-output (MU-MIMO), as candidate technologies\\n[10]. TGac now has converged on adapting MU-MIMO as one\\nof the core technologies of the 802.11ac PHY layer [11].\\n\\nB. Main Contributions of This Paper\\n\\nThis paper is an extension of the seminal multiaccess theory\\non MPR channels set forth in [1] and [2] to embody another\\nessential MAC protocol \\u2014 CSMA. We \\ufb01nd that CSMA will\\nalways provide a higher throughput than S-ALOHA when\\nclosed-loop control is used, but this margin diminishes when\\nthe ability to resolve simultaneous transmissions is strong.\\nNonetheless, for systems that are evolving from SU to MU,\\nCSMA can furnish signi\\ufb01cantly better performance than S-\\nALOHA via more ef\\ufb01cient utilization of MPR capacity. This\\nis of practical signi\\ufb01cance because the emerging generation of\\nMPR-enabled WLANs likely will operate in this regime. We\\nillustrate the applicability of our theoretical results by showing\\nthe effective usage of channel resources for MPR and the\\nadvantages that MU-MIMO can offer to WLANs. In particular,\\nby simulating early 802.11ac speci\\ufb01cations, we show that its\\nSU-oriented MAC layer can under-utilize the capacity offered\\nby an MPR-enabled MU-oriented PHY layer.\\n\\nC. Other Related Work\\n\\nIn 2009, Zhang et al. reported in [12] their analysis of MPR\\nin WLANs, employing 802.11g as an example. While their\\nconclusions corroborate some themes in the theory we discuss\\nhere, their main results for CSMA are not shown analytically\\nbut via numerical results. And although they looked at S-\\nALOHA too,\\nits intricate relationship with CSMA is not\\nextensively investigated. Their entire focus is also only on\\none speci\\ufb01c type of MPR channel. Moreover, their discussion\\n\\nfor designing WLAN with MPR is on the limiting case when\\nnumber of users is in\\ufb01nite, which differs from ours on the\\n\\ufb01nite user case as re\\ufb02ected in practice. According to [13], their\\nresearch in [12] was conducted unbeknownst of our earlier\\nwork.\\n\\nOther researchers also have published results on this topic\\nthat enrich the theory and advance our understanding of it,\\nlike [14] and [15]. Particularly, Gau [14] provided another\\ntreatment of this topic by applying the traditionally used but\\npossibly unrealistic framework wherein the overall offered\\ntraf\\ufb01c is Poisson; we discuss in III-D how this provides an\\nalternative perspective of the theory in this paper.\\n\\nII. THE NETWORK MODEL\\n\\nA. Topology, Timing Relations and the CSMA Protocol\\n\\nWe consider a network with an unbounded number of\\nstations (STAs) contending to transmit data packets to a central\\nbase station. Such a network model corresponds to the uplink\\nof the infrastructure mode in 802.11 WLANs, wherein the\\nbase station is referred to as access point (AP) [6].\\n\\nWe assume each STA can perform carrier sensing, namely\\nto detect whether the channel is currently idle or busy (i.e., that\\nthere is at least one other STA transmitting), and we assume\\nthe time required to do so is negligible (i.e., zero detection\\ntime).1 As illustrated in Fig. 1, we employ a slotted-time\\nsystem in which transmissions may begin only at the start\\nof a slot and that every STA is synchronized to the slots.2\\nSlot duration is designated to be at least the maximum signal\\npropagation time of tprop = dmax/c seconds, where dmax is\\nthe maximum separation distance between the STAs and c is\\nthe signal\\u2019s speed of propagation through the network\\u2019s PHY\\nmedium.3 Such a setup ensures that, after a transmission stops,\\nevery STA will \\ufb01nd the channel to be clear for transmission\\nafter one slot\\u2019s time; thus, each transmission must be preceded\\nby an idle slot. We also assume packets are of constant length\\nlasting T seconds. As in [5] and [17, \\u00a74.4], without loss of\\ngenerality, we choose T = 1, which is equivalent to expressing\\ntime in units of T . We also express the slot duration in terms\\nof this normalized time unit as \\u03c4 = tprop/T , 0 < \\u03c4 < \\u221e.\\nConsequently, a packet will last for 1/\\u03c4 slots, where we have\\nassumed as in [5] that 1/\\u03c4 is an integer.4 In our model,\\n\\n1Note that in 802.11 WLANs [6] a STA has to detect that the channel has\\n\\nbecome busy within 4 \\u03bcs, which is also less than half of the slot duration.\\n\\n2We will forgo analyzing the non-slotted versions as their performances\\n\\nare inferior to those of slotted versions [16] [5].\\n\\n3Eg., c is the speed of light for the air interface in wireless networks.\\n4We can achieve this integral assumption practically by designing one\\u2019s\\n\\nslot duration to \\ufb01t this requirement.\\n\\n\\f268\\n\\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\\n\\neach STA immediately becomes aware of its transmission out-\\ncomes,5 either successful or unsuccessful, without expending\\nextra cost; in this regard, acknowledgements introduce only\\n\\ufb01xed overheads and hence can be neglected from the model\\nwithout affecting comparative analyses.\\n\\nFig. 1 illustrates a typical realization of channel activities\\nwith the CSMA protocol. It is not dif\\ufb01cult to see that CSMA\\u2019s\\nchannel activities can be modelled by a renewal process.\\nNamely, the process regenerates itself after either an idle slot\\nor an idle slot followed by transmission attempts that last for\\na packet\\u2019s duration. We will refer to either of these events as\\na transmission period (TP).\\n\\nOur analysis focuses on CSMA with immediate \\ufb01rst trans-\\nmission (IFT) admission control. Under this policy, when a\\npacket arrives at an inactive STA and the channel is sensed\\nidle, then the STA will attempt to transmit the packet at the\\nstart of the slot immediately following the packet\\u2019s arrival.\\nIf the channel is sensed busy, then the STA will defer its\\nattempt until there is idleness, and thereupon decides randomly\\nwhether to \\u201cbackoff\\u201d or transmit. This random backoff is mod-\\nelled as an independent sampling from a geometric distribution\\nwith parameter p, 0 \\u2264 p \\u2264 1; in other words, each STA\\nattempts transmission with probability p or backs off with\\nprobability 1\\u2212 p.6 The process is repeated if the channel is\\nsensed busy after a backoff or that the packet transmission is\\nnot successfully received.\\n\\nNote\\n\\nthat CSMA with IFT is\\n\\nslotted\\nnon-persistent CSMA protocol introduced by Kleinrock and\\nTobagi in [5]. This variant of CSMA is, moreover, the primary\\nMAC protocol practiced in 802.11 WLANs, called distributed\\ncoordinated function (DCF) [6].\\n\\nexactly the\\n\\nB. Network Traf\\ufb01c and Throughput Characteristics\\n\\nEach STA in our in\\ufb01nite population network model can have\\nup to one packet to be transmitted at any time, be it a newly\\narrived packet or a so-called backlogged packet that needs to\\nbe retransmitted. Packet arrivals for non-backlogged STAs are\\nassumed to be independent and identically distributed from\\nslot to slot. Let \\u02c6At denote the number of new packets that\\narrived during the idle slot of TP t, t \\u2265 0. Assume \\u02c6At has\\nprobability distribution P [ \\u02c6At = n] = \\u02c6\\u03bbn, for n \\u2265 0, such that\\nthe mean arrival rate per slot is\\n\\n\\u221e(cid:2)\\n\\n\\u02c6\\u03bb =\\n\\nn\\u02c6\\u03bbn = \\u03c4 \\u03bb,\\n\\n(1)\\n\\nn=1\\n\\nwhere \\u03bb is the mean arrival rate per normalized time unit (i.e.,\\nper packet duration) and is \\ufb01nite. Described more precisely,\\nour packet arrival model is a point process over the real time\\nline, with mean measure equal to the unit rate \\u03bb scaled by the\\nLebesgue measure. Note that a homogeneous Poisson point\\nprocess of intensity \\u03bb satis\\ufb01es condition (1).\\n\\n5This assumption re\\ufb02ects 802.11 WLANs wherein the STA that has\\nsuccessfully received a data packet has to transmit an acknowledgement packet\\nimmediately after a \\ufb01xed short duration; otherwise, receipt of the data packet\\nis considered unsuccessful.\\n\\n6Note that the exponential backoff process used in 802.11 can be equiv-\\nalently modelled by such a sampling from a geometric distribution with an\\nappropriate p [18].\\n\\nWhen the arrival statistics are described in this manner, \\u03bb\\nis equivalent to the mean arrival rate considered in many well\\nknown results, such as [1] and [2] for S-ALOHA with MPR\\nor [5] and [17, \\u00a74.4] for CSMA on the collision channel. In\\nother words, our current setup facilitates direct and meaningful\\ncomparison of our results with those in classical multiple\\naccess theory. In particular, the maximum \\u03bb for which packets\\ncan be successfully transmitted by a multiaccess protocol\\non a channel with asymptotically \\ufb01nite average delay is the\\nchannel\\u2019s maximum achievable stable throughput with that\\nprotocol [17, \\u00a74.2.3].\\n\\nC. The MPR Channel Model and Examples\\n\\nWe employ the symmetric MPR channel model of [1], with\\nwhich the successful reception probabilities depend only on\\nthe number of packets transmitted in the slot. For the in\\ufb01nite\\npopulation scenario, given that n packets are transmitted, for\\n1 \\u2264 n \\u2264 \\u221e, 0 \\u2264 k \\u2264 n, let\\nCn,k = P [k packets are correctly received| n are transmitted].\\nClearly, the symmetric MPR channel model is a generalized\\nformulation and embodies as a special case the classical\\ncollision channel, which has C1,0 = 0 and Cn,0 = 1 for all\\nn > 1.\\n\\nWe denote the expected number of packets correctly re-\\n\\nceived from a transmission set of n STAs by\\n\\nCn (cid:2)\\n\\nkCn,k,\\n\\nn(cid:2)\\n\\nk=1\\n\\nC (cid:2) sup\\n\\nn\\n\\nCn,\\n\\nand assume that its limit C = limn\\u2192\\u221e Cn exists, which is\\nusually the case in practice [1]. For instance, it is natural\\nto expect C = 0 because practical PHY layers have \\ufb01nite\\nresources and hence cannot support an unbounded number of\\nsimultaneous transmissions. We de\\ufb01ne channel capacity to be\\n\\nnamely the largest expected successes with simultaneous trans-\\nmissions on a channel.\\nIn addition, we also assume that Cn is concave in n,\\na property possessed by reasonable MPR channels. To see\\nwhy, say we have n1 < n2 < arg supn Cn. Then it\\nis\\nunreasonable to expect Cn1 > Cn2 < C because, if the channel\\nis still capable of supporting more successful receptions even\\nwhen greater than n2 STAs transmit, then we should have\\nCn1 \\u2264 Cn2. Similarly, say arg supn Cn < n3 < n4, then we\\nshould have Cn3 \\u2265 Cn4, because the channel can only yield\\nfewer successes with an increasing number of transmitting\\nSTAs if there already are greater than arg supn Cn of them.\\nIt is possible for supn Cn to be achieved at more than one n,\\nbut with said assumption this must occur over one and only\\none consecutive set of n\\u2019s.\\n\\nIn sections below we discuss two speci\\ufb01c MPR channels\\nwe consider exemplary and refer the reader to [1] and [2]\\nfor additional ones. In the q-frequencies frequency-hopping\\nchannel, each STA chooses with equal probability one of q\\nfrequencies on which to transmit. If more than one STAs\\nchoose the same frequency, then their transmissions will fail.\\n\\n\\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\\n\\n269\\n\\nSuch a channel has Cn = n(1 \\u2212 1/q)n\\u22121 [1]. We will have\\nan equivalent channel model if orthogonal multiuser codes\\nare used instead of the q frequencies, i.e., STAs select one\\nof q codes to encode their transmissions, failure occurring\\nwhenever two or more STAs select the same code. Another\\nexample we consider is the N -user channel, which assumes\\nfailed reception when the transmission set is strictly greater\\nthan N . The expected success of this channel is simply Cn = n\\nfor n \\u2264 N and Cn = 0 for n > N . Note that the Cn\\u2019s of both\\nchannels are concave in n.\\n\\nis how well\\n\\nA meaningful performance measure of a multiaccess pro-\\ntocol\\nit utilizes a channel\\u2019s MPR capacity;\\naccordingly we de\\ufb01ne ef\\ufb01ciency to be the protocol\\u2019s maximum\\nstable throughput divided by C.\\n\\nIII. CAPACITY OF CSMA ON MPR CHANNELS\\n\\nA. Ergodicity Region of CSMA\\n\\nThere have been many results on the stability and dynamic\\ncontrol of CSMA, but they pertain to the collision channel\\n[17, \\u00a74.4] [19] [20]. Although they used different de\\ufb01nitions\\nof stochastic stability and attacked the problem with unique\\napproaches, they all concluded that CSMA with the collision\\nchannel is inherently unstable, which is expected from its\\ntraf\\ufb01c load-throughput curve (cf. [17, \\u00a74.2] and [5]). We\\nemploy instead the analytic framework used for S-ALOHA in\\n[1] and [2]:7 A system is de\\ufb01ned to be stable if the discrete-\\ntime Markov chain {Xt}t\\u22650, whose state is the number of\\nbacklogged packets in the system at the beginning of the tth\\nTP, is ergodic and unstable otherwise [17, \\u00a73A.5].\\nWe give the state transition probabilities of {Xt} in Ap-\\npendix A. We can see from them that {Xt} will be irreducible\\nand aperiodic as long as it satis\\ufb01es the suf\\ufb01cient condition\\nthat 0 < \\u02c6\\u03bb0 < 1, which we assume holds as it is true for all\\nreasonable scenarios.\\nTo obtain our \\ufb01rst main result, we examine the expected\\ndrift of the Markov chain {Xt} at state n, n \\u2265 0, which is\\ngiven by\\n\\ndn = E[Xt+1 \\u2212 Xt|Xt = n] = E[At \\u2212 \\u03a3t|Xt = n],\\n\\nif there is at\\n\\nwhere At and \\u03a3t are respectively the no. of new packets that\\narrived and the no. of successful transmissions during TP t.\\nObserve that the expected number of arrivals during a TP\\ndepends on whether there are arrivals during its idle slot\\nand whether any of the backlogged STAs decide to transmit\\nin the slot after it. Due to IFT,\\nleast one\\narrival in the idle slot, then the TP will consist of this idle\\nslot followed by a transmission, regardless of how many\\nbacklogged STAs also decide to transmit during this time too.\\nAnd of course, this situation also occurs even if the idle slot\\nhas no packet arrivals but at least one of the n backlogged\\nSTAs transmits, which occurs with probability 1 \\u2212 (1 \\u2212 p)n.\\nSince the expected number of arrivals during a slot and during\\na packet transmission are respectively \\u03c4 \\u03bb and \\u03bb, we have\\nE[At|Xt = n] = \\u03c4 \\u03bb + (1 \\u2212 \\u02c6\\u03bb0)\\u03bb + \\u02c6\\u03bb0[1 \\u2212 (1 \\u2212 p)n]\\u03bb\\n\\n= \\u03bb[1 + \\u03c4 \\u2212 \\u02c6\\u03bb0(1 \\u2212 p)n].\\n\\n7In homage to Ghez, Verd\\u00b4u and Schwartz,\\n\\nin adapting their analytic\\nframework of [1] and [2], we have kept many of their notations unchanged\\nor as similar as possible.\\n\\nTo \\ufb01nd \\u03a3t, observe that the STAs contributing to channel\\ncontention in the current TP are only those with packets that\\narrived during the idle slot and those that are retransmissions\\nfrom STAs backlogged at the start of this TP. As in the\\nderivation in [1], let Rt be the number of transmissions from\\nbacklogged STAs in TP t. Then\\n\\nP [\\u03a3t = k|Xt = n, \\u02c6At = i, Rt = j] = Ci+j,k,\\n\\nfor i \\u2265 0, 0 \\u2264 j \\u2264 n, 0 \\u2264 k \\u2264 i + j. With the convention that\\nC0,0 = 0, we have\\n\\nE[\\u03a3t|Xt = n, \\u02c6At = i, Rt = j] = Ci+j\\n\\nand hence get\\n\\nE[\\u03a3t|Xt = n] =\\n\\nn(cid:2)\\n\\nj=0\\n\\n\\u02c6\\u03bbi\\n\\nBn(j)Ci+j ,\\n\\n\\u221e(cid:2)\\n(cid:3)\\n(cid:4)\\n\\ni=0\\n\\nwhere we have let Bn(j) =\\ndn = \\u03bb(1 + \\u03c4 ) \\u2212 \\u03bb\\u02c6\\u03bb0(1 \\u2212 p)n \\u2212\\n\\nn\\nj\\n\\npj(1 \\u2212 p)n\\u2212j. Therefore,\\n\\u221e(cid:2)\\nBn(j)Ci+j .\\n\\nn(cid:2)\\n\\n\\u02c6\\u03bbi\\n\\n(2)\\n\\nThen by applying a result from [1], we arrive at the following\\nresult on the ergodicity region of CSMA.\\n\\ni=0\\n\\nj=0\\n\\nTheorem 1. A CSMA system is stable for all arrival distri-\\n1+\\u03c4 C,\\nbutions such that \\u03bb < 1\\nwhere C = limn\\u2192\\u221e Cn. (This also holds if C is in\\ufb01nite: if\\nlimn\\u2192\\u221e Cn = +\\u221e, then the system is always stable.)\\n\\n1+\\u03c4 C and is unstable for \\u03bb > 1\\n\\nProof: From (2) we can see that \\u22122\\u03bb\\u2212 n < dn < \\u03bb(1 +\\n\\u03c4 ), so |dn| is \\ufb01nite for n < \\u221e. Then we can use Lemma 1\\nof [1], which states that\\n\\n\\u221e(cid:2)\\n\\nn(cid:2)\\n\\n\\u02c6\\u03bbi\\n\\nlim\\nn\\u2192\\u221e\\n\\ni=0\\n\\nj=0\\n\\nBn(j)Ci+j = C,\\n\\nD(i) = \\u2212 i(cid:2)\\n\\nand see that the limit of equation (2) as n goes to in\\ufb01nity is\\n\\nn\\u2192\\u221e dn = \\u03bb(1 + \\u03c4 ) \\u2212 C.\\n\\nlim\\n\\nThen our result on the stable region follows by Pakes\\u2019 Lemma\\n(Theorem 2 of [21]).\\nTo obtain our result on the unstable region, we will verify\\nthat Kaplan\\u2019s condition [22] is satis\\ufb01ed provided that Cn <\\nL, n \\u2265 1, for some L \\u2208 (0,\\u221e). According to [23], this is\\nequivalent to showing the downward part of the drift,\\n\\nkPi,i\\u2212k,\\n\\n(3)\\n\\nis bounded below, as shown in Appendix B.\\n\\nk=1\\n\\n1\\n\\nBecause the ergodicity region in Theorem 1 is achieved with\\n1+\\u03c4 C is the maximum\\nan arbitrary transmission probability p,\\nstable throughput that CSMA can achieve with open-loop\\ncontrol. Denoting \\u03b7c,o to be CSMA\\u2019s open-loop throughput,\\n1+\\u03c4 C.\\nthen Theorem 1 states that \\u03b7c,o = 1\\nAnother implication of Theorem 1 is that, since C = 0 for\\nthe collision channel, the corresponding open-loop throughput\\nis then \\u03b7c,o = 0, which agrees with the known results\\nthat CSMA over the collision channel is inherently unstable\\nwithout resort to a control protocol. It is also revealing to\\n\\n1+\\u03c4 limn\\u2192\\u221e Cn = 1\\n\\n\\f270\\n\\nStation A\\n\\nStation B\\n\\nBoth packets\\n\\noverlapping here\\n\\nSignal\\n\\npropagation\\n\\ndelay\\n\\nFig. 2. Unfavorable interference can occur in S-ALOHA if signal propagation\\ndelay is not properly accounted for. Thus, in practice, S-ALOHA\\u2019s slot size\\nhas to be at least 1 + \\u03c4 time units. Note that, when compared with Fig. 1, the\\nonly difference in the channel activities is that CSMA\\u2019s idle slots are shorter.\\n\\nslots\\n\\ncompare \\u03b7c,o with the open-loop throughput for S-ALOHA\\ngiven in [1], which we will denote by \\u03b7a,o. Although [1] shows\\nthat stability for uncontrolled S-ALOHA is achieved as long\\nas \\u03bb < C, this does not mean S-ALOHA actually outperforms\\nCSMA by a factor of 1 + \\u03c4. This is because the network\\nmodel assumed in [1] hasn\\u2019t accounted for signal propagation\\ndelay. Certainly,\\nif one were to implement S-ALOHA in\\npractice, as illustrated in Fig. 2, propagation delay will destroy\\nthe synchronous assumption and detrimental interferences can\\noccur between packets. Thus, as Roberts originally proposed\\n[16], S-ALOHA\\u2019s slot size should have at least 1 + \\u03c4 time\\nunits. By applying the same derivations set forth in [1], one\\ncan extend their results to show that S-ALOHA with a slot\\n1+\\u03c4 C. This means S-ALOHA\\nsize of 1+\\u03c4 actually has \\u03b7a,o = 1\\nand CSMA perform identically with open-loop control. In\\nother words, Theorem 1 has the important implication that\\nCSMA\\u2019s extra capability to sense the channel affords no\\nadditional advantage for random multiple access when no\\ncontrol protocol is used; we\\u2019ll see below how this is different\\nwhen a control protocol is employed.\\n\\nB. Maximum Decentralized Stable Throughput of CSMA\\n\\nSimilar to the decentralized control strategies analyzed in\\n[2] and the references therein, we consider strategies in which\\nSTAs adjust their retransmission probability according to the\\nfeedback information they can obtain from the channel. These\\nschemes can be characterized in such a form:\\n\\npt = F (St)\\n\\nand St+1 = G(St, Zt),\\n\\n(4)\\n\\nwhere pt is the retransmission probability to be used in TP t,\\nSt is an estimate of the backlogged STAs Xt at the beginning\\nof TP t, and Zt is the feedback information at the end of TP\\nt.8 To proceed with the analysis, we represent this system by\\na discrete-time homogeneous Markov chain {Xt, St}t\\u22650, the\\nstate of which at time t is the pair {Xt, St}. This Markov chain\\nalso will be irreducible and aperiodic if the same suf\\ufb01cient\\ncondition previously stated for {Xt} is satis\\ufb01ed, which we\\nhenceforth assume to be the case.\\n\\nLet \\u03b7c,c be the maximum stable throughput achievable by\\nCSMA with decentralized closed-loop control. Toward \\ufb01nding\\n\\u03b7c,c, we will \\ufb01rst study the case when each STA knows\\nthe beginning of TP t and determine the optimal\\nXt at\\ncontrol function F \\u2217\\n(Xt) for it. To do that, we proceed by\\n\\n8See [2] for discussion on implementing such a closed-loop control.\\n\\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\\n\\nanalyzing the Markov chain {Xt} in Section III-A but with\\np = pt = F (Xt). This will then reveal the largest ergodicity\\nregion with decentralized control (4), and thus the highest\\npossible achievable stable throughput (cf.[2]).\\nTheorem 2. There exists a retransmission probability p\\u2217\\nn that\\nminimizes the expected drift, dn. With that p\\u2217\\nn the CSMA\\nsystem is stable for \\u03bb < \\u03b7c,c and unstable for \\u03bb > \\u03b7c,c, where\\n(cid:5)(cid:6)\\n\\n(cid:2)\\n\\n(cid:3)\\n\\n\\u221e(cid:4)\\n\\n\\u221e(cid:4)\\n\\n1\\n\\n1 + \\u03c4\\n\\nsup\\nx\\u22650\\n\\ne\\u2212x\\n\\n\\u02c6\\u03bb0\\u03bb+\\n\\nxn\\nn!\\n\\nn=0\\n\\nj=0\\n\\n\\u02c6\\u03bbjCn+j\\n\\n\\u03b7c,c = sup\\n\\n\\u03bb : \\u03bb <\\n\\n.\\n\\n(5)\\n\\nThe largest stable achievable throughput by any decentralized\\ncontrol algorithm of the form (4) for CSMA is \\u03b7c,c of (5).\\n\\ni=0\\n\\n\\u02c6\\u03bbi\\n\\n(cid:4)\\n\\n(cid:3)\\n\\n(cid:5)n\\n\\n(cid:5)\\u221e\\n\\nProof: We can write the expected drift equation (2)\\nas dn(p) = \\u03bb(1 + \\u03c4 ) \\u2212 Yn(p), where Yn(p) = \\u03bb\\u02c6\\u03bb0(1 \\u2212\\npj(1 \\u2212 p)n\\u2212jCi+j. Since Yn(p) is\\np)n +\\na polynomial on [0, 1], it attains a global maximum and there\\nexists a p\\u2217\\nn = arg maxp\\u2208[0,1]Yn(p) = arg minp\\u2208[0,1] dn(p); in\\nother words, there exists a retransmission probability p\\u2217\\nn that\\nminimizes the drift dn at state n.\\n\\nj=0\\n\\nn\\nj\\n\\nFollowing the same steps used in the proof of Theorem 1 of\\n[2], we can show that Yn(x/n) converges uniformly to Y (x)\\nfor x \\u2265 0, where\\n\\n(cid:7)\\n\\n\\u02c6\\u03bbjCn+j\\n\\n.\\n\\n(6)\\n\\nY (x) = e\\u2212x\\n\\n(cid:6)\\n\\u02c6\\u03bb0\\u03bb +\\n\\n\\u221e(cid:2)\\n\\n\\u221e(cid:2)\\n\\nxn\\nn!\\n\\nn=0\\n\\nj=0\\n\\nSo it follows that\\nn\\u2192\\u221e Yn(p\\u2217\\n\\nlim\\n\\nn) = lim\\n\\nn\\u2192\\u221e sup\\nx\\u22650\\n\\nYn(x/n) = sup\\nx\\u22650\\n\\nY (x).\\n\\nThe stable region speci\\ufb01ed by (5) follows by applying Pakes\\u2019\\nLemma [21, Theorem 2].\\n\\nTo obtain the unstable region, we can proceed as we did\\nin Theorem 1 but with pt = F (Xt) substituted for p. Since\\npt \\u2208 [0, 1], the result obtained there holds with said pt.\\nTo prove the second part of the theorem, we need to\\nshow that the {Xt, St} is non-ergodic with any control when\\n\\u03bb > \\u03b7c,c. The proof of this is essentially the same as that\\nfor Theorem 2 of [2], which gives the analogous result for\\nS-ALOHA. (Cf. [24] for such details.)\\n\\nThough \\u03b7c,c of (5) is derived by assuming the STAs have\\nperfect knowledge of Xt, \\u03b7c,c can also be achieved with\\na control with partial state information. In fact, by directly\\napplying the derivation in [2, \\u00a7III] to our CSMA framework\\nhere, we can show the same control they described for S-\\nALOHA \\u2014 a control that computes the backlogged estimate\\nSt from feedback information Zt, where Zt = 0 when TP t\\nis empty (contains no transmission) and Zt = 1 otherwise \\u2014\\ncan also achieve \\u03b7c,c.\\nBecause Y (x) is expressed in terms of the arrival proba-\\nbilities {\\u02c6\\u03bbn}n\\u22650, the expression for \\u03b7c,c given by (5) is an\\nimplicit equation of \\u03bb. Thus, unless the entire packet arrival\\nprobability distribution is speci\\ufb01ed, it is unclear whether there\\nexist solutions to (5) and we cannot draw more meaningful\\ngeneral conclusions from it. It turns out, however, that a\\nPoisson distribution will give a solution to (5), i.e., that the\\narrival per slot is Poisson distributed with parameter \\u03c4 \\u03bb . Since\\n\\n\\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\\n\\n271\\n\\nPoisson arrivals are also a \\ufb01tting \\u2014 if not the de facto \\u2014\\nstatistical model for packet generation in networks of large\\nnumbers of STAs, we assume henceforth that the packet arrival\\nper slot has such a probability distribution. Then,\\nCn+j\\n\\nY (x) = e\\u2212(x+\\u03c4 \\u03bb)\\n\\n\\u221e(cid:2)\\n\\n(cid:7)\\n\\n(cid:6)\\n\\u03bb +\\n(cid:6)\\n\\u03bb +\\n\\n\\u221e(cid:2)\\n\\u221e(cid:2)\\n\\nn=0\\n\\nn=1\\n\\nxn\\nn!\\nCn\\n\\n(\\u03c4 \\u03bb)j\\n(cid:7)\\nj!\\n\\n,\\n\\n(7)\\n\\nj=0\\n(x + \\u03c4 \\u03bb)n\\n\\nn!\\n\\n= e\\u2212(x+\\u03c4 \\u03bb)\\n\\nand hence,\\n(cid:8)\\n\\u03b7c,c =\\n\\u03bb : \\u03bb < 1\\n\\nsup\\n\\n1 + \\u03c4 sup\\nx\\u22650\\n\\ne\\u2212(x+\\u03c4 \\u03bb)\\n\\n(cid:6)\\n\\u03bb+\\n\\n\\u221e(cid:2)\\n\\nn=1\\n\\nCn\\n\\n(x + \\u03c4 \\u03bb)n\\n\\nn!\\n\\n(cid:7)(cid:9)\\n\\n,\\n\\n(8)\\n\\n(cid:10)\\n\\n(cid:11)\\n\\n\\u03bb : \\u03bb < 1\\n\\n1+\\u03c4 e\\u03bb\\u22121\\n\\nwhich readily makes way for further analysis.\\nFor example, under the collision channel model, Y (x) =\\ne\\u2212(x+\\u03c4 \\u03bb)[x + \\u03bb(1 + \\u03c4 )]. And supx\\u22650 Y (x) is then attained\\nwith x = 1 \\u2212 \\u03bb(1 + \\u03c4 ), so (8) reduces to the transcendental\\n. Solving numerically\\nequation \\u03b7c,c = sup\\nfor \\u03c4 = 0.01, we \\ufb01nd that \\u03b7c,c = 0.865 packets per unit\\ntime (packets/T ), which is equal to the corresponding value\\ncalculated from Kleinrock and Tobagi\\u2019s throughput expres-\\nsion for slotted non-persistent CSMA, i.e., equation (8) of\\n[5]. (Recall that the non-persistent CSMA is equivalent to\\nCSMA with IFT.) They also reported that as \\u03c4 \\u2192 0, CSMA\\ncould approach perfect (collision) channel utilization, or 100%\\nef\\ufb01ciency, which can be shown here as well. While usage of\\n(8) is probably limited to numerical solutions, an equivalent\\nclosed form expression can be obtained for Poisson arrivals:\\n\\nTheorem 3. For Poisson distributed packet arrival, the maxi-\\nmum achievable stable throughput of CSMA, \\u03b7c,c, is equiva-\\nlently given by both\\n\\n(cid:8)\\n\\u03bb : \\u03bb < 1\\n\\ne\\u2212x\\n\\n1 + \\u03c4 sup\\nx\\u22650\\n\\n(cid:7)(cid:9)\\n\\nCn\\n\\nxn\\nn!\\n\\n(9)\\n\\n\\u221e(cid:2)\\n\\nn=1\\n\\n(cid:6)\\n\\u03bb +\\n\\u221e(cid:2)\\n\\n1\\n\\ne\\u2212x\\n\\n1 + \\u03c4 \\u2212 e\\u2212x\\n\\n\\u03b7c,c = sup\\n(10)\\nx\\u22650\\n1+\\u03c4 limn\\u2192\\u221e Cn, then there exists a constant\\n1+\\u03c4 C = 1\\nIf \\u03b7c,c > 1\\nA > 0 such that the control pt = A/Xt for Xt > A yields\\nthe optimal throughput \\u03b7c,c.\\n\\nn=1\\n\\n.\\n\\nCn\\n\\nxn\\nn!\\n\\n(cid:5)\\u221e\\nn=1 Cn\\n\\nLet y(x) = e\\u2212x(\\u03bb+\\n\\nProof: Observe that by solving directly for \\u03bb from the\\ninequality in (9), which is an operation that is independent of\\nx, we can obtain the equivalent closed form expression for \\u03b7c,c\\nof (10). So, to prove the \\ufb01rst part of the theorem it remains\\nonly to show that (9) and (8) are equivalent.\\nxn\\nn! ). Then y(x+\\u03c4 \\u03bb) = Y (x);\\ni.e., Y (x) of (7) is a translation of y(x) by \\u2212\\u03c4 \\u03bb. (Recall that\\n\\u03c4 \\u2208 (0,\\u221e) and \\u03c4 \\u03bb \\u2265 0.) To obtain (9), we need to show that\\nsupx\\u22650 Y (x) = supx\\u22650 y(x) holds within the solution space\\nof the inequality \\u03bb < 1\\n1+\\u03c4 supx\\u22650 Y (x), and thus this solution\\nspace must then be identical to that of \\u03bb < 1\\n1+\\u03c4 supx\\u22650 y(x),\\nwith which (9) will follow by the de\\ufb01nition of \\u03b7c,c in (8).\\n\\nConsider \\ufb01rst the case in which y(x) does not achieve\\nits supremum. Then together with Property 5 of [2], we\\n\\n\\u03b7c,c = sup\\n\\nand\\n\\ncan also see that supx\\u22650 y(x) = limx\\u2192\\u221e y(x) = C. Since\\nY (x) = y(x + \\u03c4 \\u03bb), it follows that Y (x) will also not achieve\\nits supremum, and so for all \\u03c4 \\u2208 (0,\\u221e) and \\u03c4 \\u03bb \\u2265 0,\\nsupx\\u22650 y(x + \\u03c4 \\u03bb) = limx\\u2192\\u221e y(x + \\u03c4 \\u03bb) = C. Then for\\nall \\u03c4 \\u2208 (0,\\u221e) and \\u03c4 \\u03bb \\u2265 0, supx\\u22650 y(x) = supx\\u22650 Y (x).\\nTherefore, by the de\\ufb01nition of \\u03b7c,c in (8), we have \\u03b7c,c =\\n1+\\u03c4 supx\\u22650 y(x)}, as given by (9).\\nsup{\\u03bb : \\u03bb < 1\\nsome \\ufb01nite x0 \\u2265 0. Then for all \\u03bb \\u2208 [0, x0/\\u03c4 ],\\nY (x) = Y (xo \\u2212 \\u03c4 \\u03bb) = y(x0) = sup\\nx\\u22650\\n\\n(11)\\nAlso, for all x \\u2265 0, y(x) \\u2264 e\\u2212x\\u03bb+x. So, for all \\u03bb \\u2208 [0, x0/\\u03c4 ],\\n\\nNow consider the case in which supx\\u22650 y(x) = y(xo) at\\n\\ny(x).\\n\\nsup\\nx\\u22650\\n\\n1\\n1+\\u03c4 supx\\u22650 Y (x) =\\n\\u2264\\n\\u2264\\n1+\\u03c4\\n\\u2264 x0\\n\\u03c4 .\\n\\n1\\n\\n(cid:4)\\n\\n(cid:3)\\n1\\n1+\\u03c4 supx\\u22650 y(x)\\n(cid:3)\\n(cid:4)\\ne\\u2212x0\\u03bb + x0\\n1\\ne\\u2212x0 + \\u03c4\\n\\n1+\\u03c4\\n\\nx0\\n\\u03c4\\n\\nIt follows that for all \\u03bb \\u2208 [0,\\n1\\n1+\\u03c4 supx\\u22650 Y (x)], the identity\\nof (11) holds, which implies that the solution spaces of {\\u03bb :\\n1+\\u03c4 supx\\u22650 y(x)} are\\n\\u03bb < 1\\nidentical. Therefore, by the de\\ufb01nition of \\u03b7c,c in (8), \\u03b7c,c can\\nbe expressed equivalently by (9) for this case as well.\\n\\n1+\\u03c4 supx\\u22650 Y (x)} and {\\u03bb : \\u03bb < 1\\n\\nBy Theorem 3, if we have \\u03b7c,c = 1\\n\\nThe second part of this theorem can be proved by directly\\napplying the steps for the analogous result for S-ALOHA\\ngiven in the proof of Theorem 2 in [2].\\n1+\\u03c4 C, which occurs when\\nC = limn\\u2192\\u221e Cn = supn\\u22651 Cn, then open-loop control can\\nalready attain the maximum stable throughput, i.e., \\u03b7c,c = \\u03b7c,o;\\notherwise, closed-loop control with pt = A/Xt should be used\\nto achieve the optimal throughput \\u03b7c,c > \\u03b7c,o (cf. [2]).\\n\\nC. CSMA\\u2019s Throughput in Relation with S-ALOHA\\u2019s\\n\\nWe can straightforwardly adapt the derivation in [2] to\\nobtain S-ALOHA\\u2019s optimal closed-loop throughput for a slot\\nsize of 1 + \\u03c4 time units. Denoting said throughput by \\u03b7a,c,\\nsuch a derivation will yield\\n\\n\\u03b7a,c = sup\\nx\\u22650\\n\\ne\\u2212x\\n\\n1\\n\\n1 + \\u03c4\\n\\nCn\\n\\nxn\\nn!\\n\\n.\\n\\n(12)\\n\\n\\u221e(cid:2)\\n\\nn=1\\n\\n1\\n\\nxn\\nn!\\n\\ne\\u2212x\\n\\n1+\\u03c4\\u2212e\\u2212x\\n\\nturns out,\\n\\n(cid:5)\\u221e\\nn=1 Cn\\n\\nComparing (10) and (12), we see the only difference be-\\ntween closed-loop CSMA and S-ALOHA comes down to just\\n1+\\u03c4 \\u2208 (0, 1),\\na single \\u2212e\\u2212x term in the denominator. Since\\nwhenever sup0\\u22650\\nis achieved by an\\nx \\u2208 [0,\\u221e), due to said \\u2212e\\u2212x term, CSMA\\u2019s maximum\\nthroughput will always be higher than that of S-ALOHA.\\nBut as it\\nthis advantage will diminish as the\\nchannel supports more MPR. Though, before we can formally\\ndescribe this outcome, we need to de\\ufb01ne what is meant by\\nsupporting more MPR. Since a larger expected success for a\\ntransmission set corresponds to a better MPR capability for\\nthat set, accordingly, we can assert the following de\\ufb01nition.\\nDe\\ufb01nition 1 (MPR Strength): Consider two channels given\\nn }\\nrespectively by their expected transmission successes {C(1)\\nand {C(2)\\nn } has a\\nn }, n \\u2265 1. We say that the channel with {C(2)\\nn } if there\\nstronger MPR strength than the channel with {C(1)\\n\\n\\f272\\n\\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\\n\\nTHROUGHPUTS AND EFFICIENCIES OF S-ALOHA AND CSMA FOR q-ORTHOGONAL-CODES CHANNEL WITH PROPAGATION DELAY \\u03c4 = 0.01\\n\\nTABLE I\\n\\nNo. of codes (q)\\n\\nC\\n\\n\\u03b7c,c\\n\\n\\u03b7a,c\\n\\n1\\n2\\n3\\n4\\n5\\n10\\n\\n1.0000\\n1.0000\\n1.3333\\n1.6875\\n2.0480\\n3.8742\\n\\n0.8655\\n0.9652\\n1.1752\\n1.4895\\n1.8346\\n3.6425\\n\\n0.3642\\n0.7285\\n1.0927\\n1.4569\\n1.8212\\n3.6424\\n\\n\\u03b7c,c\\n\\nC\\n\\n0.8655\\n0.9652\\n0.8814\\n0.8826\\n0.8958\\n0.9402\\n\\n\\u03b7a,c\\n\\nC\\n\\n0.3642\\n0.7285\\n0.8195\\n0.8634\\n0.8893\\n0.9402\\n\\nxc\\n\\nxa\\n\\n0.1345\\n0.4865\\n2.1706\\n3.5994\\n4.8034\\n9.9955\\n\\n1.0000\\n2.0000\\n3.0000\\n4.0000\\n5.0000\\n10.0000\\n\\nn > C(1)\\n\\nn \\u2200n /\\u2208 N .\\n\\nexists a non-empty set N = {n : C(2)\\nn } and that\\nC(2)\\nn = C(1)\\nSince {Cn} directly determines the value of the summation\\nin (10) and (12), De\\ufb01nition 1 gives a suf\\ufb01cient condition\\nfor attaining greater throughput; i.e., \\u03b7c,c and \\u03b7a,c are in-\\ncreasing functions of MPR strength. Moreover, we can show\\na stronger MPR strength also leads to a greater x that\\nachieves the supremum in (10). For brevity, let \\u03a5(x,{Cn}) =\\nn! , where {Cn} denotes a set of Cn, n \\u2265 1.\\n1+\\u03c4\\u2212e\\u2212x\\nLemma 1. For all expected transmission success {C(1)\\nn } with\\nx1 = arg supx\\u22650 \\u03a5(x,{C(1)\\nn }) < \\u221e, there exists a {C(2)\\nn }\\nwith x2 = arg supx\\u22650 \\u03a5(x,{C(2)\\nn }) < \\u221e such that {C(2)\\nn }\\nhas stronger MPR strength than {C(1)\\n\\n(cid:5)\\u221e\\nn=1 Cn\\n\\ne\\u2212x\\n\\nxn\\n\\nn } and x2 > x1.\\n(cid:5)\\u221e\\nn=1 Cn\\n\\nThe proof is given in Appendix C. Note that an ana-\\nlogue to Lemma 1 for S-ALOHA can be stated by sub-\\nstituting \\u03a5(x,{Cn}) with \\u0393(x,{Cn}) = e\\u2212x\\nxn\\nn! .9\\nMoreover, it can be shown that arg supx\\u22650 \\u03a5(x,{Cn}) \\u2264\\narg supx\\u22650 \\u0393(x,{Cn}), with equality if and only if Cn = 0\\nfor all n. The relationship between CSMA and S-ALOHA is\\nfurther revealed by employing Lemma 1:\\n\\n1+\\u03c4\\n\\nTheorem 4. For Poisson distributed packet arrival, as the\\nchannel\\u2019s MPR strength becomes stronger, the maximum sta-\\nble throughput achievable by CSMA, \\u03b7c,c, approaches the\\nmaximum stable throughput achievable by S-ALOHA, \\u03b7a,c. In\\nthe limit as MPR strength becomes stronger, \\u03b7c,c = \\u03b7a,c and\\nthe two protocols both have ef\\ufb01ciency of 1.\\n\\nProof: If the MPR channel\\u2019s expected transmission suc-\\ncess {Cn} has limit C = supn\\u22651 Cn, then we know from the\\nproof of our Theorem 3 and Property 5 of [2], respectively,\\nthat the best that CSMA and S-ALOHA can achieve are\\ntheir open-loop throughputs, which are the same. Therefore,\\n1+\\u03c4 C to start with and the proof is\\n\\u03b7c,c = \\u03b7a,c = \\u03b7a,o = 1\\nalready complete for this case.\\nSo let us consider now only channels with C < supn\\u22651 Cn,\\nnamely those with a {Cn} such that \\u03a5(x,{Cn}) achieves\\nits supremum at some x \\u2208 [0,\\u221e). Consider a sequence\\nof expected transmission successes with increasing MPR\\nn }, . . .}. Let xi =\\nstrength {{C(i)\\narg supx\\u22650 \\u03a5(x,{C(i)\\na,c to be the re-\\nspective maximum stable throughput of CSMA and S-ALOHA\\nn }.\\nfor channel {C(i)\\n\\nn },{C(2)\\nn }). Denote \\u03b7(i)\\n\\nn },{C(3)\\nc,c and \\u03b7(i)\\n\\nn }}i\\u22651= {{C(1)\\n\\n9This is because, apparent\\n\\nfrom Appendix C, d\\u0393(x0,{Cn})/dx =\\n\\u2212\\u0393(x,{Cn})+C(x, {Cn}), so \\u0393(x, {Cn}) has identities similar to (16) and\\n(17). Note that both d\\u03a5(x, {Cn})/dx and d\\u0393(x, {Cn})/dx are linear ODEs.\\n\\nTHROUGHPUTS AND EFFICIENCIES OF S-ALOHA AND CSMA FOR THE\\n\\nN -USER CHANNEL WITH PROPAGATION DELAY \\u03c4 = 0.01\\n\\nTABLE II\\n\\nC = N\\n\\n\\u03b7c,c\\n\\n\\u03b7a,c\\n\\n1\\n2\\n3\\n4\\n5\\n10\\n\\n0.8655\\n1.1541\\n1.5570\\n2.0455\\n2.5916\\n5.7775\\n\\n0.3642\\n0.8316\\n1.3575\\n1.9231\\n2.5184\\n5.7737\\n\\n\\u03b7c,c\\n\\nC\\n\\n0.8655\\n0.5770\\n0.5190\\n0.5114\\n0.5183\\n0.5778\\n\\n\\u03b7a,c\\n\\nC\\n\\n0.3642\\n0.4158\\n0.4525\\n0.4808\\n0.5037\\n0.5774\\n\\nxc\\n\\nxa\\n\\n0.1345\\n0.8097\\n1.7735\\n2.6496\\n3.4654\\n7.2872\\n\\n1.0000\\n1.6180\\n2.2695\\n2.9452\\n3.6395\\n7.2970\\n\\n1\\n\\n(cid:5)\\u221e\\nn=1 C(i)\\n\\nc,c \\u2264\\nFrom (10) and (12) we can see an upper bound: \\u03b7(i)\\n1+\\u03c4\\u2212e\\u2212xi supx\\u22650 e\\u2212x\\n\\u03b7(i)\\na,c. Be-\\ncause e\\u2212x > 0 for all x \\u2208 [0,\\u221e), we also have a lower bound\\na,c, with equality if and only if i = 1 and C(1)\\nof \\u03b7(i)\\nn = 0\\nfor all n. Stated equivalently, if we let \\u03b3i = 1+\\u03c4\\n1+\\u03c4\\u2212e\\u2212xi , then\\n\\nc,c \\u2265 \\u03b7(i)\\n\\n1+\\u03c4\\u2212e\\u2212xi\\n\\nxn\\nn! =\\n\\n1+\\u03c4\\n\\nn\\n\\n\\u03b7(i)\\na,c < \\u03b7(i)\\n\\nc,c \\u2264 \\u03b3i\\u03b7(i)\\n\\na,c\\n\\nfor all i > 1.\\n\\n(13)\\n\\nn\\n\\nn\\n\\n<\\n\\n1+\\u03c4\\n\\n1+\\u03c4\\n\\nn = max{C(j)\\n\\nn }}i\\u22651 with C(j)\\n\\n} is constructed from {C(i)\\n\\nBy our de\\ufb01nition of stronger MPR strength, given any\\nn } in our sequence {{C(i)\\nn }}i\\u22651, there must exist a {C(j)\\nn },\\n{C(i)\\nn } = n for all\\nj \\u2265 i, in {{C(i)\\nn \\u2264 (cid:8)xi + 1(cid:9), where (cid:8)xi + 1(cid:9) denotes the largest integer less\\nthan or equal to xi + 1. Thereafter in the sequence, {C(j+1)\\n}\\nmust satisfy the construction method given in the proof of\\nLemma 1, as if {C(j+1)\\nn } with that\\nmethod. So, by Lemma 1 we can construct from {xi}i\\u22651 a\\nsubsequence {\\u02c6xk}k\\u22651, with \\u02c6xk+1 > \\u02c6xk, and by our de\\ufb01nition\\nof higher MPR strength there does not exist a subsequence in\\n{xi}i\\u22651 that is constant or strictly decreasing. Then because\\n1+\\u03c4\\u2212e\\u2212\\u02c6xk for all k, we have limi\\u2192\\u221e \\u03b3i = 1+,\\n1+\\u03c4\\u2212e\\u2212\\u02c6xk+1\\ni.e., that {\\u03b3i}i\\u22651 is approaching 1 from above. Therefore,\\nalong with (13), as the MPR strength becomes stronger with\\neach i, \\u03b7(i)\\nFinally, in the limit as MPR strength increases, we have the\\nideal MPR channel that has Cn = n for all n and channel\\ncapacity C = \\u221e. Accordingly we then have C = \\u221e, with\\nwhich \\u03b7c,c = \\u03b7a,c = \\u03b7a,o = \\u221e and ef\\ufb01ciency is \\u03b7c,c/C = 1.\\nTheorem 4 essentially shows that as the MPR strength\\nbecomes stronger, we can perform equally well without carrier\\nsensing by simply accessing the channel with random schedul-\\ning \\u2014 i.e., closed-loop S-ALOHA. And then when the MPR\\nstrength is suf\\ufb01ciently strong, in lieu of scheduling, STAs\\ncould even transmit at any slot and achieve the same through-\\nput performance by relying solely on the PHY layer as the\\nmeans for separating the STAs\\u2019 transmissions. This conclusion\\nregarding when MAC-layer scheduling becomes unnecessary\\nby virtue of the PHY layer\\u2019s MPR strength has been pointed\\n\\nc,c is approaching \\u03b7(i)\\n\\na,c from above.\\n\\n\\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\\n\\n273\\n\\nCSMA\\nS\\u2212ALOHA\\nChannel capacity\\n\\u03c4 = 0\\n\\u03c4 = 0.1\\n\\u03c4 = 0.5\\n\\u03c4 = 1.0\\n\\u03c4 = 10\\n\\n4\\n\\n3.5\\n\\n3\\n\\n2.5\\n\\n2\\n\\n1.5\\n\\n1\\n\\n0.5\\n\\n)\\ne\\nm\\n\\ni\\nt\\n \\nt\\ni\\nn\\nu\\n\\n \\nr\\ne\\np\\n\\n \\ns\\nt\\ne\\nk\\nc\\na\\np\\n(\\n \\nt\\nu\\np\\nh\\ng\\nu\\no\\nr\\nh\\nt\\n \\ne\\nl\\nb\\na\\nt\\ns\\n \\n\\nm\\nu\\nm\\ni\\nx\\na\\nM\\n\\n0\\n\\n \\n1\\n\\n2\\n\\n3\\n\\n4\\n\\n7\\nNo. of orthogonal multiuser codes (q)\\n\\n5\\n\\n6\\n\\n \\n\\n10\\n\\n \\n\\n)\\ne\\nm\\n\\ni\\nt\\n \\nt\\ni\\nn\\nu\\n\\n \\nr\\ne\\np\\n\\n \\ns\\nt\\ne\\nk\\nc\\na\\np\\n(\\n \\nt\\nu\\np\\nh\\ng\\nu\\no\\nr\\nh\\nt\\n \\ne\\nl\\nb\\na\\nt\\ns\\n \\n\\nm\\nu\\nm\\ni\\nx\\na\\nM\\n\\n9\\n\\n8\\n\\n7\\n\\n6\\n\\n5\\n\\n4\\n\\n3\\n\\n2\\n\\n1\\n\\n0\\n\\n \\n1\\n\\n8\\n\\n9\\n\\n10\\n\\nCSMA\\nS\\u2212ALOHA\\nChannel capacity\\n\\u03c4 = 0\\n\\u03c4 = 0.1\\n\\u03c4 = 0.5\\n\\u03c4 = 1.0\\n\\u03c4 = 10\\n\\n2\\n\\n3\\n\\n4\\n\\n5\\n\\n6\\n\\n7\\n\\n8\\n\\n9\\n\\n10\\n\\nNo. of supported users (N)\\n\\nFig. 3. Maximum stable throughput of CSMA and S-ALOHA for the q-\\northogonal codes MPR channel with various propagation delays (\\u03c4 ). The\\nchannel\\u2019s MPR capacity is displayed for comparison. As in Figs. 4\\u20136, note\\nalso the overall throughput-lowering effect of \\u03c4 .\\n\\nFig. 5. Maximum stable throughput of CSMA and S-ALOHA for the N-\\nuser MPR channel with various propagation delays (\\u03c4 ). The channel\\u2019s MPR\\ncapacity is also displayed for comparison.\\n\\n1\\n\\n0.9\\n\\n0.8\\n\\n0.7\\n\\n0.6\\n\\n0.5\\n\\n0.4\\n\\n0.3\\n\\n0.2\\n\\n0.1\\n\\ny\\nc\\nn\\ne\\ni\\nc\\ni\\nf\\nf\\nE\\n\\n0\\n\\n \\n1\\n\\n2\\n\\n3\\n\\n4\\n\\n7\\nNo. of orthogonal multiuser codes (q)\\n\\n5\\n\\n6\\n\\n \\n\\nCSMA\\nS\\u2212ALOHA\\nChannel capacity/q\\n\\u03c4 = 0\\n\\u03c4 = 0.1\\n\\u03c4 = 0.5\\n\\u03c4 = 1.0\\n\\u03c4 = 10\\n\\n8\\n\\n9\\n\\n10\\n\\ny\\nc\\nn\\ne\\ni\\nc\\ni\\nf\\nf\\nE\\n\\n1\\n\\n0.9\\n\\n0.8\\n\\n0.7\\n\\n0.6\\n\\n0.5\\n\\n0.4\\n\\n0.3\\n\\n0.2\\n\\n0.1\\n\\n0\\n\\n \\n1\\n\\n \\n\\nCSMA\\nS\\u2212ALOHA\\nChannel capacity/N\\n\\u03c4 = 0\\n\\u03c4 = 0.1\\n\\u03c4 = 0.5\\n\\u03c4 = 1.0\\n\\u03c4 = 10\\n\\n10\\n\\n20\\n\\n30\\n\\n40\\n\\n50\\n\\n60\\n\\n70\\n\\n80\\n\\n90\\n\\n100\\n\\nNo. of supported users (N)\\n\\nFig. 4. Ef\\ufb01ciency of CSMA and S-ALOHA for the q-orthogonal codes MPR\\nchannel with various propagation delays (\\u03c4 ). The channel\\u2019s MPR capacity\\nnormalized by q is also displayed for comparison.\\n\\nFig. 6. Ef\\ufb01ciency of CSMA and S-ALOHA for the N-user MPR channel\\nwith various propagation delays (\\u03c4 ). The channel\\u2019s MPR capacity normalized\\nby N is also displayed for comparison. Note that the horizontal scale here\\nis different from that of Fig. 5 in order to show the relative growth of the\\nef\\ufb01ciency curves.\\n\\nout [25]. An additional insight herein and implicit in [2] is\\nthe juncture that occurs, i.e., when closed-loop control is \\ufb01rst\\nrendered unnecessary and open-loop control alone suf\\ufb01ces, is\\nwhen the MPR channel has C = lim supn\\u22651 Cn = C (cf. [24]).\\nTo illustrate the results in our discussion thus far, we\\nplot \\u03b7c,c, \\u03b7a,c and their ef\\ufb01ciencies in Figs. 3\\u20136 for the\\nq-orthogonal-codes and N -user MPR channels. These val-\\nues and the x\\u2019s that attain them are also given in Ta-\\nbles I\\u2013II, where xc = arg supx\\u22650 \\u03a5(x,{Cn}) and xa =\\narg supx\\u22650 \\u0393(x,{Cn}).\\nObserve that the N -user channel has N = {N} at each\\nincrement in channel capacity; so, its MPR strength is be-\\ncoming stronger. The same is true for the q-orthogonal-codes\\nchannel, which has N = {n : n \\u2265 1} at each q because\\nC(q+1)\\nn , \\u2200n \\u2265 1. But\\nn\\nwhile their associated throughputs are increasing with channel\\n\\nq+1 )n\\u22121 > n(1\\u2212 1\\n\\nq )n\\u22121 = C(q)\\n\\n= n(1\\u2212 1\\n\\n1\\n\\ncapacity, they also settle into linear growths in Figs. 3 and 5.\\nActually, this is expected for the q-orthogonal-codes channel,\\n1+\\u03c4 qe\\u22121 [2] and so its growth has a constant\\nsince \\u03b7a,c = 1\\n1+\\u03c4 e\\u22121. And, an approximately linear growth for\\nslope of\\nthe N -user channel has been predicted by [26], wherein\\nN ln N and N \\u2212 \\u221a\\nthroughputs of random access protocols for said channel are\\n\\u221a\\nN when N is\\nN are o(N ) when N is large,\\nlarge. Because\\nthis channel\\u2019s \\u03b7a,c will eventually be growing approximately\\nlinearly at a small positive slope.\\n\\nbounded between N \\u2212 \\u221a\\n\\n\\u221a\\nN ln N and\\n\\nThese throughputs\\u2019 linear asymptotic growth trends are\\nas well re\\ufb02ected in Figs. 4 and 6, where the associated\\nef\\ufb01ciencies become nearly constant with MPR strength. This\\ntoo is expected for the q-orthogonal-codes channel, since\\nq ) \\u2192 e\\u22121/q at large q, it can be easily shown that\\n(1 \\u2212 1\\n\\n\\f274\\n\\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\\n\\nC \\u2192 qe\\u22121 at large q (as con\\ufb01rmed by the normalized capacity\\nin Fig. 4); thus, its ef\\ufb01ciency evolves into \\u223c 1\\n1+\\u03c4 at large q. As\\n\\u03b7a,c/N is bounded between 1 \\u2212(cid:12)\\nfor the N -user MPR channel, said trend is due to the fact that\\n1/N\\n\\n(ln N )/N and 1 \\u2212(cid:12)\\n\\nat large N , where both increase at a slow rate.\\n\\nInterestingly, while S-ALOHA\\u2019s ef\\ufb01ciency always rises\\nfrom below, CSMA\\u2019s ef\\ufb01ciency may initially reach a local\\nmaximum \\u2014 even as high as 1 when \\u03c4 is small for some\\nchannels \\u2014 before tapering off to approach S-ALOHA\\u2019s.\\nThis perhaps unintuitive effect can be shown from (15). For\\ninstance, as long as supn\\u22651 Cn \\u2264 C1, ef\\ufb01ciency can be\\nmaintained at or increase toward 1 (cf. Fig. 4). And even after\\nsaid local maximum, CSMA\\u2019s ef\\ufb01ciency (and throughput) can\\nstill be considerably higher than S-ALOHA\\u2019s. This indicates\\nCSMA can be much more ef\\ufb01cient than S-ALOHA at utilizing\\nthe MPR capability in the region where the SU channel is just\\nbeginning to evolve into a MU one. We discuss in Section\\nIV how this region is an important one to consider because\\nresources for enabling more MPR can be scarce in practice.\\n\\nD. Connection to Results from Classical Multiaccess Theory\\n\\n1\\n\\n(cid:5)\\u221e\\nalternative\\nn=1 Cn\\n\\nxn\\nn!\\n\\nis\\ni.e.,\\n\\nthe\\n\\nis\\n\\ninterpretation\\n\\nequivalent\\nsupremum of\\n\\nthat\\nAn\\n\\u03c4 supx\\u22650 e\\u2212x\\nto\\n\\u03c4 supX\\u223cP oiss(x),x\\u22650 E[CX ],\\n1\\nthe\\nexpectation of CX over all X, where X is a Poisson\\ndistributed random variable with mean x [2]. Because\\neach TP for S-ALOHA is 1 + \\u03c4, be it idle or not, (12)\\ncan be explained by said interpretation via renewal theory\\narguments.10 This applies to CSMA too: Due to the bene\\ufb01ts of\\nchannel sensing, its difference from S-ALOHA is that an idle\\nslot lasts only \\u03c4 time units, so the TP for CSMA has expected\\nvalue of (1 + \\u03c4 )P [X > 0] + \\u03c4 P [X = 0] = 1 + \\u03c4 \\u2212 e\\u2212x,\\nwhich is re\\ufb02ected in (10).\\n\\nAnother perspective on CSMA\\u2019s diminishing throughput\\ngain also follows. As the MPR strength becomes stronger,\\nSTAs can then transmit at any slot and have a lower chance of\\ncollision; thus, there are fewer idle slots. This is con\\ufb01rmed by\\nxc and xa both increasing with MPR strength, i.e., P [X = 0]\\nis decreasing. When channel activities are viewed solely as a\\nrenewal process, the only difference between CSMA and S-\\nALOHA is that the former has shorter idle slots, and so, if idle\\nslots are becoming fewer, then the TPs for both protocols must\\nbe approaching the same duration; ergo, the same throughput.\\nFinally, note that X, the number of transmission attempts\\nin each slot, is actually the overall offered network traf\\ufb01c, i.e.,\\nthe aggregate of both new and backlogged traf\\ufb01c. That\\u2019s why\\nour \\u03b7c,c value for the collision channel is the same as that from\\nKleinrock and Tobagi [5] despite the fact that their derivation,\\nlike many multiaccess research of that era, hinges on the\\n\\ufb02awed assumption [2] [17, \\u00a74.2.2] that the network\\u2019s offered\\ntraf\\ufb01c is approximately Poisson distributed. Note that this is\\nalso true for the CSMA with MPR throughputs calculated\\nfrom Gau\\u2019s equation (5) of [14], which actually has the same\\nPoisson traf\\ufb01c assumption.\\n\\n10By renewal theory arguments, throughput (as measured in units of packets\\nper unit time) is the expected duration of successful attempts divided by\\nthe expected duration of the transmission period (i.e., renewal cycle), and\\nmultiplied by the expected number of packets in each successful attempt.\\n\\nIV. APPLYING MPR IN PRACTICE AND PERFORMANCE OF\\n\\n802.11 WLANS WITH MU-MIMO\\n\\nA. Insights for Practical Designs of MPR-enabled Networks\\nPerhaps not emphasized enough in MPR multiaccess re-\\nsearch is the unstated assumption that even as more simulta-\\nneously transmitted packets can be successfully received, the\\npacket\\u2019s data rate has to be maintained at some minimum level\\nin order to achieve actual increase in network throughput. In\\nother words, we cannot examine solely the improvement on\\nmultiaccess throughput expressed in packets per unit time; we\\nneed to also consider whether and how much the packet\\u2019s data\\nrate has been sacri\\ufb01ced by the diverting of channel resources to\\nsupport MU capability. Simply put, if we denote r1 and \\u03b71 to\\nbe the respective data rate (in bits per packet) and multiaccess\\nthroughput (in packets per unit time) for a PHY layer, and\\nr2 and \\u03b72 for those of another PHY layer with stronger MPR\\nstrength, then, even though \\u03b72 > \\u03b71, we still need\\n\\n\\u03b72/\\u03b71 > r1/r2\\n\\n(14)\\n\\nin order for the latter PHY layer to deliver a higher network\\nthroughput of \\u03b72r2, in bits per unit time.\\n\\nThe basis for MU capability is to exploit resources in the\\nchannel that provide orthogonal properties to support MPR.\\nUltimately, this is equivalent to \\ufb01nding what is known as\\ndegrees of freedom (DoF) from the channel to multiplex data\\nstreams [3, \\u00a71]. The design criteria that we describe here is:\\nA resource that gives rise to new DoF should be used to\\nincrease MU capability when (14) can be satis\\ufb01ed; otherwise,\\nthe network throughput can be made higher by applying the\\nresource to instead increase the data rate of each packet.\\n\\nB. WLAN Design Constraints and Advantages of MU-MIMO\\nMIMO signaling with multiple antennas exploits the spatial\\ndiversity \\u201cresource\\u201d in multipaths of a wireless channel to\\ngenerate DoF that can be used for boosting a point-to-point\\nlink\\u2019s spectral ef\\ufb01ciency or robustness. Because of indepen-\\ndent fading statistics among users\\u2019 propagation paths, MU\\ndiversity also exists as a resource for creating DoF to multiplex\\nMU data streams [27]. The challenge in designing MIMO\\nsystems centers on balancing the trade-offs among said various\\ngains with the available DoF.\\n\\nWhile MIMO spatial multiplexing of additional data\\nstreams increases data rates linearly, the SNR required to\\nrobustly receive them also grows noticeably. In fact, a cur-\\nrently impractical level of SNR is required to receive just a\\nfew spatial streams signaled at high orders of modulation and\\ncoding rates [28, \\u00a75.3]. Contrastingly, indoor measurements\\nshow MU-MIMO can achieve considerably higher spectral\\nef\\ufb01ciencies than SU-MIMO for the same SNR and number of\\nreceive antennas per user [29]\\u2013[30]. This implies that, as SNR\\nand number of receive antennas are typical WLAN design\\nconstraints,\\nthe extra DoF obtained from adding transmit\\nantennas should be applied on MU multiplexing rather than on\\nraising the level of a SU\\u2019s spatial multiplexing toward levels\\nthat the system cannot sustain robustly. And since a PHY layer\\nthat uses these new DoF to improve its SU data rate cannot\\npractically do so below a certain SNR, when this PHY layer is\\ncompared to another that instead diverts these DoF to increase\\n\\n\\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\\n\\n275\\n\\n)\\ns\\np\\nb\\nG\\n\\n(\\n \\nt\\nu\\np\\nh\\ng\\nu\\no\\nr\\nh\\nt\\n \\nk\\nr\\no\\nw\\nt\\ne\\nn\\n \\ne\\nt\\na\\ng\\ne\\nr\\ng\\ng\\nA\\n\\n4\\n\\n3.5\\n\\n3\\n\\n2.5\\n\\n2\\n\\n1.5\\n\\n1\\n\\n0.5\\n\\n0\\n\\n \\n1\\n\\n11n A\\u2212MPDU limit\\n8 x 11n A\\u2212MPDU limit\\n1 s.s. per user\\n2 s.s. per user\\n3 s.s. per user\\n4 s.s. per user\\n\\n \\n\\n2\\n\\n3\\n\\n4\\n\\n5\\n\\n6\\n\\n7\\n\\n8\\n\\nNo. of MU\\u2212MIMO users (M)\\n\\ny\\nc\\nn\\ne\\ni\\nc\\ni\\nf\\nf\\nE\\n\\n1\\n\\n0.9\\n\\n0.8\\n\\n0.7\\n\\n0.6\\n\\n0.5\\n\\n0.4\\n\\n0.3\\n\\n0.2\\n\\n \\n1\\n\\n \\n\\n11n A\\u2212MPDU limit\\n8 x 11n A\\u2212MPDU limit\\n1 s.s. per user\\n2 s.s. per user\\n3 s.s. per user\\n4 s.s. per user\\n\\n2\\n\\n3\\n\\n4\\n\\n5\\n\\n6\\n\\n7\\n\\n8\\n\\nNo. of MU\\u2212MIMO users (M)\\n\\nFig. 7. Aggregate network throughput of the proposed 802.11ac WLAN\\nfor 1\\u20134 spatial streams (s.s.) per user. As in Fig. 8, the A-MPDU size limits\\nconsidered are 65 KB and 520 KB, which are, respectively, the maximum\\nde\\ufb01ned in 802.11n and eight times of that; note that larger sizes do not show\\nchanges to the trends. 802.11ac proposes to support up to four MU-MIMO\\nusers, where each user can have up to 4 s.s. for a system maximum of 8 s.s.\\n802.11ac has a maximum aggregate throughput of at least 1 Gbps.\\n\\nA SELECTION OF DATA RATES FOR AN 80-MHZ 802.11AC OFDM\\n\\nTABLE III\\n\\nSYMBOL WITH SHORT GUARD INTERVAL (400 NS) [11]\\n\\nNo. of\\n\\nModulation\\n\\nspatial streams\\n\\n1\\n1\\n2\\n3\\n4\\n\\nBPSK\\n\\n64-QAM\\n64-QAM\\n64-QAM\\n64-QAM\\n\\nCode\\nrate\\n\\n1/2\\n5/6\\n5/6\\n5/6\\n5/6\\n\\nSpectral ef\\ufb01ciency\\n\\n(Mb/s/Hz)\\n\\n0.40625\\n4.0625\\n8.125\\n12.1875\\n16.25\\n\\nData rate\\n(Mbps)\\n\\n32.5\\n325.0\\n650.0\\n975.0\\n1300.0\\n\\nthe system\\u2019s MU capacity, we can also expect (14) to likely\\nbe satis\\ufb01ed. Thus, MU diversity can be an effective resource\\nfor realizing throughput gains from MPR in current WLANs.\\nLastly, we note that \\ufb01nding new channel resources to\\nenhance MPR can become progressively dif\\ufb01cult because of\\npractical issues. For instance, the number of antennas is a\\npotential constraint due to space limitations and costs. Also,\\nthe maximum transmit power allowable by regulatory rules is a\\nconstraint on the power density per spatial stream, limiting the\\nachievable level of MU multiplexing. Consequently, although\\nthe throughput gain with the next generation of WLANs\\npromises to be rewarding, the increment in MPR capacity will\\nonly be moderate, not dramatic.\\n\\nC. Performance Results and Enhancements for MU-based\\n802.11ac WLANs\\n\\nTo see the bene\\ufb01ts from applying MPR to CSMA wireless\\nnetworks in practice, we have simulated the performance of\\nWLANs based on the initial draft text (version D0.1) [11] pro-\\nposed for the 802.11ac standard.11 While this standardization\\n\\n11The particular parameters we took from D0.1 have not been changed in\\nD4.0, the latest and nearly \\ufb01nal draft version at this paper\\u2019s press time (Nov.\\n2012).\\n\\nFig. 8.\\nEf\\ufb01ciency of the proposed 802.11ac WLAN in the infrastructure\\nmode. The decrease in ef\\ufb01ciency with M indicates the current 802.11 SU-\\noriented MAC cannot fully utilize the PHY layer\\u2019s MU capacity.\\n\\neffort is still ongoing and industry dynamics are dif\\ufb01cult to\\npredict, our results provide the best means for speculating at\\npresent about how the \\ufb01nalized speci\\ufb01cation may perform.\\n\\nThe plan for 802.11ac to perform MU-MIMO is to extend\\nthe SU-MIMO framework of 802.11n. As a result, the funda-\\nmental components in the 802.11n PHY layer are adopted.\\nTable III lists the 80-MHz data rates from [11] that we\\nsimulated. Details of our simulation framework are explained\\nin Table IV. Of note is that 802.11ac has adapted the same\\nMAC backoff policy as 802.11n. And since this policy\\u2019s\\nparameters are originally designed for a SU PHY layer, the\\nsimulation results represent those of a SU-oriented MAC layer.\\nIn Figs. 7-8 we plot the network throughput and ef\\ufb01ciency\\nfor the described framework. Fig. 7 shows that MU-MIMO\\ncan offer signi\\ufb01cant increase in network throughput. However,\\nthese throughputs exhibit a ceiling, and hence the corre-\\nsponding ef\\ufb01ciencies in Fig. 8 also show a gradual decrease\\nwith M . To remedy this effect, we extend the maximum A-\\nMPDU size to 8 times that of the 802.11n limits. This would\\nmitigate the degradation on the ratio of preamble overhead to\\npayload duration as the packet\\u2019s data rate increases. But while\\nthis method improves performances, which are also plotted\\nin Figs. 7-8,\\nthe downward trend in ef\\ufb01ciencies persists.\\nEvidently such performances are those of a MAC layer that\\nis not optimized for its underlying PHY layers; otherwise,\\nas discussed in Section III, the throughputs will unboundedly\\nscale with MU capacity. Note that we have found the general\\ntrends displayed of the plots in Figs. 7-8 remain unchanged\\nwhen the number of clients in the network is varied.\\n\\nThese results clearly indicate that the current SU-oriented\\nMAC layer in 802.11 cannot fully utilize the PHY layer\\u2019s MU\\ncapacity. As expected from what we pointed out in Section III,\\nwhen the MU capacity increases, the number of idle slots has\\nto correspondingly decrease to achieve the optimal throughput.\\nThus, the fundamentals for 802.11ac can be enhanced with\\nan appropriate cross-layer design approach, in particular, by\\napplying the theory of CSMA with MPR that we discussed.\\n\\n\\f276\\n\\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\\n\\nDETAILS OF OUR 802.11AC WLAN SIMULATION FRAMEWORK\\n\\nTABLE IV\\n\\nSimulation parameter\\n\\nValue\\n\\nRemarks\\n\\nOperating mode\\n\\nNo. of AP\\n\\nNo. of clients\\n\\nInfrastructure\\n\\nmode\\n\\n1\\n29\\n\\nNo. of simultaneous\\n\\ntransmissions\\n\\nDownlink: M\\nUplink: 1 to M\\n\\nChannel width and PHY data\\n\\nSee Table III\\n\\nrates\\n\\nPHY header duration\\n\\nNo. of LTFs in preamble\\n\\n16 \\u03bcs\\n\\nDepends on\\nno. of spatial\\nstreams, per\\n\\n[11]\\n\\nDownlink and uplink transmissions cannot concurrently coexist; i.e., when STA(s) transmit together\\nwith the AP, none of their frames are correctly received.\\nAP transmissions to the clients are called downlink [6].\\nClient transmissions to the AP are called uplink [6].\\nM is the maximum no. of simultaneous transmissions allowable by the MU-MIMO PHY layer. Note\\nthat, unlike in our simulations, TGac has ultimately decided to de\\ufb01ne only downlink MU-MIMO in\\nthe current 802.11ac standard, despite early proposals to also adapt uplink MU-MIMO and leaving\\nthis for potential consideration in future amendments.\\nOnly those signaled by 64-QAM at rate 5/6 are used here. Each client\\u2019s link has the same data rate.\\nSNR is assumed suf\\ufb01cient enough for a negligible PER.\\nThis is based on the header structure proposed in [11], i.e., the SIG \\ufb01elds.\\nThis is necessary for receivers to estimate the MIMO channel properly (cf. 802.11n [6]). These Long\\nTraining Fields (LTFs) are those proposed in [11].\\n\\nMAC backoff policy\\n\\nAs in 802.11n\\n\\nRTS-CTS frame exchange\\n\\nTXOP duration\\n\\nFrame aggregation\\n\\nEnforced for\\nall TXOPs\\n3.008 ms\\n\\nEnforced for\\nall data frames\\n\\nMPDUs per A-MPDU\\n\\n64\\n\\nA-MPDU size\\n\\nAcknowledgement (ACK)\\n\\npolicy\\n\\n65 535 bytes\\nImplicit and\\nCompressed\\nBlockACK\\n\\nCSI feedback or channel\\n\\nNot included\\n\\nsounding\\n\\n802.11ac has adapted essentially the same backoff policy as in 802.11n. Note that these parameters\\nwere designed for a SU-oriented PHY.\\nTransmitted with 1 spatial stream by BPSK at rate 1/2 (cf. Table III), as in practice to maximize\\neffect against hidden nodes.\\nThis is the maximum speci\\ufb01ed for OFDM-based PHY layers by 802.11 [6].\\nEach TXOP is packed with as many A-MPDUs as possible. In 802.11 parlance, an aggregated data\\nframe is known as aggregated MPDU (A-MPDU).\\nThis is the maximum speci\\ufb01ed by 802.11 [6].\\nThis is the maximum speci\\ufb01ed by 802.11 [6]; 802.11ac is proposing a maximum 16 times of that.\\nWe assume the M clients ACK simultaneously via uplink MU-MIMO. Although currently in\\n802.11ac each client\\u2019s ACK is sent individually to the AP, our results will still show the general\\nexpected performance trend. Implicit and Compressed BlockACK minimizes ACK overheads.\\n\\nObtaining channel state information (CSI), which is essential for MU-MIMO, can incur small\\noverheads. Since our goal is on showing the general expected performance, we have assumed accurate\\nCSI is known at the transmitter.\\n\\nNetwork traf\\ufb01c model\\n\\nSTAs always\\nsaturated with\\npackets to send\\n\\nThis forces the system to operate in a critical region where it is on the verge of drifting into instability,\\ni.e, throughput approaching zero and delay approaching in\\ufb01nity, allowing us to examine a protocol\\u2019s\\nfundamental performance.\\n\\nNo. of iterations in simulation\\n\\n100 000\\n\\nRunning more, e.g. 1 000 000, did not exhibit any signi\\ufb01cant differences in the scale of our plots.\\n\\nAPPENDIX A: STATE TRANSITION PROBABILITIES OF\\n\\nMARKOV CHAIN {Xt}\\n\\nLet Pi,k be the conditional probability that, if j packets are\\nbacklogged at the start of the current TP, then k packets will\\nbe backlogged at the start of the next TP. With \\u039bk denoting\\nthe probability there are exactly k new arrivals during the 1/\\u03c4\\nslots when there are transmissions (e.g., \\u039b0 = \\u02c6\\u03bb1/\\u03c4\\n), we have:\\n\\n0\\n\\n\\u02c6\\u03bbnCn,n\\u039b0\\nn(cid:2)\\nCn,s\\u039bk\\u2212(n\\u2212s), for k \\u2265 1;\\nj(cid:2)\\ni(cid:2)\\ns=max(0,n\\u2212k)\\n\\nCn+j,n+s\\u039bs\\u2212k, for i \\u2265 1\\n\\n\\u221e(cid:2)\\n\\nn=1\\n\\n\\u2022 P0,0 = \\u02c6\\u03bb0 +\\n\\u221e(cid:2)\\n\\u02c6\\u03bbn\\n\\u221e(cid:2)\\n\\n\\u2022 P0,k =\\n\\nn=1\\n\\n\\u2022 Pi,i\\u2212k =\\n\\n\\u02c6\\u03bbn\\nand 1 \\u2264 k < i;\\n\\nn=0\\n\\n\\u2022 Pi,i = \\u02c6\\u03bb0Bi(0) +\\ni(cid:2)\\n\\ni \\u2265 1; and\\n\\u221e(cid:2)\\n\\u2022 Pi,i+k =\\n\\n\\u02c6\\u03bbn\\n\\nfor i \\u2265 1 and k \\u2265 1.\\n\\nj=k\\n\\nn=0\\n\\nj=k\\n\\nBi(j)\\n\\u221e(cid:2)\\ni(cid:2)\\n\\ns=k\\n\\n\\u02c6\\u03bbn\\n\\nn=0\\n\\nj=0\\n\\nj(cid:2)\\n\\ns=0\\n\\nBi(j)\\nn+j(cid:2)\\n\\nBi(j)\\n\\ns=max(0,n\\u2212k)\\n\\nAPPENDIX B: PROOF OF (3) IS BOUNDED BELOW\\n\\nk=1\\n\\nk=1\\n\\nD(i) = \\u2212 i(cid:2)\\n= \\u2212 i(cid:2)\\n= \\u2212 i(cid:2)\\n> \\u2212 i(cid:2)\\n> \\u2212 i(cid:2)\\n> \\u2212L,\\n\\nj=1\\n\\nj=1\\n\\nj=1\\n\\nkPi,i\\u2212k\\n\\u221e(cid:2)\\n\\nk\\n\\nn=0\\n\\nBi(j)\\n\\nBi(j)\\n\\nBi(j)\\n\\nj=k\\n\\ni(cid:2)\\n\\u02c6\\u03bbn\\n\\u221e(cid:2)\\n\\u221e(cid:2)\\n\\u221e(cid:2)\\n\\nn=0\\n\\nn=0\\n\\n\\u02c6\\u03bbn\\n\\n\\u02c6\\u03bbn\\n\\nn=0\\n\\ns=k\\n\\nj(cid:2)\\nBi(j)\\nj(cid:2)\\ns(cid:2)\\nj(cid:2)\\n\\nk=1\\n\\ns=1\\n\\ns=1\\n\\n\\u02c6\\u03bbnCn+j\\n\\nCn+j,n+s\\u039bs\\u2212k\\n\\nkCn+j,n+s\\u039bs\\u2212k\\n\\ns(cid:2)\\n\\nk=1\\n\\n\\u039bs\\u2212k\\n\\nsCn+j,n+s\\n\\nCn+j,n+s\\u039bs, for\\n\\nCn+j,s\\u039bk\\u2212(n\\u2212s),\\n\\nwhere Pi,i\\u2212k and de\\ufb01nition of \\u039bk are given in Appendix A.\\n\\n\\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\\n\\n277\\n\\nAPPENDIX C: PROOF OF LEMMA 1\\n\\nACKNOWLEDGMENT\\n\\nProof: We \\ufb01rst establish some properties to be used in\\nthe proof. Consider an x0 = arg supx\\u22650 \\u03a5(x,{Cn}) for some\\ngeneral {Cn} where x0 < \\u221e. The concavity assumption we\\nhave on expected transmission successes {Cn} implies that\\n\\u03a5(x,{Cn}) is concave down, and thus x0 is where the global\\nmaximum occurs. Naturally, d\\u03a5(x,{Cn})\\n= 0, which after\\nsome simpli\\ufb01cation of terms can be written as\\nd\\u03a5(x0,{Cn})\\n\\nx=x0\\n\\n(cid:13)(cid:13)\\n\\nxn\\n\\ndx\\n\\n(cid:5)\\u221e\\nn=1 Cn\\n\\n(cid:5)\\u221e\\nn=1 Cn\\n\\n= \\u2212 e\\u2212x\\n\\n1+\\u03c4\\u2212e\\u2212x\\n\\nn! + e\\u2212x\\n\\n1+\\u03c4\\n\\n(15)\\nInterestingly, the \\ufb01rst term of d\\u03a5(x,{Cn})\\nin (15) is exactly the\\nexpression for \\u2212\\u03a5(x,{Cn}). Thus, if we denote C(x,{Cn})\\nto be the second term of d\\u03a5(x,{Cn})\\n\\nin (15), we will have\\n\\ndx\\n\\ndx\\n\\n\\u03a5(x,{Cn}) = \\u03a5(x0,{Cn}) = C(x0,{Cn}).\\n\\n(16)\\n\\ndx\\n\\nsup\\nx\\u22650\\n\\nxn\\u22121\\n(n\\u22121)! = 0.\\n\\nSince x0 is the global maximum, d\\u03a5(x,{Cn})\\nso it follows from (15) that\\n\\ndx\\n\\n> 0 for x < x0,\\n\\nn\\n\\nn\\n\\ndx\\n\\n\\u03a5(x,{Cn}) < C(x,{Cn})\\n\\nfor x < x0.\\n\\nn = C(1)\\n\\n(17)\\n< 0 for x > x0, \\u03a5(x,{Cn}) >\\nSimilarly, because d\\u03a5(x,{Cn})\\nC(x,{Cn}) for x > x0.\\nn }\\nWe now construct an expected transmission success {C(2)\\nn } with C(2)\\nthat will complete the proof. Consider a {C(2)\\nn >\\nC(1)\\nn for all n /\\u2208 N , where N \\u2208\\nn for all n \\u2208 N and C(2)\\n{n : n > x1 + 1} and N (cid:12)= \\u2205. In other words, {C(2)\\nn } contains\\none or more C(2)\\nat some (integer)\\nindices n > x1 + 1, while the rest of {C(2)\\nn } is the same\\nas {C(1)\\nn <\\nn }. Then we know from the proof of Theorem 3\\nsupn\\u22651{C(2)\\nthat \\u03a5(x,{C(2)\\nn }) will achieve its supremum at some \\ufb01nite x2.\\nFrom the construction of {C(2)\\nn } we can readily see that it has\\nn }. So, what remains to be\\nstronger MPR strength than {C(1)\\nshown is that x2 > x1 with this {C(2)\\nn }.\\n\\nn }. Further construct {C(2)\\n\\nn } such that limn\\u2192\\u221e C(2)\\n\\nthat are greater than C(1)\\n\\nObviously if x1 = 0, which happens when C(1)\\n\\nn }) = \\u03a5(x,{C(1)\\nn }) = C(x,{C(1)\\n\\nn = 0\\nfor all n, then we have x2 > x1 already because by our\\nconstruction of {C(2)\\nn } we can only have x2 > 0. Thus, we\\nneed consider only those {C(1)\\nn }\\u2019s that give x1 \\u2208 (0,\\u221e).\\nn }) and C(x,{C(2)\\nn })\\nLet us compare the values of \\u03a5(x,{C(2)\\n(cid:5)\\nwhen evaluated at x = x1. Let {\\u03b4n} = {C(2)\\nn \\u2212 C(1)\\nn }. Then\\nn }) + e\\u2212x\\n\\u03a5(x,{C(2)\\n(cid:5)\\nxn\\nn\\u2208N \\u03b4n\\nn! and\\n1+\\u03c4\\u2212e\\u2212x\\nn }) + e\\u2212x\\nC(x,{C(2)\\nxn\\u22121\\nn\\u2208N \\u03b4n\\n(n\\u22121)! , where\\nin both expressions all the \\u03b4n terms are greater than zero.\\nn }) is attained at x1, from\\nBecause the supremum of \\u03a5(x,{C(1)\\nn }). Observe\\n(16) we know that \\u03a5(x1,{C(1)\\nthat for all x \\u2208 (0,\\u221e), since xn\\nxn\\u22121\\n(n\\u22121)! when n > x+1\\nand x\\nfor any \\u03c4 > 0, it will also be true that\\nxn\\u22121\\n(n\\u22121)! when n > x + 1 and for any \\u03c4 > 0.\\n1+\\u03c4\\u2212e\\u2212x\\nThus we have,\\n\\nn }) = C(x1,{C(1)\\nn! < x\\n\\n1+x < 1+\\u03c4\\u2212e\\u2212x\\n\\nxn\\nn! < 1\\n\\n1+x\\n\\n1+\\u03c4\\n\\n1+\\u03c4\\n\\n1+\\u03c4\\n\\n1\\n\\n\\u03a5(x1,{C(1)\\n< C(x1,{C(1)\\n\\nn }) + e\\u2212x1\\n(cid:5)\\n1+\\u03c4\\u2212e\\u2212x1\\nn }) + e\\u2212x1\\nn }) < C(x1,{C(2)\\n\\n1+\\u03c4\\n\\n(cid:5)\\nxn\\nn\\u2208N \\u03b4n\\n1\\nn!\\nxn\\u22121\\n(n\\u22121)! ,\\n\\n1\\n\\nn\\u2208N \\u03b4n\\n\\ni.e., \\u03a5(x1,{C(2)\\nand that the supremum of \\u03a5(x,{C(2)\\nfollows from (17) that we must have x1 < x2.\\n\\nn }). Finally, given this fact\\nn }) is attained at x2, it\\n\\nThe authors would like to thank our reviewers for their\\nefforts and valuable suggestions. D. S. Chan also thanks Prof.\\nZ. Haas for his insightful comments.\\n\\nDISCLAIMER\\n\\nThe opinions in this paper represent only the personal views\\n\\nof the authors, not necessarily those of their employers.\\n\\nREFERENCES\\n\\n[1] S. Ghez, S. Verd\\u00b4u, and S. C. Schwartz, \\u201cStability properties of slotted\\nALOHA with multipacket reception capability,\\u201d IEEE Trans. Autom.\\nControl, vol. 33, no. 7, pp. 640\\u2013649, 1988.\\n\\n[2] \\u2014\\u2014, \\u201cOptimal decentralized control in the random-access multipacket\\nchannel,\\u201d IEEE Trans. Autom. Control, vol. 34, no. 11, pp. 1153\\u20131163,\\n1989.\\n\\n[3] S. Verd\\u00b4u, Multiuser Detection. Cambridge University Press, 1998.\\n[4] L. Tong, Q. Zhao, and G. Mergen, \\u201cMultipacket reception in random\\naccess wireless networks: from signal processing to optimal medium\\naccess control,\\u201d IEEE Commun. Mag., vol. 39, no. 11, pp. 108\\u2013112,\\n2001.\\n\\n[5] L. Kleinrock and F. Tobagi, \\u201cPacket switching in radio channels\\u2014\\npart I: carrier sense multiple-access modes and their throughput-delay\\ncharacteristics,\\u201d IEEE Trans. Commun., vol. 23, no. 12, pp. 1400\\u2013419,\\n1975.\\n\\n[6] IEEE Standard for Information Technology \\u2014 Telecommunications and\\ninformation exchange between systems \\u2014 Local and metropolitan area\\nnetworks \\u2014 Speci\\ufb01c requirements \\u2014 Part 11: Wireless LAN Medium\\nAccess Control (MAC) and Physical Llayer (PHY) Speci\\ufb01cations, IEEE\\nStd. 802.11-2012, Mar. 2012.\\n\\n[7] D. S. Chan, T. Berger, and L. Tong, \\u201cOn the stability and optimal de-\\ncentralized throughput of CSMA with multipacket reception capability,\\u201d\\nin Proc. 2004 Allerton Conf. on Comm., Control, and Computing, pp.\\n1526\\u20131535.\\n\\n[8] D. S. Chan, P. Suksompong, J. Chen, and T. Berger, \\u201cImproving IEEE\\n802.11 performance with cross-layer design and multipacket reception\\nvia multiuser iterative decoding,\\u201d IEEE 802.11-05/0946r0, Sep. 2005.\\n[9] M. de Courville, M. Kamoun, J. Gosteau et al., \\u201cAnother resource to\\n\\nexploit: multi-user diversity,\\u201d IEEE 802.11-05/2187r0, Jul. 2007.\\n\\n[10] E. Perahia, \\u201cVHT below 6 GHz PAR plus 5C\\u2019s,\\u201d IEEE 802.11-\\n\\n08/0807r4, Sep. 2008.\\n\\n[11] IEEE Draft Standard for Information Technology \\u2014 Telecommuni-\\ncations and information exchange between systems \\u2014 Local and\\nmetropolitan area networks \\u2014 Speci\\ufb01c requirements \\u2014 Part 11: Wire-\\nless LAN Medium Access Control (MAC) and Physical Llayer (PHY)\\nSpeci\\ufb01cations \\u2014 Amendment 5: Enhancements for Very High Through-\\nput for Operation in Bands Below 6 GHz, IEEE Std. P802.11ac/D0.1,\\nJan. 2011.\\n\\n[12] Y. J. Zhang, P. X. Zheng, and S. C. Liew, \\u201cHow does multiple-\\npacket reception capability scale the performance of wireless local area\\nnetworks?\\u201d IEEE Trans. Mobile Comput., vol. 8, no. 7, pp. 923\\u2013935,\\n2009.\\n\\n[13] Y. J. Zhang, private communication, Feb. 23, 2009.\\n[14] R.-H. Gau, \\u201cModeling the slotted nonpersistent CSMA protocol for\\nwireless access networks with multiple packet reception,\\u201d IEEE Com-\\nmun. Lett., vol. 13, no. 10, pp. 797\\u2013799, 2009.\\n\\n[15] F. Babich and M. Comisso, \\u201cTheoretical analysis of asynchronous multi-\\npacket reception in 802.11 networks,\\u201d IEEE Trans. Commun., vol. 58,\\nno. 6, pp. 1782\\u20131794, 2010.\\n\\n[16] L. Roberts, \\u201cAloha packet system with and without slots and capture,\\u201d\\n\\nComputer Commun. Review, vol. 5, no. 2, pp. 28\\u201342, 1975.\\n\\n[17] D. Bertsekas and R. Gallager, Data Networks, 2nd edition. Prentice-Hall,\\n\\n1987.\\n\\n[18] F. Cal`\\u0131, M. Conti, and E. Gregori, \\u201cDynamic tuning of the IEEE 802.11\\nprotocol to achieve a theoretical throughput,\\u201d IEEE/ACM Trans. Netw.,\\nvol. 8, no. 6, pp. 785\\u2013799, 2000.\\n\\n[19] F. Tobagi and L. Kleinrock, \\u201cPacket switching in radio channels\\u2014part\\nIV: stability considerations and dynamic control in carrier sense multiple\\naccess,\\u201d IEEE Trans. Commun., vol. 25, no. 10, pp. 1103\\u20131119, 1977.\\n[20] J. Meditch and C.-T. Lea, \\u201cStability and optimization of the CSMA\\nand CSMA/CD channels,\\u201d IEEE Trans. Commun., vol. 31, no. 6, pp.\\n763\\u2013774, 1983.\\n\\n[21] A. G. Pakes, \\u201cSome conditions for ergodicity and recurrence of Markov\\n\\nchains,\\u201d Oper. Res., vol. 17, pp. 1058\\u20131061, 1969.\\n\\n\\f278\\n\\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\\n\\n[22] M. Kaplan, \\u201cA suf\\ufb01cient condition for nonergodicity of a Markov chain,\\u201d\\n\\nIEEE Trans. Inf. Theory, vol. 25, no. 4, pp. 470\\u2013471, 1979.\\n\\n[23] L. I. Sennott, P. A. Humblet, and R. Tweedie, \\u201cMean drifts and the\\nnon-ergodicity of Markov chains,\\u201d Oper. Res., vol. 31, pp. 783\\u2013789,\\n1983.\\n\\n[24] D. S. Chan, \\u201cRandom multiple access communications on multipacket\\n\\nchannels,\\u201d Ph.D. dissertation, Cornell Univ., New York, Jan. 2006.\\n\\n[25] V. Naware, G. Mergen, and L. Tong, \\u201cStability and delay of \\ufb01nite user\\nslotted ALOHA with multipacket reception,\\u201d IEEE Trans. Inf. Theory,\\nvol. 51, no. 7, pp. 2636\\u20132656, 2005.\\n\\n[26] B. S. Tsybakov, V. A. Mikhailov, and N. B. Likhanov, \\u201cBounds for\\npacket transmission rate in a random multiple access system,\\u201d Problemy\\nPeredachi Informatsii, vol. 19, no. 1, pp. 61\\u201381, 1983 (translated from\\nRussian).\\n\\n[27] D. Gesbert, M. Kountouris, R. W. Heath Jr. et al., \\u201cShifting the\\nMIMO paradigm: from single-user to multiuser communications,\\u201d IEEE\\nWireless Commun. Mag., vol. 24, no. 5, pp. 36\\u201346, 2007.\\n\\n[28] E. Perahia and R. Stacey, Next Generation Wireless LANs. Cambridge\\n\\nUniversity Press, 2008.\\n\\n[29] K. Nishimori, R. Kudo, Y. Takatoti et al., \\u201cPerformance evaluation of\\n8x8 multi-user MIMO-OFDM testbed in an actual indoor environment,\\u201d\\nin Proc. 2006 IEEE Int. Symp. on Personal, Indoor and Mobile Radio\\nComm.\\n\\n[30] E. Aryafar, N. Anand, T. Salonidis, and E. W. Knightly, \\u201cDesign and\\nexperimental evaluation of multi-user beamforming in wireless LANs,\\u201d\\nin Proc. 2010 Annu. Int. Conf. Mobile Comput. and Networking, pp.\\n197\\u2013208.\\n\\nDouglas S. Chan (S\\u201996\\u2013M\\u201998\\u2013S\\u201900\\u2013M\\u201904\\u2013SM\\u201912)\\nreceived his B.A.Sc. degree in electrical engineer-\\ning (EE) from Queens University, Kingston, On-\\ntario, Canada. He received from Cornell University,\\nIthaca, NY the M.Eng. degree in EE in May 2001\\nand the Ph.D. degree in electrical and computer\\nengineering (ECE) with a minor in applied mathe-\\nmatics in Jan 2006. His research interests have been\\non communications theory and its applications.\\n\\nFrom 1998 to 2000, he was with the IBM Toronto\\nLab as Software Engineer and he was involved\\nwith developing enterprise-scaled applications for database access, distributed\\ncomputing and network management. From Jan to May 2006, he was a\\nVisiting Scientist with the School of ECE at Cornell University. In July\\n2006, he joined Cisco Systems, Wireless Networking Business Unit, where\\nhe is currently a Technical Leader and his work includes research and\\ndevelopment (R&D) of IEEE 802.11-based wireless local area networking\\nproducts and their standardizations. Since 2011, he also became a member\\nof the Cisco Advanced Architecture and Research team that investigates on\\ncurrently emerging paradigms like Fog Computing and Internet of Things.\\nIn addition, he had multiple internships in the wireless industry: Hong\\nKong Telecom CSL, Mobile Networks (Radio Planning); Texas Instruments,\\nCommunications Systems Lab; and Symbol Technologies, Corporate R&D\\n\\nDr. Chan served as the Secretary for the IEEE Signal Processing Soci-\\nety Santa Clara Valley chapter for the 2007\\u20132009 term. He has received\\nrecognitions from the IEEE Standards Association for his contributions to\\nthe 802.11n and 802.11y standards. He is a licensed professional engineer of\\nOntario, Canada.\\n\\nToby Berger\\n(S\\u201960\\u2013M\\u201966\\u2013SM\\u201974\\u2013F\\u201978\\u2013LF\\u201906)\\nwas born in New York, NY on September 4, 1940.\\nHe received the B.E. degree in electrical engineering\\nfrom Yale University, New Haven, CT in 1962, and\\nthe M.S. and Ph.D. degrees in applied mathematics\\nfrom Harvard University, Cambridge, MA in 1964\\nand 1966.\\n\\nFrom 1962 to 1968 he was a Senior Scientist\\nat Raytheon Company, Wayland, MA, specializing\\nin communication theory, information theory, and\\ncoherent signal processing. From 1968 through 2005\\nhe was a faculty member at Cornell University, Ithaca, NY where he held\\nthe position of Irwin and Joan Jacobs Professor of Engineering. In 2006 he\\nbecame a professor in the ECE Department of the University of Virginia,\\nCharlottesville, VA.\\n\\nProfessor Berger\\u2019s research interests include information theory, neuroin-\\nformation theory, random \\ufb01elds, communication networks, wireless communi-\\ncations, video compression, voice and signature compression and veri\\ufb01cation,\\nquantum information theory, and coherent signals processing. He is the author\\nof Rate Distortion Theory: A Mathematical Basis for Data Compression and\\na co-author of Digital Compression for Multimedia: Principles and Standards\\nand of Information Measures for Discrete Random Fields.\\n\\nBerger has served as editor-in-chief of the IEEE TRANSACTIONS ON\\nINFORMATION THEORY and as president of the IEEE Information Theory\\nGroup. He has been a Fellow of the Guggenheim Foundation, the Japan\\nSociety for Promotion of Science, the Ministry of Education of the People\\u2019s\\nRepublic of China and the Fulbright Foundation. He received the 1982 Freder-\\nick E. Terman Award of the American Society for Engineering Education, the\\n2002 Shannon Award from the IEEE Information Theory Society, the IEEE\\n2006 Leon K. Kirchmayer Graduate Teaching Award, the 2010 Aaron D.\\nWyner Distinguished Service Award of the IEEE Information Theory Society,\\nand the 2011 IEEE Richard W. Hamming Medal. Professor Berger is a Life\\nFellow of the IEEE, a life member of Tau Beta Pi, a member of the National\\nAcademy of Engineering, and an avid amateur blues harmonica player.\\n\\nLang Tong (S\\u201987\\u2013M\\u201991\\u2013SM\\u201901\\u2013F\\u201905) is the Irwin\\nand Joan Jacobs Professor in Engineering at Cornell\\nUniversity, Ithaca, New York. He received the B.E.\\ndegree from Tsinghua University, Beijing, China,\\nin 1985, and M.S. and Ph.D. degrees in electrical\\nengineering in 1987 and 1991, respectively, from the\\nUniversity of Notre Dame, Notre Dame, Indiana. He\\nwas a Postdoctoral Research Af\\ufb01liate at the Infor-\\nmation Systems Laboratory, Stanford University in\\n1991. He was the 2001 Cor Wit Visiting Professor\\nat the Delft University of Technology and had held\\n\\nvisiting positions at Stanford University, and U.C. Berkeley.\\n\\nLang Tong\\u2019s research is in the general area of statistical inference, com-\\nmunications, and complex networks. His current research focuses on energy\\nand power systems. He received the 1993 Outstanding Young Author Award\\nfrom the IEEE Circuits and Systems Society, the 2004 best paper award from\\nIEEE Signal Processing Society, and the 2004 Leonard G. Abraham Prize\\nPaper Award from the IEEE Communications Society, and is a coauthor of\\nseven student paper awards. He received Young Investigator Award from the\\nOf\\ufb01ce of Naval Research. He was a Distinguished Lecturer of the IEEE Signal\\nProcessing Society.\\n\\n\\f\"}"}, {"id": "428844", "name": "266\n\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\n\nCarrier Sense Multiple Access Communications on\n\nMultipacket Reception Channels: Theory and\n\nApplications to IEEE 802.11 Wireless Networks\n\nDouglas S. Chan, Senior Member, IEEE, Toby Berger, Life Fellow, IEEE, and Lang Tong, Fellow, IEEE\n\nAbstract—Multipacket reception (MPR) refers to physical\nlayers where receivers can decode multiple simultaneously trans-\nmitted packets. In this paper we investigate the resulting perfor-\nmance of conjoining carrier sense multiple access (CSMA) com-\nmunications with MPR. We report on its maximum achievable\nstable throughput with decentralized control and show there can\nbe throughput gain over slotted ALOHA (S-ALOHA), the non-\nchannel-sensing protocol of choice. However, this gain diminishes\nas the physical layer’s MPR strength increases, thereby dimin-\nishing the need for channel sensing. Nonetheless, for systems\nevolving from a single-user (SU) to a multiple-user (MU) channel,\nCSMA can furnish signiﬁcantly more efﬁcient utilization of MPR\ncapacity than S-ALOHA. This is meaningful in practice because\nthe emerging generation of the widely deployed IEEE 802.11\nwireless local area networks (WLAN) — 802.11ac — is adapting\nMPR and will operate in said region. In that regard, we also\ndiscuss the effective usage of a channel’s resources for MPR\nand highlight the advantages multiuser-MIMO (MU-MIMO),\nan MPR technique, can offer to WLANs. Using early design\nspeciﬁcations of 802.11ac, we show that the existing SU-oriented\n802.11 MAC parameters can under-utilize the MPR capacity\noffered by a MU-oriented physical layer.\n\nIndex Terms—Multiple access theory, CSMA, multipacket\nreception, IEEE 802.11ac, wireless local area networks, cross-\nlayer design, slotted ALOHA.\n\nI. INTRODUCTION\n\nT RADITIONALLY, practical design and theoretical anal-\n\nysis of random multiple access protocols have assumed\nthe classical collision channel model — namely, a trans-\nmitted packet\nis considered successfully received as long\nas it does not overlap or “collide” with another. Although\nthis model is analytically amenable and reﬂected the state\n\nPaper approved by A. Pattavina,\n\nthe Editor for Switching Architecture\nPerformance of the IEEE Communications Society. Manuscript received May\n6, 2011; revised February 1 and May 23, 2012.\n\nThis paper was presented in part at the 42nd Annual Allerton Conference\non Communications, Control, and Computing, Allerton, IL, USA, 2004, and\nthe 116th IEEE 802.11 Wireless Local Area Network Working Group Session,\nSan Francisco, CA, USA, 2009.\n\nD. S. Chan is with Cisco Systems, San Jose, CA 95134, USA. He was\nwith the School of Electrical and Computer Engineering, Cornell University,\nIthaca, NY 14853, USA, where he researched the main body of this paper’s\nwork (e-mail: douglas.chan@ieee.org).\n\nT. Berger is with the Charles L. Brown Dept. of Electrical and Computer\nEngineering, University of Virginia, Charlottesville, VA 22904, USA, and the\nSchool of Electrical and Computer Engineering, Cornell University, Ithaca,\nNY 14853, USA (e-mail: tb6n@virginia.edu).\n\nL. Tong is with the School of Electrical and Computer Engineering, Cornell\n\nUniversity, Ithaca, NY 14853, USA (e-mail: ltong@ece.cornell.edu).\n\nThe work of L. Tong was supported in part by the National Science\n\nFoundation under award CCF 1018115.\n\nDigital Object Identiﬁer 10.1109/TCOMM.2012.120512.110285\n\n0090-6778/13$31.00 c(cid:2) 2013 IEEE\n\nof technology when networking was an emerging ﬁeld, the\nclassical collision model does not represent the capabilities of\ntoday’s transceivers. In particular, present transceiver technolo-\ngies enable users to correctly receive multiple simultaneously\ntransmitted data packets. With proper design, this capability\n— commonly referred to as multiple packet reception (MPR)\n[1][2] — can signiﬁcantly enhance network performance.\nMany fundamental ideas behind MPR already have been\nwell researched and widely applied [3, §1]. Such examples\ninclude code division multiple access (CDMA) and frequency\ndivision multiple access (FDMA). But while MPR is applied\ntherein as the basis for enabling multiple users to share a\nchannel, for networks that employ packet-by-packet random\nmultiple access, MPR represents a paradigm shift from the\ntypical single-user (SU) to multiple-user (MU) models —\nsomething that is only beginning to happen in practice. Em-\nploying MPR in the physical (PHY) layer also expands the\nset of parameters for the media access control (MAC) layer to\nconsider in its scheduling process, thus underscoring the im-\nportance for cross-layer design that strives to jointly optimize\nthe functions of these layers [4]. Providing further insights\nfor doing so in random multiple access communications with\nMPR — both in theory and in practice — is the main goal of\nthe present paper.\n\nA. Development of MPR in CSMA and 802.11 WLANs\n\nThe concept of random access on MPR channels was\nintroduced by Ghez, Verd´u and Schwartz in [1] and [2],\nwhere they studied the performance of slotted ALOHA (S-\nALOHA) with MPR. Since then there has been much research\non multiple access with MPR. However, until only recently,\nthere has been no research published on carrier sense multiple\naccess (CSMA) with MPR.\n\nCSMA refers to a family of\n\nrandom multiple access\nschemes wherein a station (STA) with packets to transmit\nwill attempt to do so only when the channel is detected to\nbe idle. It was ﬁrst shown by Kleinrock and Tobagi [5] that\nthis provides signiﬁcant performance improvement over S-\nALOHA on the collision channel. CSMA have become the\nfoundations of many networking technologies. For example,\nCSMA and CSMA with collision avoidance (CSMA/CA) are\nemployed in the MAC layers of IEEE 802.11-based wireless\nlocal area networks (WLAN) [6]. However, none of these\ntechnologies have deployed MPR yet.\n\n\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\n\n267\n\nFig. 1. Typical realization of channel activities with the CSMA protocol based on our network model.\n\nThe ﬁrst substantial research on CSMA with MPR did not\nappear until 2004 when we reported in [7] on conjoining the\ntwo concepts and studied the resulting performance. Recog-\nnizing the beneﬁts that MPR can bring to WLANs, in 2005\nwe presented the idea in a proposal [8] to the 802.11 WLAN\nWorking Group for a future WLAN standard that incorporates\nMPR. Two years later, the notion of adapting a MU model in\nWLAN began garnering more consideration from members of\nthe Working Group (eg. [9]). In late 2008, the 802.11ac Task\nGroup (TGac) was established to develop a WLAN standard\nthat supports a maximum aggregate throughput of at least 1\nGbps [10]. In order to realize the targeted data rates, TGac\nrecognizes the need for higher data multiplexing efﬁciency and\nhas identiﬁed MPR techniques like OFDMA and spatial divi-\nsion multiple access (SDMA), also known as MU multiple-\ninput-multiple-output (MU-MIMO), as candidate technologies\n[10]. TGac now has converged on adapting MU-MIMO as one\nof the core technologies of the 802.11ac PHY layer [11].\n\nB. Main Contributions of This Paper\n\nThis paper is an extension of the seminal multiaccess theory\non MPR channels set forth in [1] and [2] to embody another\nessential MAC protocol — CSMA. We ﬁnd that CSMA will\nalways provide a higher throughput than S-ALOHA when\nclosed-loop control is used, but this margin diminishes when\nthe ability to resolve simultaneous transmissions is strong.\nNonetheless, for systems that are evolving from SU to MU,\nCSMA can furnish signiﬁcantly better performance than S-\nALOHA via more efﬁcient utilization of MPR capacity. This\nis of practical signiﬁcance because the emerging generation of\nMPR-enabled WLANs likely will operate in this regime. We\nillustrate the applicability of our theoretical results by showing\nthe effective usage of channel resources for MPR and the\nadvantages that MU-MIMO can offer to WLANs. In particular,\nby simulating early 802.11ac speciﬁcations, we show that its\nSU-oriented MAC layer can under-utilize the capacity offered\nby an MPR-enabled MU-oriented PHY layer.\n\nC. Other Related Work\n\nIn 2009, Zhang et al. reported in [12] their analysis of MPR\nin WLANs, employing 802.11g as an example. While their\nconclusions corroborate some themes in the theory we discuss\nhere, their main results for CSMA are not shown analytically\nbut via numerical results. And although they looked at S-\nALOHA too,\nits intricate relationship with CSMA is not\nextensively investigated. Their entire focus is also only on\none speciﬁc type of MPR channel. Moreover, their discussion\n\nfor designing WLAN with MPR is on the limiting case when\nnumber of users is inﬁnite, which differs from ours on the\nﬁnite user case as reﬂected in practice. According to [13], their\nresearch in [12] was conducted unbeknownst of our earlier\nwork.\n\nOther researchers also have published results on this topic\nthat enrich the theory and advance our understanding of it,\nlike [14] and [15]. Particularly, Gau [14] provided another\ntreatment of this topic by applying the traditionally used but\npossibly unrealistic framework wherein the overall offered\ntrafﬁc is Poisson; we discuss in III-D how this provides an\nalternative perspective of the theory in this paper.\n\nII. THE NETWORK MODEL\n\nA. Topology, Timing Relations and the CSMA Protocol\n\nWe consider a network with an unbounded number of\nstations (STAs) contending to transmit data packets to a central\nbase station. Such a network model corresponds to the uplink\nof the infrastructure mode in 802.11 WLANs, wherein the\nbase station is referred to as access point (AP) [6].\n\nWe assume each STA can perform carrier sensing, namely\nto detect whether the channel is currently idle or busy (i.e., that\nthere is at least one other STA transmitting), and we assume\nthe time required to do so is negligible (i.e., zero detection\ntime).1 As illustrated in Fig. 1, we employ a slotted-time\nsystem in which transmissions may begin only at the start\nof a slot and that every STA is synchronized to the slots.2\nSlot duration is designated to be at least the maximum signal\npropagation time of tprop = dmax/c seconds, where dmax is\nthe maximum separation distance between the STAs and c is\nthe signal’s speed of propagation through the network’s PHY\nmedium.3 Such a setup ensures that, after a transmission stops,\nevery STA will ﬁnd the channel to be clear for transmission\nafter one slot’s time; thus, each transmission must be preceded\nby an idle slot. We also assume packets are of constant length\nlasting T seconds. As in [5] and [17, §4.4], without loss of\ngenerality, we choose T = 1, which is equivalent to expressing\ntime in units of T . We also express the slot duration in terms\nof this normalized time unit as τ = tprop/T , 0 < τ < ∞.\nConsequently, a packet will last for 1/τ slots, where we have\nassumed as in [5] that 1/τ is an integer.4 In our model,\n\n1Note that in 802.11 WLANs [6] a STA has to detect that the channel has\n\nbecome busy within 4 μs, which is also less than half of the slot duration.\n\n2We will forgo analyzing the non-slotted versions as their performances\n\nare inferior to those of slotted versions [16] [5].\n\n3Eg., c is the speed of light for the air interface in wireless networks.\n4We can achieve this integral assumption practically by designing one’s\n\nslot duration to ﬁt this requirement.\n\n\f268\n\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\n\neach STA immediately becomes aware of its transmission out-\ncomes,5 either successful or unsuccessful, without expending\nextra cost; in this regard, acknowledgements introduce only\nﬁxed overheads and hence can be neglected from the model\nwithout affecting comparative analyses.\n\nFig. 1 illustrates a typical realization of channel activities\nwith the CSMA protocol. It is not difﬁcult to see that CSMA’s\nchannel activities can be modelled by a renewal process.\nNamely, the process regenerates itself after either an idle slot\nor an idle slot followed by transmission attempts that last for\na packet’s duration. We will refer to either of these events as\na transmission period (TP).\n\nOur analysis focuses on CSMA with immediate ﬁrst trans-\nmission (IFT) admission control. Under this policy, when a\npacket arrives at an inactive STA and the channel is sensed\nidle, then the STA will attempt to transmit the packet at the\nstart of the slot immediately following the packet’s arrival.\nIf the channel is sensed busy, then the STA will defer its\nattempt until there is idleness, and thereupon decides randomly\nwhether to “backoff” or transmit. This random backoff is mod-\nelled as an independent sampling from a geometric distribution\nwith parameter p, 0 ≤ p ≤ 1; in other words, each STA\nattempts transmission with probability p or backs off with\nprobability 1− p.6 The process is repeated if the channel is\nsensed busy after a backoff or that the packet transmission is\nnot successfully received.\n\nNote\n\nthat CSMA with IFT is\n\nslotted\nnon-persistent CSMA protocol introduced by Kleinrock and\nTobagi in [5]. This variant of CSMA is, moreover, the primary\nMAC protocol practiced in 802.11 WLANs, called distributed\ncoordinated function (DCF) [6].\n\nexactly the\n\nB. Network Trafﬁc and Throughput Characteristics\n\nEach STA in our inﬁnite population network model can have\nup to one packet to be transmitted at any time, be it a newly\narrived packet or a so-called backlogged packet that needs to\nbe retransmitted. Packet arrivals for non-backlogged STAs are\nassumed to be independent and identically distributed from\nslot to slot. Let ˆAt denote the number of new packets that\narrived during the idle slot of TP t, t ≥ 0. Assume ˆAt has\nprobability distribution P [ ˆAt = n] = ˆλn, for n ≥ 0, such that\nthe mean arrival rate per slot is\n\n∞(cid:2)\n\nˆλ =\n\nnˆλn = τ λ,\n\n(1)\n\nn=1\n\nwhere λ is the mean arrival rate per normalized time unit (i.e.,\nper packet duration) and is ﬁnite. Described more precisely,\nour packet arrival model is a point process over the real time\nline, with mean measure equal to the unit rate λ scaled by the\nLebesgue measure. Note that a homogeneous Poisson point\nprocess of intensity λ satisﬁes condition (1).\n\n5This assumption reﬂects 802.11 WLANs wherein the STA that has\nsuccessfully received a data packet has to transmit an acknowledgement packet\nimmediately after a ﬁxed short duration; otherwise, receipt of the data packet\nis considered unsuccessful.\n\n6Note that the exponential backoff process used in 802.11 can be equiv-\nalently modelled by such a sampling from a geometric distribution with an\nappropriate p [18].\n\nWhen the arrival statistics are described in this manner, λ\nis equivalent to the mean arrival rate considered in many well\nknown results, such as [1] and [2] for S-ALOHA with MPR\nor [5] and [17, §4.4] for CSMA on the collision channel. In\nother words, our current setup facilitates direct and meaningful\ncomparison of our results with those in classical multiple\naccess theory. In particular, the maximum λ for which packets\ncan be successfully transmitted by a multiaccess protocol\non a channel with asymptotically ﬁnite average delay is the\nchannel’s maximum achievable stable throughput with that\nprotocol [17, §4.2.3].\n\nC. The MPR Channel Model and Examples\n\nWe employ the symmetric MPR channel model of [1], with\nwhich the successful reception probabilities depend only on\nthe number of packets transmitted in the slot. For the inﬁnite\npopulation scenario, given that n packets are transmitted, for\n1 ≤ n ≤ ∞, 0 ≤ k ≤ n, let\nCn,k = P [k packets are correctly received| n are transmitted].\nClearly, the symmetric MPR channel model is a generalized\nformulation and embodies as a special case the classical\ncollision channel, which has C1,0 = 0 and Cn,0 = 1 for all\nn > 1.\n\nWe denote the expected number of packets correctly re-\n\nceived from a transmission set of n STAs by\n\nCn (cid:2)\n\nkCn,k,\n\nn(cid:2)\n\nk=1\n\nC (cid:2) sup\n\nn\n\nCn,\n\nand assume that its limit C = limn→∞ Cn exists, which is\nusually the case in practice [1]. For instance, it is natural\nto expect C = 0 because practical PHY layers have ﬁnite\nresources and hence cannot support an unbounded number of\nsimultaneous transmissions. We deﬁne channel capacity to be\n\nnamely the largest expected successes with simultaneous trans-\nmissions on a channel.\nIn addition, we also assume that Cn is concave in n,\na property possessed by reasonable MPR channels. To see\nwhy, say we have n1 < n2 < arg supn Cn. Then it\nis\nunreasonable to expect Cn1 > Cn2 < C because, if the channel\nis still capable of supporting more successful receptions even\nwhen greater than n2 STAs transmit, then we should have\nCn1 ≤ Cn2. Similarly, say arg supn Cn < n3 < n4, then we\nshould have Cn3 ≥ Cn4, because the channel can only yield\nfewer successes with an increasing number of transmitting\nSTAs if there already are greater than arg supn Cn of them.\nIt is possible for supn Cn to be achieved at more than one n,\nbut with said assumption this must occur over one and only\none consecutive set of n’s.\n\nIn sections below we discuss two speciﬁc MPR channels\nwe consider exemplary and refer the reader to [1] and [2]\nfor additional ones. In the q-frequencies frequency-hopping\nchannel, each STA chooses with equal probability one of q\nfrequencies on which to transmit. If more than one STAs\nchoose the same frequency, then their transmissions will fail.\n\n\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\n\n269\n\nSuch a channel has Cn = n(1 − 1/q)n−1 [1]. We will have\nan equivalent channel model if orthogonal multiuser codes\nare used instead of the q frequencies, i.e., STAs select one\nof q codes to encode their transmissions, failure occurring\nwhenever two or more STAs select the same code. Another\nexample we consider is the N -user channel, which assumes\nfailed reception when the transmission set is strictly greater\nthan N . The expected success of this channel is simply Cn = n\nfor n ≤ N and Cn = 0 for n > N . Note that the Cn’s of both\nchannels are concave in n.\n\nis how well\n\nA meaningful performance measure of a multiaccess pro-\ntocol\nit utilizes a channel’s MPR capacity;\naccordingly we deﬁne efﬁciency to be the protocol’s maximum\nstable throughput divided by C.\n\nIII. CAPACITY OF CSMA ON MPR CHANNELS\n\nA. Ergodicity Region of CSMA\n\nThere have been many results on the stability and dynamic\ncontrol of CSMA, but they pertain to the collision channel\n[17, §4.4] [19] [20]. Although they used different deﬁnitions\nof stochastic stability and attacked the problem with unique\napproaches, they all concluded that CSMA with the collision\nchannel is inherently unstable, which is expected from its\ntrafﬁc load-throughput curve (cf. [17, §4.2] and [5]). We\nemploy instead the analytic framework used for S-ALOHA in\n[1] and [2]:7 A system is deﬁned to be stable if the discrete-\ntime Markov chain {Xt}t≥0, whose state is the number of\nbacklogged packets in the system at the beginning of the tth\nTP, is ergodic and unstable otherwise [17, §3A.5].\nWe give the state transition probabilities of {Xt} in Ap-\npendix A. We can see from them that {Xt} will be irreducible\nand aperiodic as long as it satisﬁes the sufﬁcient condition\nthat 0 < ˆλ0 < 1, which we assume holds as it is true for all\nreasonable scenarios.\nTo obtain our ﬁrst main result, we examine the expected\ndrift of the Markov chain {Xt} at state n, n ≥ 0, which is\ngiven by\n\ndn = E[Xt+1 − Xt|Xt = n] = E[At − Σt|Xt = n],\n\nif there is at\n\nwhere At and Σt are respectively the no. of new packets that\narrived and the no. of successful transmissions during TP t.\nObserve that the expected number of arrivals during a TP\ndepends on whether there are arrivals during its idle slot\nand whether any of the backlogged STAs decide to transmit\nin the slot after it. Due to IFT,\nleast one\narrival in the idle slot, then the TP will consist of this idle\nslot followed by a transmission, regardless of how many\nbacklogged STAs also decide to transmit during this time too.\nAnd of course, this situation also occurs even if the idle slot\nhas no packet arrivals but at least one of the n backlogged\nSTAs transmits, which occurs with probability 1 − (1 − p)n.\nSince the expected number of arrivals during a slot and during\na packet transmission are respectively τ λ and λ, we have\nE[At|Xt = n] = τ λ + (1 − ˆλ0)λ + ˆλ0[1 − (1 − p)n]λ\n\n= λ[1 + τ − ˆλ0(1 − p)n].\n\n7In homage to Ghez, Verd´u and Schwartz,\n\nin adapting their analytic\nframework of [1] and [2], we have kept many of their notations unchanged\nor as similar as possible.\n\nTo ﬁnd Σt, observe that the STAs contributing to channel\ncontention in the current TP are only those with packets that\narrived during the idle slot and those that are retransmissions\nfrom STAs backlogged at the start of this TP. As in the\nderivation in [1], let Rt be the number of transmissions from\nbacklogged STAs in TP t. Then\n\nP [Σt = k|Xt = n, ˆAt = i, Rt = j] = Ci+j,k,\n\nfor i ≥ 0, 0 ≤ j ≤ n, 0 ≤ k ≤ i + j. With the convention that\nC0,0 = 0, we have\n\nE[Σt|Xt = n, ˆAt = i, Rt = j] = Ci+j\n\nand hence get\n\nE[Σt|Xt = n] =\n\nn(cid:2)\n\nj=0\n\nˆλi\n\nBn(j)Ci+j ,\n\n∞(cid:2)\n(cid:3)\n(cid:4)\n\ni=0\n\nwhere we have let Bn(j) =\ndn = λ(1 + τ ) − λˆλ0(1 − p)n −\n\nn\nj\n\npj(1 − p)n−j. Therefore,\n∞(cid:2)\nBn(j)Ci+j .\n\nn(cid:2)\n\nˆλi\n\n(2)\n\nThen by applying a result from [1], we arrive at the following\nresult on the ergodicity region of CSMA.\n\ni=0\n\nj=0\n\nTheorem 1. A CSMA system is stable for all arrival distri-\n1+τ C,\nbutions such that λ < 1\nwhere C = limn→∞ Cn. (This also holds if C is inﬁnite: if\nlimn→∞ Cn = +∞, then the system is always stable.)\n\n1+τ C and is unstable for λ > 1\n\nProof: From (2) we can see that −2λ− n < dn < λ(1 +\nτ ), so |dn| is ﬁnite for n < ∞. Then we can use Lemma 1\nof [1], which states that\n\n∞(cid:2)\n\nn(cid:2)\n\nˆλi\n\nlim\nn→∞\n\ni=0\n\nj=0\n\nBn(j)Ci+j = C,\n\nD(i) = − i(cid:2)\n\nand see that the limit of equation (2) as n goes to inﬁnity is\n\nn→∞ dn = λ(1 + τ ) − C.\n\nlim\n\nThen our result on the stable region follows by Pakes’ Lemma\n(Theorem 2 of [21]).\nTo obtain our result on the unstable region, we will verify\nthat Kaplan’s condition [22] is satisﬁed provided that Cn <\nL, n ≥ 1, for some L ∈ (0,∞). According to [23], this is\nequivalent to showing the downward part of the drift,\n\nkPi,i−k,\n\n(3)\n\nis bounded below, as shown in Appendix B.\n\nk=1\n\n1\n\nBecause the ergodicity region in Theorem 1 is achieved with\n1+τ C is the maximum\nan arbitrary transmission probability p,\nstable throughput that CSMA can achieve with open-loop\ncontrol. Denoting ηc,o to be CSMA’s open-loop throughput,\n1+τ C.\nthen Theorem 1 states that ηc,o = 1\nAnother implication of Theorem 1 is that, since C = 0 for\nthe collision channel, the corresponding open-loop throughput\nis then ηc,o = 0, which agrees with the known results\nthat CSMA over the collision channel is inherently unstable\nwithout resort to a control protocol. It is also revealing to\n\n1+τ limn→∞ Cn = 1\n\n\f270\n\nStation A\n\nStation B\n\nBoth packets\n\noverlapping here\n\nSignal\n\npropagation\n\ndelay\n\nFig. 2. Unfavorable interference can occur in S-ALOHA if signal propagation\ndelay is not properly accounted for. Thus, in practice, S-ALOHA’s slot size\nhas to be at least 1 + τ time units. Note that, when compared with Fig. 1, the\nonly difference in the channel activities is that CSMA’s idle slots are shorter.\n\nslots\n\ncompare ηc,o with the open-loop throughput for S-ALOHA\ngiven in [1], which we will denote by ηa,o. Although [1] shows\nthat stability for uncontrolled S-ALOHA is achieved as long\nas λ < C, this does not mean S-ALOHA actually outperforms\nCSMA by a factor of 1 + τ. This is because the network\nmodel assumed in [1] hasn’t accounted for signal propagation\ndelay. Certainly,\nif one were to implement S-ALOHA in\npractice, as illustrated in Fig. 2, propagation delay will destroy\nthe synchronous assumption and detrimental interferences can\noccur between packets. Thus, as Roberts originally proposed\n[16], S-ALOHA’s slot size should have at least 1 + τ time\nunits. By applying the same derivations set forth in [1], one\ncan extend their results to show that S-ALOHA with a slot\n1+τ C. This means S-ALOHA\nsize of 1+τ actually has ηa,o = 1\nand CSMA perform identically with open-loop control. In\nother words, Theorem 1 has the important implication that\nCSMA’s extra capability to sense the channel affords no\nadditional advantage for random multiple access when no\ncontrol protocol is used; we’ll see below how this is different\nwhen a control protocol is employed.\n\nB. Maximum Decentralized Stable Throughput of CSMA\n\nSimilar to the decentralized control strategies analyzed in\n[2] and the references therein, we consider strategies in which\nSTAs adjust their retransmission probability according to the\nfeedback information they can obtain from the channel. These\nschemes can be characterized in such a form:\n\npt = F (St)\n\nand St+1 = G(St, Zt),\n\n(4)\n\nwhere pt is the retransmission probability to be used in TP t,\nSt is an estimate of the backlogged STAs Xt at the beginning\nof TP t, and Zt is the feedback information at the end of TP\nt.8 To proceed with the analysis, we represent this system by\na discrete-time homogeneous Markov chain {Xt, St}t≥0, the\nstate of which at time t is the pair {Xt, St}. This Markov chain\nalso will be irreducible and aperiodic if the same sufﬁcient\ncondition previously stated for {Xt} is satisﬁed, which we\nhenceforth assume to be the case.\n\nLet ηc,c be the maximum stable throughput achievable by\nCSMA with decentralized closed-loop control. Toward ﬁnding\nηc,c, we will ﬁrst study the case when each STA knows\nthe beginning of TP t and determine the optimal\nXt at\ncontrol function F ∗\n(Xt) for it. To do that, we proceed by\n\n8See [2] for discussion on implementing such a closed-loop control.\n\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\n\nanalyzing the Markov chain {Xt} in Section III-A but with\np = pt = F (Xt). This will then reveal the largest ergodicity\nregion with decentralized control (4), and thus the highest\npossible achievable stable throughput (cf.[2]).\nTheorem 2. There exists a retransmission probability p∗\nn that\nminimizes the expected drift, dn. With that p∗\nn the CSMA\nsystem is stable for λ < ηc,c and unstable for λ > ηc,c, where\n(cid:5)(cid:6)\n\n(cid:2)\n\n(cid:3)\n\n∞(cid:4)\n\n∞(cid:4)\n\n1\n\n1 + τ\n\nsup\nx≥0\n\ne−x\n\nˆλ0λ+\n\nxn\nn!\n\nn=0\n\nj=0\n\nˆλjCn+j\n\nηc,c = sup\n\nλ : λ <\n\n.\n\n(5)\n\nThe largest stable achievable throughput by any decentralized\ncontrol algorithm of the form (4) for CSMA is ηc,c of (5).\n\ni=0\n\nˆλi\n\n(cid:4)\n\n(cid:3)\n\n(cid:5)n\n\n(cid:5)∞\n\nProof: We can write the expected drift equation (2)\nas dn(p) = λ(1 + τ ) − Yn(p), where Yn(p) = λˆλ0(1 −\npj(1 − p)n−jCi+j. Since Yn(p) is\np)n +\na polynomial on [0, 1], it attains a global maximum and there\nexists a p∗\nn = arg maxp∈[0,1]Yn(p) = arg minp∈[0,1] dn(p); in\nother words, there exists a retransmission probability p∗\nn that\nminimizes the drift dn at state n.\n\nj=0\n\nn\nj\n\nFollowing the same steps used in the proof of Theorem 1 of\n[2], we can show that Yn(x/n) converges uniformly to Y (x)\nfor x ≥ 0, where\n\n(cid:7)\n\nˆλjCn+j\n\n.\n\n(6)\n\nY (x) = e−x\n\n(cid:6)\nˆλ0λ +\n\n∞(cid:2)\n\n∞(cid:2)\n\nxn\nn!\n\nn=0\n\nj=0\n\nSo it follows that\nn→∞ Yn(p∗\n\nlim\n\nn) = lim\n\nn→∞ sup\nx≥0\n\nYn(x/n) = sup\nx≥0\n\nY (x).\n\nThe stable region speciﬁed by (5) follows by applying Pakes’\nLemma [21, Theorem 2].\n\nTo obtain the unstable region, we can proceed as we did\nin Theorem 1 but with pt = F (Xt) substituted for p. Since\npt ∈ [0, 1], the result obtained there holds with said pt.\nTo prove the second part of the theorem, we need to\nshow that the {Xt, St} is non-ergodic with any control when\nλ > ηc,c. The proof of this is essentially the same as that\nfor Theorem 2 of [2], which gives the analogous result for\nS-ALOHA. (Cf. [24] for such details.)\n\nThough ηc,c of (5) is derived by assuming the STAs have\nperfect knowledge of Xt, ηc,c can also be achieved with\na control with partial state information. In fact, by directly\napplying the derivation in [2, §III] to our CSMA framework\nhere, we can show the same control they described for S-\nALOHA — a control that computes the backlogged estimate\nSt from feedback information Zt, where Zt = 0 when TP t\nis empty (contains no transmission) and Zt = 1 otherwise —\ncan also achieve ηc,c.\nBecause Y (x) is expressed in terms of the arrival proba-\nbilities {ˆλn}n≥0, the expression for ηc,c given by (5) is an\nimplicit equation of λ. Thus, unless the entire packet arrival\nprobability distribution is speciﬁed, it is unclear whether there\nexist solutions to (5) and we cannot draw more meaningful\ngeneral conclusions from it. It turns out, however, that a\nPoisson distribution will give a solution to (5), i.e., that the\narrival per slot is Poisson distributed with parameter τ λ . Since\n\n\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\n\n271\n\nPoisson arrivals are also a ﬁtting — if not the de facto —\nstatistical model for packet generation in networks of large\nnumbers of STAs, we assume henceforth that the packet arrival\nper slot has such a probability distribution. Then,\nCn+j\n\nY (x) = e−(x+τ λ)\n\n∞(cid:2)\n\n(cid:7)\n\n(cid:6)\nλ +\n(cid:6)\nλ +\n\n∞(cid:2)\n∞(cid:2)\n\nn=0\n\nn=1\n\nxn\nn!\nCn\n\n(τ λ)j\n(cid:7)\nj!\n\n,\n\n(7)\n\nj=0\n(x + τ λ)n\n\nn!\n\n= e−(x+τ λ)\n\nand hence,\n(cid:8)\nηc,c =\nλ : λ < 1\n\nsup\n\n1 + τ sup\nx≥0\n\ne−(x+τ λ)\n\n(cid:6)\nλ+\n\n∞(cid:2)\n\nn=1\n\nCn\n\n(x + τ λ)n\n\nn!\n\n(cid:7)(cid:9)\n\n,\n\n(8)\n\n(cid:10)\n\n(cid:11)\n\nλ : λ < 1\n\n1+τ eλ−1\n\nwhich readily makes way for further analysis.\nFor example, under the collision channel model, Y (x) =\ne−(x+τ λ)[x + λ(1 + τ )]. And supx≥0 Y (x) is then attained\nwith x = 1 − λ(1 + τ ), so (8) reduces to the transcendental\n. Solving numerically\nequation ηc,c = sup\nfor τ = 0.01, we ﬁnd that ηc,c = 0.865 packets per unit\ntime (packets/T ), which is equal to the corresponding value\ncalculated from Kleinrock and Tobagi’s throughput expres-\nsion for slotted non-persistent CSMA, i.e., equation (8) of\n[5]. (Recall that the non-persistent CSMA is equivalent to\nCSMA with IFT.) They also reported that as τ → 0, CSMA\ncould approach perfect (collision) channel utilization, or 100%\nefﬁciency, which can be shown here as well. While usage of\n(8) is probably limited to numerical solutions, an equivalent\nclosed form expression can be obtained for Poisson arrivals:\n\nTheorem 3. For Poisson distributed packet arrival, the maxi-\nmum achievable stable throughput of CSMA, ηc,c, is equiva-\nlently given by both\n\n(cid:8)\nλ : λ < 1\n\ne−x\n\n1 + τ sup\nx≥0\n\n(cid:7)(cid:9)\n\nCn\n\nxn\nn!\n\n(9)\n\n∞(cid:2)\n\nn=1\n\n(cid:6)\nλ +\n∞(cid:2)\n\n1\n\ne−x\n\n1 + τ − e−x\n\nηc,c = sup\n(10)\nx≥0\n1+τ limn→∞ Cn, then there exists a constant\n1+τ C = 1\nIf ηc,c > 1\nA > 0 such that the control pt = A/Xt for Xt > A yields\nthe optimal throughput ηc,c.\n\nn=1\n\n.\n\nCn\n\nxn\nn!\n\n(cid:5)∞\nn=1 Cn\n\nLet y(x) = e−x(λ+\n\nProof: Observe that by solving directly for λ from the\ninequality in (9), which is an operation that is independent of\nx, we can obtain the equivalent closed form expression for ηc,c\nof (10). So, to prove the ﬁrst part of the theorem it remains\nonly to show that (9) and (8) are equivalent.\nxn\nn! ). Then y(x+τ λ) = Y (x);\ni.e., Y (x) of (7) is a translation of y(x) by −τ λ. (Recall that\nτ ∈ (0,∞) and τ λ ≥ 0.) To obtain (9), we need to show that\nsupx≥0 Y (x) = supx≥0 y(x) holds within the solution space\nof the inequality λ < 1\n1+τ supx≥0 Y (x), and thus this solution\nspace must then be identical to that of λ < 1\n1+τ supx≥0 y(x),\nwith which (9) will follow by the deﬁnition of ηc,c in (8).\n\nConsider ﬁrst the case in which y(x) does not achieve\nits supremum. Then together with Property 5 of [2], we\n\nηc,c = sup\n\nand\n\ncan also see that supx≥0 y(x) = limx→∞ y(x) = C. Since\nY (x) = y(x + τ λ), it follows that Y (x) will also not achieve\nits supremum, and so for all τ ∈ (0,∞) and τ λ ≥ 0,\nsupx≥0 y(x + τ λ) = limx→∞ y(x + τ λ) = C. Then for\nall τ ∈ (0,∞) and τ λ ≥ 0, supx≥0 y(x) = supx≥0 Y (x).\nTherefore, by the deﬁnition of ηc,c in (8), we have ηc,c =\n1+τ supx≥0 y(x)}, as given by (9).\nsup{λ : λ < 1\nsome ﬁnite x0 ≥ 0. Then for all λ ∈ [0, x0/τ ],\nY (x) = Y (xo − τ λ) = y(x0) = sup\nx≥0\n\n(11)\nAlso, for all x ≥ 0, y(x) ≤ e−xλ+x. So, for all λ ∈ [0, x0/τ ],\n\nNow consider the case in which supx≥0 y(x) = y(xo) at\n\ny(x).\n\nsup\nx≥0\n\n1\n1+τ supx≥0 Y (x) =\n≤\n≤\n1+τ\n≤ x0\nτ .\n\n1\n\n(cid:4)\n\n(cid:3)\n1\n1+τ supx≥0 y(x)\n(cid:3)\n(cid:4)\ne−x0λ + x0\n1\ne−x0 + τ\n\n1+τ\n\nx0\nτ\n\nIt follows that for all λ ∈ [0,\n1\n1+τ supx≥0 Y (x)], the identity\nof (11) holds, which implies that the solution spaces of {λ :\n1+τ supx≥0 y(x)} are\nλ < 1\nidentical. Therefore, by the deﬁnition of ηc,c in (8), ηc,c can\nbe expressed equivalently by (9) for this case as well.\n\n1+τ supx≥0 Y (x)} and {λ : λ < 1\n\nBy Theorem 3, if we have ηc,c = 1\n\nThe second part of this theorem can be proved by directly\napplying the steps for the analogous result for S-ALOHA\ngiven in the proof of Theorem 2 in [2].\n1+τ C, which occurs when\nC = limn→∞ Cn = supn≥1 Cn, then open-loop control can\nalready attain the maximum stable throughput, i.e., ηc,c = ηc,o;\notherwise, closed-loop control with pt = A/Xt should be used\nto achieve the optimal throughput ηc,c > ηc,o (cf. [2]).\n\nC. CSMA’s Throughput in Relation with S-ALOHA’s\n\nWe can straightforwardly adapt the derivation in [2] to\nobtain S-ALOHA’s optimal closed-loop throughput for a slot\nsize of 1 + τ time units. Denoting said throughput by ηa,c,\nsuch a derivation will yield\n\nηa,c = sup\nx≥0\n\ne−x\n\n1\n\n1 + τ\n\nCn\n\nxn\nn!\n\n.\n\n(12)\n\n∞(cid:2)\n\nn=1\n\n1\n\nxn\nn!\n\ne−x\n\n1+τ−e−x\n\nturns out,\n\n(cid:5)∞\nn=1 Cn\n\nComparing (10) and (12), we see the only difference be-\ntween closed-loop CSMA and S-ALOHA comes down to just\n1+τ ∈ (0, 1),\na single −e−x term in the denominator. Since\nwhenever sup0≥0\nis achieved by an\nx ∈ [0,∞), due to said −e−x term, CSMA’s maximum\nthroughput will always be higher than that of S-ALOHA.\nBut as it\nthis advantage will diminish as the\nchannel supports more MPR. Though, before we can formally\ndescribe this outcome, we need to deﬁne what is meant by\nsupporting more MPR. Since a larger expected success for a\ntransmission set corresponds to a better MPR capability for\nthat set, accordingly, we can assert the following deﬁnition.\nDeﬁnition 1 (MPR Strength): Consider two channels given\nn }\nrespectively by their expected transmission successes {C(1)\nand {C(2)\nn } has a\nn }, n ≥ 1. We say that the channel with {C(2)\nn } if there\nstronger MPR strength than the channel with {C(1)\n\n\f272\n\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\n\nTHROUGHPUTS AND EFFICIENCIES OF S-ALOHA AND CSMA FOR q-ORTHOGONAL-CODES CHANNEL WITH PROPAGATION DELAY τ = 0.01\n\nTABLE I\n\nNo. of codes (q)\n\nC\n\nηc,c\n\nηa,c\n\n1\n2\n3\n4\n5\n10\n\n1.0000\n1.0000\n1.3333\n1.6875\n2.0480\n3.8742\n\n0.8655\n0.9652\n1.1752\n1.4895\n1.8346\n3.6425\n\n0.3642\n0.7285\n1.0927\n1.4569\n1.8212\n3.6424\n\nηc,c\n\nC\n\n0.8655\n0.9652\n0.8814\n0.8826\n0.8958\n0.9402\n\nηa,c\n\nC\n\n0.3642\n0.7285\n0.8195\n0.8634\n0.8893\n0.9402\n\nxc\n\nxa\n\n0.1345\n0.4865\n2.1706\n3.5994\n4.8034\n9.9955\n\n1.0000\n2.0000\n3.0000\n4.0000\n5.0000\n10.0000\n\nn > C(1)\n\nn ∀n /∈ N .\n\nexists a non-empty set N = {n : C(2)\nn } and that\nC(2)\nn = C(1)\nSince {Cn} directly determines the value of the summation\nin (10) and (12), Deﬁnition 1 gives a sufﬁcient condition\nfor attaining greater throughput; i.e., ηc,c and ηa,c are in-\ncreasing functions of MPR strength. Moreover, we can show\na stronger MPR strength also leads to a greater x that\nachieves the supremum in (10). For brevity, let Υ(x,{Cn}) =\nn! , where {Cn} denotes a set of Cn, n ≥ 1.\n1+τ−e−x\nLemma 1. For all expected transmission success {C(1)\nn } with\nx1 = arg supx≥0 Υ(x,{C(1)\nn }) < ∞, there exists a {C(2)\nn }\nwith x2 = arg supx≥0 Υ(x,{C(2)\nn }) < ∞ such that {C(2)\nn }\nhas stronger MPR strength than {C(1)\n\n(cid:5)∞\nn=1 Cn\n\ne−x\n\nxn\n\nn } and x2 > x1.\n(cid:5)∞\nn=1 Cn\n\nThe proof is given in Appendix C. Note that an ana-\nlogue to Lemma 1 for S-ALOHA can be stated by sub-\nstituting Υ(x,{Cn}) with Γ(x,{Cn}) = e−x\nxn\nn! .9\nMoreover, it can be shown that arg supx≥0 Υ(x,{Cn}) ≤\narg supx≥0 Γ(x,{Cn}), with equality if and only if Cn = 0\nfor all n. The relationship between CSMA and S-ALOHA is\nfurther revealed by employing Lemma 1:\n\n1+τ\n\nTheorem 4. For Poisson distributed packet arrival, as the\nchannel’s MPR strength becomes stronger, the maximum sta-\nble throughput achievable by CSMA, ηc,c, approaches the\nmaximum stable throughput achievable by S-ALOHA, ηa,c. In\nthe limit as MPR strength becomes stronger, ηc,c = ηa,c and\nthe two protocols both have efﬁciency of 1.\n\nProof: If the MPR channel’s expected transmission suc-\ncess {Cn} has limit C = supn≥1 Cn, then we know from the\nproof of our Theorem 3 and Property 5 of [2], respectively,\nthat the best that CSMA and S-ALOHA can achieve are\ntheir open-loop throughputs, which are the same. Therefore,\n1+τ C to start with and the proof is\nηc,c = ηa,c = ηa,o = 1\nalready complete for this case.\nSo let us consider now only channels with C < supn≥1 Cn,\nnamely those with a {Cn} such that Υ(x,{Cn}) achieves\nits supremum at some x ∈ [0,∞). Consider a sequence\nof expected transmission successes with increasing MPR\nn }, . . .}. Let xi =\nstrength {{C(i)\narg supx≥0 Υ(x,{C(i)\na,c to be the re-\nspective maximum stable throughput of CSMA and S-ALOHA\nn }.\nfor channel {C(i)\n\nn },{C(2)\nn }). Denote η(i)\n\nn },{C(3)\nc,c and η(i)\n\nn }}i≥1= {{C(1)\n\n9This is because, apparent\n\nfrom Appendix C, dΓ(x0,{Cn})/dx =\n−Γ(x,{Cn})+C(x, {Cn}), so Γ(x, {Cn}) has identities similar to (16) and\n(17). Note that both dΥ(x, {Cn})/dx and dΓ(x, {Cn})/dx are linear ODEs.\n\nTHROUGHPUTS AND EFFICIENCIES OF S-ALOHA AND CSMA FOR THE\n\nN -USER CHANNEL WITH PROPAGATION DELAY τ = 0.01\n\nTABLE II\n\nC = N\n\nηc,c\n\nηa,c\n\n1\n2\n3\n4\n5\n10\n\n0.8655\n1.1541\n1.5570\n2.0455\n2.5916\n5.7775\n\n0.3642\n0.8316\n1.3575\n1.9231\n2.5184\n5.7737\n\nηc,c\n\nC\n\n0.8655\n0.5770\n0.5190\n0.5114\n0.5183\n0.5778\n\nηa,c\n\nC\n\n0.3642\n0.4158\n0.4525\n0.4808\n0.5037\n0.5774\n\nxc\n\nxa\n\n0.1345\n0.8097\n1.7735\n2.6496\n3.4654\n7.2872\n\n1.0000\n1.6180\n2.2695\n2.9452\n3.6395\n7.2970\n\n1\n\n(cid:5)∞\nn=1 C(i)\n\nc,c ≤\nFrom (10) and (12) we can see an upper bound: η(i)\n1+τ−e−xi supx≥0 e−x\nη(i)\na,c. Be-\ncause e−x > 0 for all x ∈ [0,∞), we also have a lower bound\na,c, with equality if and only if i = 1 and C(1)\nof η(i)\nn = 0\nfor all n. Stated equivalently, if we let γi = 1+τ\n1+τ−e−xi , then\n\nc,c ≥ η(i)\n\n1+τ−e−xi\n\nxn\nn! =\n\n1+τ\n\nn\n\nη(i)\na,c < η(i)\n\nc,c ≤ γiη(i)\n\na,c\n\nfor all i > 1.\n\n(13)\n\nn\n\nn\n\n<\n\n1+τ\n\n1+τ\n\nn = max{C(j)\n\nn }}i≥1 with C(j)\n\n} is constructed from {C(i)\n\nBy our deﬁnition of stronger MPR strength, given any\nn } in our sequence {{C(i)\nn }}i≥1, there must exist a {C(j)\nn },\n{C(i)\nn } = n for all\nj ≥ i, in {{C(i)\nn ≤ (cid:8)xi + 1(cid:9), where (cid:8)xi + 1(cid:9) denotes the largest integer less\nthan or equal to xi + 1. Thereafter in the sequence, {C(j+1)\n}\nmust satisfy the construction method given in the proof of\nLemma 1, as if {C(j+1)\nn } with that\nmethod. So, by Lemma 1 we can construct from {xi}i≥1 a\nsubsequence {ˆxk}k≥1, with ˆxk+1 > ˆxk, and by our deﬁnition\nof higher MPR strength there does not exist a subsequence in\n{xi}i≥1 that is constant or strictly decreasing. Then because\n1+τ−e−ˆxk for all k, we have limi→∞ γi = 1+,\n1+τ−e−ˆxk+1\ni.e., that {γi}i≥1 is approaching 1 from above. Therefore,\nalong with (13), as the MPR strength becomes stronger with\neach i, η(i)\nFinally, in the limit as MPR strength increases, we have the\nideal MPR channel that has Cn = n for all n and channel\ncapacity C = ∞. Accordingly we then have C = ∞, with\nwhich ηc,c = ηa,c = ηa,o = ∞ and efﬁciency is ηc,c/C = 1.\nTheorem 4 essentially shows that as the MPR strength\nbecomes stronger, we can perform equally well without carrier\nsensing by simply accessing the channel with random schedul-\ning — i.e., closed-loop S-ALOHA. And then when the MPR\nstrength is sufﬁciently strong, in lieu of scheduling, STAs\ncould even transmit at any slot and achieve the same through-\nput performance by relying solely on the PHY layer as the\nmeans for separating the STAs’ transmissions. This conclusion\nregarding when MAC-layer scheduling becomes unnecessary\nby virtue of the PHY layer’s MPR strength has been pointed\n\nc,c is approaching η(i)\n\na,c from above.\n\n\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\n\n273\n\nCSMA\nS−ALOHA\nChannel capacity\nτ = 0\nτ = 0.1\nτ = 0.5\nτ = 1.0\nτ = 10\n\n4\n\n3.5\n\n3\n\n2.5\n\n2\n\n1.5\n\n1\n\n0.5\n\n)\ne\nm\n\ni\nt\n \nt\ni\nn\nu\n\n \nr\ne\np\n\n \ns\nt\ne\nk\nc\na\np\n(\n \nt\nu\np\nh\ng\nu\no\nr\nh\nt\n \ne\nl\nb\na\nt\ns\n \n\nm\nu\nm\ni\nx\na\nM\n\n0\n\n \n1\n\n2\n\n3\n\n4\n\n7\nNo. of orthogonal multiuser codes (q)\n\n5\n\n6\n\n \n\n10\n\n \n\n)\ne\nm\n\ni\nt\n \nt\ni\nn\nu\n\n \nr\ne\np\n\n \ns\nt\ne\nk\nc\na\np\n(\n \nt\nu\np\nh\ng\nu\no\nr\nh\nt\n \ne\nl\nb\na\nt\ns\n \n\nm\nu\nm\ni\nx\na\nM\n\n9\n\n8\n\n7\n\n6\n\n5\n\n4\n\n3\n\n2\n\n1\n\n0\n\n \n1\n\n8\n\n9\n\n10\n\nCSMA\nS−ALOHA\nChannel capacity\nτ = 0\nτ = 0.1\nτ = 0.5\nτ = 1.0\nτ = 10\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nNo. of supported users (N)\n\nFig. 3. Maximum stable throughput of CSMA and S-ALOHA for the q-\northogonal codes MPR channel with various propagation delays (τ ). The\nchannel’s MPR capacity is displayed for comparison. As in Figs. 4–6, note\nalso the overall throughput-lowering effect of τ .\n\nFig. 5. Maximum stable throughput of CSMA and S-ALOHA for the N-\nuser MPR channel with various propagation delays (τ ). The channel’s MPR\ncapacity is also displayed for comparison.\n\n1\n\n0.9\n\n0.8\n\n0.7\n\n0.6\n\n0.5\n\n0.4\n\n0.3\n\n0.2\n\n0.1\n\ny\nc\nn\ne\ni\nc\ni\nf\nf\nE\n\n0\n\n \n1\n\n2\n\n3\n\n4\n\n7\nNo. of orthogonal multiuser codes (q)\n\n5\n\n6\n\n \n\nCSMA\nS−ALOHA\nChannel capacity/q\nτ = 0\nτ = 0.1\nτ = 0.5\nτ = 1.0\nτ = 10\n\n8\n\n9\n\n10\n\ny\nc\nn\ne\ni\nc\ni\nf\nf\nE\n\n1\n\n0.9\n\n0.8\n\n0.7\n\n0.6\n\n0.5\n\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n0\n\n \n1\n\n \n\nCSMA\nS−ALOHA\nChannel capacity/N\nτ = 0\nτ = 0.1\nτ = 0.5\nτ = 1.0\nτ = 10\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n80\n\n90\n\n100\n\nNo. of supported users (N)\n\nFig. 4. Efﬁciency of CSMA and S-ALOHA for the q-orthogonal codes MPR\nchannel with various propagation delays (τ ). The channel’s MPR capacity\nnormalized by q is also displayed for comparison.\n\nFig. 6. Efﬁciency of CSMA and S-ALOHA for the N-user MPR channel\nwith various propagation delays (τ ). The channel’s MPR capacity normalized\nby N is also displayed for comparison. Note that the horizontal scale here\nis different from that of Fig. 5 in order to show the relative growth of the\nefﬁciency curves.\n\nout [25]. An additional insight herein and implicit in [2] is\nthe juncture that occurs, i.e., when closed-loop control is ﬁrst\nrendered unnecessary and open-loop control alone sufﬁces, is\nwhen the MPR channel has C = lim supn≥1 Cn = C (cf. [24]).\nTo illustrate the results in our discussion thus far, we\nplot ηc,c, ηa,c and their efﬁciencies in Figs. 3–6 for the\nq-orthogonal-codes and N -user MPR channels. These val-\nues and the x’s that attain them are also given in Ta-\nbles I–II, where xc = arg supx≥0 Υ(x,{Cn}) and xa =\narg supx≥0 Γ(x,{Cn}).\nObserve that the N -user channel has N = {N} at each\nincrement in channel capacity; so, its MPR strength is be-\ncoming stronger. The same is true for the q-orthogonal-codes\nchannel, which has N = {n : n ≥ 1} at each q because\nC(q+1)\nn , ∀n ≥ 1. But\nn\nwhile their associated throughputs are increasing with channel\n\nq+1 )n−1 > n(1− 1\n\nq )n−1 = C(q)\n\n= n(1− 1\n\n1\n\ncapacity, they also settle into linear growths in Figs. 3 and 5.\nActually, this is expected for the q-orthogonal-codes channel,\n1+τ qe−1 [2] and so its growth has a constant\nsince ηa,c = 1\n1+τ e−1. And, an approximately linear growth for\nslope of\nthe N -user channel has been predicted by [26], wherein\nN ln N and N − √\nthroughputs of random access protocols for said channel are\n√\nN when N is\nN are o(N ) when N is large,\nlarge. Because\nthis channel’s ηa,c will eventually be growing approximately\nlinearly at a small positive slope.\n\nbounded between N − √\n\n√\nN ln N and\n\nThese throughputs’ linear asymptotic growth trends are\nas well reﬂected in Figs. 4 and 6, where the associated\nefﬁciencies become nearly constant with MPR strength. This\ntoo is expected for the q-orthogonal-codes channel, since\nq ) → e−1/q at large q, it can be easily shown that\n(1 − 1\n\n\f274\n\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\n\nC → qe−1 at large q (as conﬁrmed by the normalized capacity\nin Fig. 4); thus, its efﬁciency evolves into ∼ 1\n1+τ at large q. As\nηa,c/N is bounded between 1 −(cid:12)\nfor the N -user MPR channel, said trend is due to the fact that\n1/N\n\n(ln N )/N and 1 −(cid:12)\n\nat large N , where both increase at a slow rate.\n\nInterestingly, while S-ALOHA’s efﬁciency always rises\nfrom below, CSMA’s efﬁciency may initially reach a local\nmaximum — even as high as 1 when τ is small for some\nchannels — before tapering off to approach S-ALOHA’s.\nThis perhaps unintuitive effect can be shown from (15). For\ninstance, as long as supn≥1 Cn ≤ C1, efﬁciency can be\nmaintained at or increase toward 1 (cf. Fig. 4). And even after\nsaid local maximum, CSMA’s efﬁciency (and throughput) can\nstill be considerably higher than S-ALOHA’s. This indicates\nCSMA can be much more efﬁcient than S-ALOHA at utilizing\nthe MPR capability in the region where the SU channel is just\nbeginning to evolve into a MU one. We discuss in Section\nIV how this region is an important one to consider because\nresources for enabling more MPR can be scarce in practice.\n\nD. Connection to Results from Classical Multiaccess Theory\n\n1\n\n(cid:5)∞\nalternative\nn=1 Cn\n\nxn\nn!\n\nis\ni.e.,\n\nthe\n\nis\n\ninterpretation\n\nequivalent\nsupremum of\n\nthat\nAn\nτ supx≥0 e−x\nto\nτ supX∼P oiss(x),x≥0 E[CX ],\n1\nthe\nexpectation of CX over all X, where X is a Poisson\ndistributed random variable with mean x [2]. Because\neach TP for S-ALOHA is 1 + τ, be it idle or not, (12)\ncan be explained by said interpretation via renewal theory\narguments.10 This applies to CSMA too: Due to the beneﬁts of\nchannel sensing, its difference from S-ALOHA is that an idle\nslot lasts only τ time units, so the TP for CSMA has expected\nvalue of (1 + τ )P [X > 0] + τ P [X = 0] = 1 + τ − e−x,\nwhich is reﬂected in (10).\n\nAnother perspective on CSMA’s diminishing throughput\ngain also follows. As the MPR strength becomes stronger,\nSTAs can then transmit at any slot and have a lower chance of\ncollision; thus, there are fewer idle slots. This is conﬁrmed by\nxc and xa both increasing with MPR strength, i.e., P [X = 0]\nis decreasing. When channel activities are viewed solely as a\nrenewal process, the only difference between CSMA and S-\nALOHA is that the former has shorter idle slots, and so, if idle\nslots are becoming fewer, then the TPs for both protocols must\nbe approaching the same duration; ergo, the same throughput.\nFinally, note that X, the number of transmission attempts\nin each slot, is actually the overall offered network trafﬁc, i.e.,\nthe aggregate of both new and backlogged trafﬁc. That’s why\nour ηc,c value for the collision channel is the same as that from\nKleinrock and Tobagi [5] despite the fact that their derivation,\nlike many multiaccess research of that era, hinges on the\nﬂawed assumption [2] [17, §4.2.2] that the network’s offered\ntrafﬁc is approximately Poisson distributed. Note that this is\nalso true for the CSMA with MPR throughputs calculated\nfrom Gau’s equation (5) of [14], which actually has the same\nPoisson trafﬁc assumption.\n\n10By renewal theory arguments, throughput (as measured in units of packets\nper unit time) is the expected duration of successful attempts divided by\nthe expected duration of the transmission period (i.e., renewal cycle), and\nmultiplied by the expected number of packets in each successful attempt.\n\nIV. APPLYING MPR IN PRACTICE AND PERFORMANCE OF\n\n802.11 WLANS WITH MU-MIMO\n\nA. Insights for Practical Designs of MPR-enabled Networks\nPerhaps not emphasized enough in MPR multiaccess re-\nsearch is the unstated assumption that even as more simulta-\nneously transmitted packets can be successfully received, the\npacket’s data rate has to be maintained at some minimum level\nin order to achieve actual increase in network throughput. In\nother words, we cannot examine solely the improvement on\nmultiaccess throughput expressed in packets per unit time; we\nneed to also consider whether and how much the packet’s data\nrate has been sacriﬁced by the diverting of channel resources to\nsupport MU capability. Simply put, if we denote r1 and η1 to\nbe the respective data rate (in bits per packet) and multiaccess\nthroughput (in packets per unit time) for a PHY layer, and\nr2 and η2 for those of another PHY layer with stronger MPR\nstrength, then, even though η2 > η1, we still need\n\nη2/η1 > r1/r2\n\n(14)\n\nin order for the latter PHY layer to deliver a higher network\nthroughput of η2r2, in bits per unit time.\n\nThe basis for MU capability is to exploit resources in the\nchannel that provide orthogonal properties to support MPR.\nUltimately, this is equivalent to ﬁnding what is known as\ndegrees of freedom (DoF) from the channel to multiplex data\nstreams [3, §1]. The design criteria that we describe here is:\nA resource that gives rise to new DoF should be used to\nincrease MU capability when (14) can be satisﬁed; otherwise,\nthe network throughput can be made higher by applying the\nresource to instead increase the data rate of each packet.\n\nB. WLAN Design Constraints and Advantages of MU-MIMO\nMIMO signaling with multiple antennas exploits the spatial\ndiversity “resource” in multipaths of a wireless channel to\ngenerate DoF that can be used for boosting a point-to-point\nlink’s spectral efﬁciency or robustness. Because of indepen-\ndent fading statistics among users’ propagation paths, MU\ndiversity also exists as a resource for creating DoF to multiplex\nMU data streams [27]. The challenge in designing MIMO\nsystems centers on balancing the trade-offs among said various\ngains with the available DoF.\n\nWhile MIMO spatial multiplexing of additional data\nstreams increases data rates linearly, the SNR required to\nrobustly receive them also grows noticeably. In fact, a cur-\nrently impractical level of SNR is required to receive just a\nfew spatial streams signaled at high orders of modulation and\ncoding rates [28, §5.3]. Contrastingly, indoor measurements\nshow MU-MIMO can achieve considerably higher spectral\nefﬁciencies than SU-MIMO for the same SNR and number of\nreceive antennas per user [29]–[30]. This implies that, as SNR\nand number of receive antennas are typical WLAN design\nconstraints,\nthe extra DoF obtained from adding transmit\nantennas should be applied on MU multiplexing rather than on\nraising the level of a SU’s spatial multiplexing toward levels\nthat the system cannot sustain robustly. And since a PHY layer\nthat uses these new DoF to improve its SU data rate cannot\npractically do so below a certain SNR, when this PHY layer is\ncompared to another that instead diverts these DoF to increase\n\n\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\n\n275\n\n)\ns\np\nb\nG\n\n(\n \nt\nu\np\nh\ng\nu\no\nr\nh\nt\n \nk\nr\no\nw\nt\ne\nn\n \ne\nt\na\ng\ne\nr\ng\ng\nA\n\n4\n\n3.5\n\n3\n\n2.5\n\n2\n\n1.5\n\n1\n\n0.5\n\n0\n\n \n1\n\n11n A−MPDU limit\n8 x 11n A−MPDU limit\n1 s.s. per user\n2 s.s. per user\n3 s.s. per user\n4 s.s. per user\n\n \n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nNo. of MU−MIMO users (M)\n\ny\nc\nn\ne\ni\nc\ni\nf\nf\nE\n\n1\n\n0.9\n\n0.8\n\n0.7\n\n0.6\n\n0.5\n\n0.4\n\n0.3\n\n0.2\n\n \n1\n\n \n\n11n A−MPDU limit\n8 x 11n A−MPDU limit\n1 s.s. per user\n2 s.s. per user\n3 s.s. per user\n4 s.s. per user\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nNo. of MU−MIMO users (M)\n\nFig. 7. Aggregate network throughput of the proposed 802.11ac WLAN\nfor 1–4 spatial streams (s.s.) per user. As in Fig. 8, the A-MPDU size limits\nconsidered are 65 KB and 520 KB, which are, respectively, the maximum\ndeﬁned in 802.11n and eight times of that; note that larger sizes do not show\nchanges to the trends. 802.11ac proposes to support up to four MU-MIMO\nusers, where each user can have up to 4 s.s. for a system maximum of 8 s.s.\n802.11ac has a maximum aggregate throughput of at least 1 Gbps.\n\nA SELECTION OF DATA RATES FOR AN 80-MHZ 802.11AC OFDM\n\nTABLE III\n\nSYMBOL WITH SHORT GUARD INTERVAL (400 NS) [11]\n\nNo. of\n\nModulation\n\nspatial streams\n\n1\n1\n2\n3\n4\n\nBPSK\n\n64-QAM\n64-QAM\n64-QAM\n64-QAM\n\nCode\nrate\n\n1/2\n5/6\n5/6\n5/6\n5/6\n\nSpectral efﬁciency\n\n(Mb/s/Hz)\n\n0.40625\n4.0625\n8.125\n12.1875\n16.25\n\nData rate\n(Mbps)\n\n32.5\n325.0\n650.0\n975.0\n1300.0\n\nthe system’s MU capacity, we can also expect (14) to likely\nbe satisﬁed. Thus, MU diversity can be an effective resource\nfor realizing throughput gains from MPR in current WLANs.\nLastly, we note that ﬁnding new channel resources to\nenhance MPR can become progressively difﬁcult because of\npractical issues. For instance, the number of antennas is a\npotential constraint due to space limitations and costs. Also,\nthe maximum transmit power allowable by regulatory rules is a\nconstraint on the power density per spatial stream, limiting the\nachievable level of MU multiplexing. Consequently, although\nthe throughput gain with the next generation of WLANs\npromises to be rewarding, the increment in MPR capacity will\nonly be moderate, not dramatic.\n\nC. Performance Results and Enhancements for MU-based\n802.11ac WLANs\n\nTo see the beneﬁts from applying MPR to CSMA wireless\nnetworks in practice, we have simulated the performance of\nWLANs based on the initial draft text (version D0.1) [11] pro-\nposed for the 802.11ac standard.11 While this standardization\n\n11The particular parameters we took from D0.1 have not been changed in\nD4.0, the latest and nearly ﬁnal draft version at this paper’s press time (Nov.\n2012).\n\nFig. 8.\nEfﬁciency of the proposed 802.11ac WLAN in the infrastructure\nmode. The decrease in efﬁciency with M indicates the current 802.11 SU-\noriented MAC cannot fully utilize the PHY layer’s MU capacity.\n\neffort is still ongoing and industry dynamics are difﬁcult to\npredict, our results provide the best means for speculating at\npresent about how the ﬁnalized speciﬁcation may perform.\n\nThe plan for 802.11ac to perform MU-MIMO is to extend\nthe SU-MIMO framework of 802.11n. As a result, the funda-\nmental components in the 802.11n PHY layer are adopted.\nTable III lists the 80-MHz data rates from [11] that we\nsimulated. Details of our simulation framework are explained\nin Table IV. Of note is that 802.11ac has adapted the same\nMAC backoff policy as 802.11n. And since this policy’s\nparameters are originally designed for a SU PHY layer, the\nsimulation results represent those of a SU-oriented MAC layer.\nIn Figs. 7-8 we plot the network throughput and efﬁciency\nfor the described framework. Fig. 7 shows that MU-MIMO\ncan offer signiﬁcant increase in network throughput. However,\nthese throughputs exhibit a ceiling, and hence the corre-\nsponding efﬁciencies in Fig. 8 also show a gradual decrease\nwith M . To remedy this effect, we extend the maximum A-\nMPDU size to 8 times that of the 802.11n limits. This would\nmitigate the degradation on the ratio of preamble overhead to\npayload duration as the packet’s data rate increases. But while\nthis method improves performances, which are also plotted\nin Figs. 7-8,\nthe downward trend in efﬁciencies persists.\nEvidently such performances are those of a MAC layer that\nis not optimized for its underlying PHY layers; otherwise,\nas discussed in Section III, the throughputs will unboundedly\nscale with MU capacity. Note that we have found the general\ntrends displayed of the plots in Figs. 7-8 remain unchanged\nwhen the number of clients in the network is varied.\n\nThese results clearly indicate that the current SU-oriented\nMAC layer in 802.11 cannot fully utilize the PHY layer’s MU\ncapacity. As expected from what we pointed out in Section III,\nwhen the MU capacity increases, the number of idle slots has\nto correspondingly decrease to achieve the optimal throughput.\nThus, the fundamentals for 802.11ac can be enhanced with\nan appropriate cross-layer design approach, in particular, by\napplying the theory of CSMA with MPR that we discussed.\n\n\f276\n\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\n\nDETAILS OF OUR 802.11AC WLAN SIMULATION FRAMEWORK\n\nTABLE IV\n\nSimulation parameter\n\nValue\n\nRemarks\n\nOperating mode\n\nNo. of AP\n\nNo. of clients\n\nInfrastructure\n\nmode\n\n1\n29\n\nNo. of simultaneous\n\ntransmissions\n\nDownlink: M\nUplink: 1 to M\n\nChannel width and PHY data\n\nSee Table III\n\nrates\n\nPHY header duration\n\nNo. of LTFs in preamble\n\n16 μs\n\nDepends on\nno. of spatial\nstreams, per\n\n[11]\n\nDownlink and uplink transmissions cannot concurrently coexist; i.e., when STA(s) transmit together\nwith the AP, none of their frames are correctly received.\nAP transmissions to the clients are called downlink [6].\nClient transmissions to the AP are called uplink [6].\nM is the maximum no. of simultaneous transmissions allowable by the MU-MIMO PHY layer. Note\nthat, unlike in our simulations, TGac has ultimately decided to deﬁne only downlink MU-MIMO in\nthe current 802.11ac standard, despite early proposals to also adapt uplink MU-MIMO and leaving\nthis for potential consideration in future amendments.\nOnly those signaled by 64-QAM at rate 5/6 are used here. Each client’s link has the same data rate.\nSNR is assumed sufﬁcient enough for a negligible PER.\nThis is based on the header structure proposed in [11], i.e., the SIG ﬁelds.\nThis is necessary for receivers to estimate the MIMO channel properly (cf. 802.11n [6]). These Long\nTraining Fields (LTFs) are those proposed in [11].\n\nMAC backoff policy\n\nAs in 802.11n\n\nRTS-CTS frame exchange\n\nTXOP duration\n\nFrame aggregation\n\nEnforced for\nall TXOPs\n3.008 ms\n\nEnforced for\nall data frames\n\nMPDUs per A-MPDU\n\n64\n\nA-MPDU size\n\nAcknowledgement (ACK)\n\npolicy\n\n65 535 bytes\nImplicit and\nCompressed\nBlockACK\n\nCSI feedback or channel\n\nNot included\n\nsounding\n\n802.11ac has adapted essentially the same backoff policy as in 802.11n. Note that these parameters\nwere designed for a SU-oriented PHY.\nTransmitted with 1 spatial stream by BPSK at rate 1/2 (cf. Table III), as in practice to maximize\neffect against hidden nodes.\nThis is the maximum speciﬁed for OFDM-based PHY layers by 802.11 [6].\nEach TXOP is packed with as many A-MPDUs as possible. In 802.11 parlance, an aggregated data\nframe is known as aggregated MPDU (A-MPDU).\nThis is the maximum speciﬁed by 802.11 [6].\nThis is the maximum speciﬁed by 802.11 [6]; 802.11ac is proposing a maximum 16 times of that.\nWe assume the M clients ACK simultaneously via uplink MU-MIMO. Although currently in\n802.11ac each client’s ACK is sent individually to the AP, our results will still show the general\nexpected performance trend. Implicit and Compressed BlockACK minimizes ACK overheads.\n\nObtaining channel state information (CSI), which is essential for MU-MIMO, can incur small\noverheads. Since our goal is on showing the general expected performance, we have assumed accurate\nCSI is known at the transmitter.\n\nNetwork trafﬁc model\n\nSTAs always\nsaturated with\npackets to send\n\nThis forces the system to operate in a critical region where it is on the verge of drifting into instability,\ni.e, throughput approaching zero and delay approaching inﬁnity, allowing us to examine a protocol’s\nfundamental performance.\n\nNo. of iterations in simulation\n\n100 000\n\nRunning more, e.g. 1 000 000, did not exhibit any signiﬁcant differences in the scale of our plots.\n\nAPPENDIX A: STATE TRANSITION PROBABILITIES OF\n\nMARKOV CHAIN {Xt}\n\nLet Pi,k be the conditional probability that, if j packets are\nbacklogged at the start of the current TP, then k packets will\nbe backlogged at the start of the next TP. With Λk denoting\nthe probability there are exactly k new arrivals during the 1/τ\nslots when there are transmissions (e.g., Λ0 = ˆλ1/τ\n), we have:\n\n0\n\nˆλnCn,nΛ0\nn(cid:2)\nCn,sΛk−(n−s), for k ≥ 1;\nj(cid:2)\ni(cid:2)\ns=max(0,n−k)\n\nCn+j,n+sΛs−k, for i ≥ 1\n\n∞(cid:2)\n\nn=1\n\n• P0,0 = ˆλ0 +\n∞(cid:2)\nˆλn\n∞(cid:2)\n\n• P0,k =\n\nn=1\n\n• Pi,i−k =\n\nˆλn\nand 1 ≤ k < i;\n\nn=0\n\n• Pi,i = ˆλ0Bi(0) +\ni(cid:2)\n\ni ≥ 1; and\n∞(cid:2)\n• Pi,i+k =\n\nˆλn\n\nfor i ≥ 1 and k ≥ 1.\n\nj=k\n\nn=0\n\nj=k\n\nBi(j)\n∞(cid:2)\ni(cid:2)\n\ns=k\n\nˆλn\n\nn=0\n\nj=0\n\nj(cid:2)\n\ns=0\n\nBi(j)\nn+j(cid:2)\n\nBi(j)\n\ns=max(0,n−k)\n\nAPPENDIX B: PROOF OF (3) IS BOUNDED BELOW\n\nk=1\n\nk=1\n\nD(i) = − i(cid:2)\n= − i(cid:2)\n= − i(cid:2)\n> − i(cid:2)\n> − i(cid:2)\n> −L,\n\nj=1\n\nj=1\n\nj=1\n\nkPi,i−k\n∞(cid:2)\n\nk\n\nn=0\n\nBi(j)\n\nBi(j)\n\nBi(j)\n\nj=k\n\ni(cid:2)\nˆλn\n∞(cid:2)\n∞(cid:2)\n∞(cid:2)\n\nn=0\n\nn=0\n\nˆλn\n\nˆλn\n\nn=0\n\ns=k\n\nj(cid:2)\nBi(j)\nj(cid:2)\ns(cid:2)\nj(cid:2)\n\nk=1\n\ns=1\n\ns=1\n\nˆλnCn+j\n\nCn+j,n+sΛs−k\n\nkCn+j,n+sΛs−k\n\ns(cid:2)\n\nk=1\n\nΛs−k\n\nsCn+j,n+s\n\nCn+j,n+sΛs, for\n\nCn+j,sΛk−(n−s),\n\nwhere Pi,i−k and deﬁnition of Λk are given in Appendix A.\n\n\fCHAN et al.: CARRIER SENSE MULTIPLE ACCESS COMMUNICATIONS ON MULTIPACKET RECEPTION CHANNELS: THEORY AND APPLICATIONS . . .\n\n277\n\nAPPENDIX C: PROOF OF LEMMA 1\n\nACKNOWLEDGMENT\n\nProof: We ﬁrst establish some properties to be used in\nthe proof. Consider an x0 = arg supx≥0 Υ(x,{Cn}) for some\ngeneral {Cn} where x0 < ∞. The concavity assumption we\nhave on expected transmission successes {Cn} implies that\nΥ(x,{Cn}) is concave down, and thus x0 is where the global\nmaximum occurs. Naturally, dΥ(x,{Cn})\n= 0, which after\nsome simpliﬁcation of terms can be written as\ndΥ(x0,{Cn})\n\nx=x0\n\n(cid:13)(cid:13)\n\nxn\n\ndx\n\n(cid:5)∞\nn=1 Cn\n\n(cid:5)∞\nn=1 Cn\n\n= − e−x\n\n1+τ−e−x\n\nn! + e−x\n\n1+τ\n\n(15)\nInterestingly, the ﬁrst term of dΥ(x,{Cn})\nin (15) is exactly the\nexpression for −Υ(x,{Cn}). Thus, if we denote C(x,{Cn})\nto be the second term of dΥ(x,{Cn})\n\nin (15), we will have\n\ndx\n\ndx\n\nΥ(x,{Cn}) = Υ(x0,{Cn}) = C(x0,{Cn}).\n\n(16)\n\ndx\n\nsup\nx≥0\n\nxn−1\n(n−1)! = 0.\n\nSince x0 is the global maximum, dΥ(x,{Cn})\nso it follows from (15) that\n\ndx\n\n> 0 for x < x0,\n\nn\n\nn\n\ndx\n\nΥ(x,{Cn}) < C(x,{Cn})\n\nfor x < x0.\n\nn = C(1)\n\n(17)\n< 0 for x > x0, Υ(x,{Cn}) >\nSimilarly, because dΥ(x,{Cn})\nC(x,{Cn}) for x > x0.\nn }\nWe now construct an expected transmission success {C(2)\nn } with C(2)\nthat will complete the proof. Consider a {C(2)\nn >\nC(1)\nn for all n /∈ N , where N ∈\nn for all n ∈ N and C(2)\n{n : n > x1 + 1} and N (cid:12)= ∅. In other words, {C(2)\nn } contains\none or more C(2)\nat some (integer)\nindices n > x1 + 1, while the rest of {C(2)\nn } is the same\nas {C(1)\nn <\nn }. Then we know from the proof of Theorem 3\nsupn≥1{C(2)\nthat Υ(x,{C(2)\nn }) will achieve its supremum at some ﬁnite x2.\nFrom the construction of {C(2)\nn } we can readily see that it has\nn }. So, what remains to be\nstronger MPR strength than {C(1)\nshown is that x2 > x1 with this {C(2)\nn }.\n\nn }. Further construct {C(2)\n\nn } such that limn→∞ C(2)\n\nthat are greater than C(1)\n\nObviously if x1 = 0, which happens when C(1)\n\nn }) = Υ(x,{C(1)\nn }) = C(x,{C(1)\n\nn = 0\nfor all n, then we have x2 > x1 already because by our\nconstruction of {C(2)\nn } we can only have x2 > 0. Thus, we\nneed consider only those {C(1)\nn }’s that give x1 ∈ (0,∞).\nn }) and C(x,{C(2)\nn })\nLet us compare the values of Υ(x,{C(2)\n(cid:5)\nwhen evaluated at x = x1. Let {δn} = {C(2)\nn − C(1)\nn }. Then\nn }) + e−x\nΥ(x,{C(2)\n(cid:5)\nxn\nn∈N δn\nn! and\n1+τ−e−x\nn }) + e−x\nC(x,{C(2)\nxn−1\nn∈N δn\n(n−1)! , where\nin both expressions all the δn terms are greater than zero.\nn }) is attained at x1, from\nBecause the supremum of Υ(x,{C(1)\nn }). Observe\n(16) we know that Υ(x1,{C(1)\nthat for all x ∈ (0,∞), since xn\nxn−1\n(n−1)! when n > x+1\nand x\nfor any τ > 0, it will also be true that\nxn−1\n(n−1)! when n > x + 1 and for any τ > 0.\n1+τ−e−x\nThus we have,\n\nn }) = C(x1,{C(1)\nn! < x\n\n1+x < 1+τ−e−x\n\nxn\nn! < 1\n\n1+x\n\n1+τ\n\n1+τ\n\n1+τ\n\n1\n\nΥ(x1,{C(1)\n< C(x1,{C(1)\n\nn }) + e−x1\n(cid:5)\n1+τ−e−x1\nn }) + e−x1\nn }) < C(x1,{C(2)\n\n1+τ\n\n(cid:5)\nxn\nn∈N δn\n1\nn!\nxn−1\n(n−1)! ,\n\n1\n\nn∈N δn\n\ni.e., Υ(x1,{C(2)\nand that the supremum of Υ(x,{C(2)\nfollows from (17) that we must have x1 < x2.\n\nn }). Finally, given this fact\nn }) is attained at x2, it\n\nThe authors would like to thank our reviewers for their\nefforts and valuable suggestions. D. S. Chan also thanks Prof.\nZ. Haas for his insightful comments.\n\nDISCLAIMER\n\nThe opinions in this paper represent only the personal views\n\nof the authors, not necessarily those of their employers.\n\nREFERENCES\n\n[1] S. Ghez, S. Verd´u, and S. C. Schwartz, “Stability properties of slotted\nALOHA with multipacket reception capability,” IEEE Trans. Autom.\nControl, vol. 33, no. 7, pp. 640–649, 1988.\n\n[2] ——, “Optimal decentralized control in the random-access multipacket\nchannel,” IEEE Trans. Autom. Control, vol. 34, no. 11, pp. 1153–1163,\n1989.\n\n[3] S. Verd´u, Multiuser Detection. Cambridge University Press, 1998.\n[4] L. Tong, Q. Zhao, and G. Mergen, “Multipacket reception in random\naccess wireless networks: from signal processing to optimal medium\naccess control,” IEEE Commun. Mag., vol. 39, no. 11, pp. 108–112,\n2001.\n\n[5] L. Kleinrock and F. Tobagi, “Packet switching in radio channels—\npart I: carrier sense multiple-access modes and their throughput-delay\ncharacteristics,” IEEE Trans. Commun., vol. 23, no. 12, pp. 1400–419,\n1975.\n\n[6] IEEE Standard for Information Technology — Telecommunications and\ninformation exchange between systems — Local and metropolitan area\nnetworks — Speciﬁc requirements — Part 11: Wireless LAN Medium\nAccess Control (MAC) and Physical Llayer (PHY) Speciﬁcations, IEEE\nStd. 802.11-2012, Mar. 2012.\n\n[7] D. S. Chan, T. Berger, and L. Tong, “On the stability and optimal de-\ncentralized throughput of CSMA with multipacket reception capability,”\nin Proc. 2004 Allerton Conf. on Comm., Control, and Computing, pp.\n1526–1535.\n\n[8] D. S. Chan, P. Suksompong, J. Chen, and T. Berger, “Improving IEEE\n802.11 performance with cross-layer design and multipacket reception\nvia multiuser iterative decoding,” IEEE 802.11-05/0946r0, Sep. 2005.\n[9] M. de Courville, M. Kamoun, J. Gosteau et al., “Another resource to\n\nexploit: multi-user diversity,” IEEE 802.11-05/2187r0, Jul. 2007.\n\n[10] E. Perahia, “VHT below 6 GHz PAR plus 5C’s,” IEEE 802.11-\n\n08/0807r4, Sep. 2008.\n\n[11] IEEE Draft Standard for Information Technology — Telecommuni-\ncations and information exchange between systems — Local and\nmetropolitan area networks — Speciﬁc requirements — Part 11: Wire-\nless LAN Medium Access Control (MAC) and Physical Llayer (PHY)\nSpeciﬁcations — Amendment 5: Enhancements for Very High Through-\nput for Operation in Bands Below 6 GHz, IEEE Std. P802.11ac/D0.1,\nJan. 2011.\n\n[12] Y. J. Zhang, P. X. Zheng, and S. C. Liew, “How does multiple-\npacket reception capability scale the performance of wireless local area\nnetworks?” IEEE Trans. Mobile Comput., vol. 8, no. 7, pp. 923–935,\n2009.\n\n[13] Y. J. Zhang, private communication, Feb. 23, 2009.\n[14] R.-H. Gau, “Modeling the slotted nonpersistent CSMA protocol for\nwireless access networks with multiple packet reception,” IEEE Com-\nmun. Lett., vol. 13, no. 10, pp. 797–799, 2009.\n\n[15] F. Babich and M. Comisso, “Theoretical analysis of asynchronous multi-\npacket reception in 802.11 networks,” IEEE Trans. Commun., vol. 58,\nno. 6, pp. 1782–1794, 2010.\n\n[16] L. Roberts, “Aloha packet system with and without slots and capture,”\n\nComputer Commun. Review, vol. 5, no. 2, pp. 28–42, 1975.\n\n[17] D. Bertsekas and R. Gallager, Data Networks, 2nd edition. Prentice-Hall,\n\n1987.\n\n[18] F. Cal`ı, M. Conti, and E. Gregori, “Dynamic tuning of the IEEE 802.11\nprotocol to achieve a theoretical throughput,” IEEE/ACM Trans. Netw.,\nvol. 8, no. 6, pp. 785–799, 2000.\n\n[19] F. Tobagi and L. Kleinrock, “Packet switching in radio channels—part\nIV: stability considerations and dynamic control in carrier sense multiple\naccess,” IEEE Trans. Commun., vol. 25, no. 10, pp. 1103–1119, 1977.\n[20] J. Meditch and C.-T. Lea, “Stability and optimization of the CSMA\nand CSMA/CD channels,” IEEE Trans. Commun., vol. 31, no. 6, pp.\n763–774, 1983.\n\n[21] A. G. Pakes, “Some conditions for ergodicity and recurrence of Markov\n\nchains,” Oper. Res., vol. 17, pp. 1058–1061, 1969.\n\n\f278\n\nIEEE TRANSACTIONS ON COMMUNICATIONS, VOL. 61, NO. 1, JANUARY 2013\n\n[22] M. Kaplan, “A sufﬁcient condition for nonergodicity of a Markov chain,”\n\nIEEE Trans. Inf. Theory, vol. 25, no. 4, pp. 470–471, 1979.\n\n[23] L. I. Sennott, P. A. Humblet, and R. Tweedie, “Mean drifts and the\nnon-ergodicity of Markov chains,” Oper. Res., vol. 31, pp. 783–789,\n1983.\n\n[24] D. S. Chan, “Random multiple access communications on multipacket\n\nchannels,” Ph.D. dissertation, Cornell Univ., New York, Jan. 2006.\n\n[25] V. Naware, G. Mergen, and L. Tong, “Stability and delay of ﬁnite user\nslotted ALOHA with multipacket reception,” IEEE Trans. Inf. Theory,\nvol. 51, no. 7, pp. 2636–2656, 2005.\n\n[26] B. S. Tsybakov, V. A. Mikhailov, and N. B. Likhanov, “Bounds for\npacket transmission rate in a random multiple access system,” Problemy\nPeredachi Informatsii, vol. 19, no. 1, pp. 61–81, 1983 (translated from\nRussian).\n\n[27] D. Gesbert, M. Kountouris, R. W. Heath Jr. et al., “Shifting the\nMIMO paradigm: from single-user to multiuser communications,” IEEE\nWireless Commun. Mag., vol. 24, no. 5, pp. 36–46, 2007.\n\n[28] E. Perahia and R. Stacey, Next Generation Wireless LANs. Cambridge\n\nUniversity Press, 2008.\n\n[29] K. Nishimori, R. Kudo, Y. Takatoti et al., “Performance evaluation of\n8x8 multi-user MIMO-OFDM testbed in an actual indoor environment,”\nin Proc. 2006 IEEE Int. Symp. on Personal, Indoor and Mobile Radio\nComm.\n\n[30] E. Aryafar, N. Anand, T. Salonidis, and E. W. Knightly, “Design and\nexperimental evaluation of multi-user beamforming in wireless LANs,”\nin Proc. 2010 Annu. Int. Conf. Mobile Comput. and Networking, pp.\n197–208.\n\nDouglas S. Chan (S’96–M’98–S’00–M’04–SM’12)\nreceived his B.A.Sc. degree in electrical engineer-\ning (EE) from Queens University, Kingston, On-\ntario, Canada. He received from Cornell University,\nIthaca, NY the M.Eng. degree in EE in May 2001\nand the Ph.D. degree in electrical and computer\nengineering (ECE) with a minor in applied mathe-\nmatics in Jan 2006. His research interests have been\non communications theory and its applications.\n\nFrom 1998 to 2000, he was with the IBM Toronto\nLab as Software Engineer and he was involved\nwith developing enterprise-scaled applications for database access, distributed\ncomputing and network management. From Jan to May 2006, he was a\nVisiting Scientist with the School of ECE at Cornell University. In July\n2006, he joined Cisco Systems, Wireless Networking Business Unit, where\nhe is currently a Technical Leader and his work includes research and\ndevelopment (R&D) of IEEE 802.11-based wireless local area networking\nproducts and their standardizations. Since 2011, he also became a member\nof the Cisco Advanced Architecture and Research team that investigates on\ncurrently emerging paradigms like Fog Computing and Internet of Things.\nIn addition, he had multiple internships in the wireless industry: Hong\nKong Telecom CSL, Mobile Networks (Radio Planning); Texas Instruments,\nCommunications Systems Lab; and Symbol Technologies, Corporate R&D\n\nDr. Chan served as the Secretary for the IEEE Signal Processing Soci-\nety Santa Clara Valley chapter for the 2007–2009 term. He has received\nrecognitions from the IEEE Standards Association for his contributions to\nthe 802.11n and 802.11y standards. He is a licensed professional engineer of\nOntario, Canada.\n\nToby Berger\n(S’60–M’66–SM’74–F’78–LF’06)\nwas born in New York, NY on September 4, 1940.\nHe received the B.E. degree in electrical engineering\nfrom Yale University, New Haven, CT in 1962, and\nthe M.S. and Ph.D. degrees in applied mathematics\nfrom Harvard University, Cambridge, MA in 1964\nand 1966.\n\nFrom 1962 to 1968 he was a Senior Scientist\nat Raytheon Company, Wayland, MA, specializing\nin communication theory, information theory, and\ncoherent signal processing. From 1968 through 2005\nhe was a faculty member at Cornell University, Ithaca, NY where he held\nthe position of Irwin and Joan Jacobs Professor of Engineering. In 2006 he\nbecame a professor in the ECE Department of the University of Virginia,\nCharlottesville, VA.\n\nProfessor Berger’s research interests include information theory, neuroin-\nformation theory, random ﬁelds, communication networks, wireless communi-\ncations, video compression, voice and signature compression and veriﬁcation,\nquantum information theory, and coherent signals processing. He is the author\nof Rate Distortion Theory: A Mathematical Basis for Data Compression and\na co-author of Digital Compression for Multimedia: Principles and Standards\nand of Information Measures for Discrete Random Fields.\n\nBerger has served as editor-in-chief of the IEEE TRANSACTIONS ON\nINFORMATION THEORY and as president of the IEEE Information Theory\nGroup. He has been a Fellow of the Guggenheim Foundation, the Japan\nSociety for Promotion of Science, the Ministry of Education of the People’s\nRepublic of China and the Fulbright Foundation. He received the 1982 Freder-\nick E. Terman Award of the American Society for Engineering Education, the\n2002 Shannon Award from the IEEE Information Theory Society, the IEEE\n2006 Leon K. Kirchmayer Graduate Teaching Award, the 2010 Aaron D.\nWyner Distinguished Service Award of the IEEE Information Theory Society,\nand the 2011 IEEE Richard W. Hamming Medal. Professor Berger is a Life\nFellow of the IEEE, a life member of Tau Beta Pi, a member of the National\nAcademy of Engineering, and an avid amateur blues harmonica player.\n\nLang Tong (S’87–M’91–SM’01–F’05) is the Irwin\nand Joan Jacobs Professor in Engineering at Cornell\nUniversity, Ithaca, New York. He received the B.E.\ndegree from Tsinghua University, Beijing, China,\nin 1985, and M.S. and Ph.D. degrees in electrical\nengineering in 1987 and 1991, respectively, from the\nUniversity of Notre Dame, Notre Dame, Indiana. He\nwas a Postdoctoral Research Afﬁliate at the Infor-\nmation Systems Laboratory, Stanford University in\n1991. He was the 2001 Cor Wit Visiting Professor\nat the Delft University of Technology and had held\n\nvisiting positions at Stanford University, and U.C. Berkeley.\n\nLang Tong’s research is in the general area of statistical inference, com-\nmunications, and complex networks. His current research focuses on energy\nand power systems. He received the 1993 Outstanding Young Author Award\nfrom the IEEE Circuits and Systems Society, the 2004 best paper award from\nIEEE Signal Processing Society, and the 2004 Leonard G. Abraham Prize\nPaper Award from the IEEE Communications Society, and is a coauthor of\nseven student paper awards. He received Young Investigator Award from the\nOfﬁce of Naval Research. He was a Distinguished Lecturer of the IEEE Signal\nProcessing Society.\n\n\f"}, {"id": "894255", "name": ""}]