[{"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5601949", "features": " \n\t\t\tMobile communication; \n\t\t\tMobile computing; \n\t\t\tMobile handsets; \n\t\t\tStrategic planning; \n\t\t\tSupply and demand; \n\t\t\tTechnological innovation; \n\t\t\tWireless sensor networks;", "name": "The future mobile infrastructure: challenges and opportunities [Industry Perspectives]", "author": "Bonomi, F.", "series_t": "October 2010", "genre_s": "IEEE", "id": "1536-1284", "cat": "\n\t\t\tFacing an explosion in traffic demand, driven by the evolution of smart mobile devices exploiting a flat charging model, the infrastructure supporting mobile devices is presented with formidable challenges, but also creative opportunities, which will help manifest the potential of present and future mobile networks. In this short column we explore, at a high level, a number of the challenges and opportunities associated with the mobile infrastructure. In our broad definition, we consider here as part of the mobile infrastructure all the wired networking, storage, and computing elements required to deliver a modern user experience to smart mobile devices (e.g., from base station processing elements, to the high-end IP routers in the core, to the centers supporting content delivery and application processing).\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5074087", "features": " \n\t\t\tfinite element analysis; \n\t\t\treliability; \n\t\t\tsolders; \n\t\t\tthermal management (packaging); \n\t\t\tPb-free reliability; \n\t\t\taging; \n\t\t\tassembly peak temperature; \n\t\t\tfinite element analysis; \n\t\t\tlead-free solder joint reliability; \n\t\t\tpackage design variables; \n\t\t\tpackage types; \n\t\t\tparametric acceleration transforms; \n\t\t\tthermal cycling conditions; \n\t\t\tAcceleration; \n\t\t\tAssembly; \n\t\t\tEnvironmentally friendly manufacturing techniques; \n\t\t\tLead; \n\t\t\tLife estimation; \n\t\t\tLife testing; \n\t\t\tMission critical systems; \n\t\t\tNetwork servers; \n\t\t\tPackaging; \n\t\t\tSoldering;", "name": "Parametric acceleration transforms for lead-free solder joint reliability under thermal cycling conditions", "author": "Ahmad, M.Weidong XieKuo-Chuan LiuJie XueTowne, D.", "series_t": "26-29 May 2009", "genre_s": "IEEE", "id": "978-1-4244-4475-5", "cat": "\n\t\t\tThe conversion to Pb-free solders has already been implemented in the consumer market. However, the transition to Pb-free solders in the high performance, mission critical networking/server industry has not yet been fully implemented. A significant factor in the slow transition to Pb-free solders is the absence of industry accepted Pb-free acceleration transforms that can translate lab test results into field reliability life data. Without such industry accepted acceleration transforms, it is difficult to translate lab test data into reliable predictions of field life performance. In this study, a comprehensive set of test data have been generated over a wide spectrum of package types, solder joint metallurgies, joint size, pitch, die sizes, PCB thicknesses and thermal cycling conditions. The effect of aging on acceleration transforms was also included. The data has been analyzed to compare with existing Pb-free and SnPb acceleration transform models. The data helps explain contradictions in the existing literature, and offers more comprehensive acceleration transforms for Pb-free solders. Some publications indicate that the acceleration transforms for Pb-free solders are the same as SnPb acceleration transforms. Comprehensive results of this study also show that in specific conditions, Pb-free acceleration transforms could even be lower than SnPb acceleration transforms. In addition, the acceleration transforms for backward compatible (Pb-free solders attached with SnPb paste) assemblies are presented as a function of assembly peak temperature. Finally, Finite Element Analysis has also been performed to better understand the effects of the different package design variables on the experimental acceleration transforms. The results have been used to derive recommendations on what package design variables to consider in ensuring good long term Pb-free reliability.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4784878", "features": " \n\t\t\tIPTV; \n\t\t\tmulticast communication; \n\t\t\tIP set-top box; \n\t\t\taccelerating channel changes; \n\t\t\tkey information repetition interval; \n\t\t\tmulticast IPTV; \n\t\t\tmulticast data; \n\t\t\tmulticast session; \n\t\t\tpacket loss; \n\t\t\tsynchronization delay; \n\t\t\tAcceleration; \n\t\t\tCryptography; \n\t\t\tDegradation; \n\t\t\tDelay effects; \n\t\t\tIPTV; \n\t\t\tMulticast protocols; \n\t\t\tProposals; \n\t\t\tSatellite broadcasting; \n\t\t\tScalability; \n\t\t\tUS Department of Transportation;", "name": "A Unified Approach for Repairing Packet Loss and Accelerating Channel Changes in Multicast IPTV", "author": "Begen, A.C.Glazebrook, N.Ver Steeg, W.", "series_t": "10-13 Jan. 2009", "genre_s": "IEEE", "id": "978-1-4244-2308-8", "cat": "\n\t\t\tIn multicast-based IPTV distribution networks, when an IPTV viewer tunes to a new channel, the IP set-top box (STB) joins a new multicast session. Upon join, the IP STB needs to acquire and parse certain key information before it can process any data sent in the multicast session. Depending on the join time, length of the key information repetition interval, size of the key information as well as the application and transport properties, the time lag before the IP STB can usefully consume the multicast data, which we refer to as the synchronization delay, varies and may be large. This is an undesirable phenomenon and degrades the quality of experience perceived by the IPTV viewers. In this study, we describe a unified standards-based approach that can be used both to repair lost packets in real time and reduce the synchronization delay.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4914698", "features": " \n\t\t\tfailure analysis; \n\t\t\tfault diagnosis; \n\t\t\tsystems analysis; \n\t\t\tFMEA; \n\t\t\tfailure effects analysis; \n\t\t\tfailure modes; \n\t\t\tfault insertion testing; \n\t\t\tfault management; \n\t\t\tComputer architecture; \n\t\t\tDesign engineering; \n\t\t\tFailure analysis; \n\t\t\tFault detection; \n\t\t\tHardware; \n\t\t\tPerformance evaluation; \n\t\t\tProduct development; \n\t\t\tSolids; \n\t\t\tSystem testing; \n\t\t\tTaxonomy; \n\t\t\tDiagnostics; \n\t\t\tFIT; \n\t\t\tFault Insertion Test; \n\t\t\tFault Management; \n\t\t\tRequirements;", "name": "FMEA is not enough", "author": "Bidokhti, N.", "series_t": "26-29 Jan. 2009", "genre_s": "IEEE", "id": "978-1-4244-2508-2", "cat": "\n\t\t\tA failure modes and effects analysis is a methodology for analysis of potential failure modes within a system which includes the classification of the failure modes severity and impact on the system. Most organizations stop at the completion of the FMEA and assume that the work is done and a solid design will now be created. It is not always the case. There is a significant amount of work that needs to go into a solid design before and after an FMEA from the fault management (FM) perspective. Also, there are challenges to prove that the content of the FMEA is correct and it will add value to the overall product. The key is to connect the dots that make up a fault management infrastructure. This paper will discuss these points and provide the blue print of their relationships and how to take advantage of each element and effectively connect them to observe their power. This approach provides tangible results that customers can understand and relate to. In addition, it provides clear, straight forward and meaningful results that can not be disputed and can even be tested in the customer environment. After completion of an FMEA, it is important to verify the information provided by the hardware, software and the rest of the FMEA team. Finally, this paper discusses the concept of Fault Insertion Testing or FIT, relation of FIT to FMEA and how FIT enables design engineers and all interested parties to observe if the product is performing as expected. There are different methods for performing FIT. Each method will be discussed at a high level. One of the key differences in the approach being suggested in this paper is the final step of the fault management process which is to tie the FMEA and fault insertion testing together. These two activities complement each other and significantly increase their value by being performed right after one another. The FMEA provides the necessary information such as fault insertion points and the required parameters to execute fault ins- ertion testing.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4810779", "features": " \n\t\t\tadhesives; \n\t\t\tthermal management (packaging); \n\t\t\tconsistent test method; \n\t\t\tnonflat surfaces; \n\t\t\tthermal interface materials; \n\t\t\tthermal pressure sensitive adhesive; \n\t\t\tuniform test conditions; \n\t\t\tvendor data; \n\t\t\tConducting materials; \n\t\t\tCooling; \n\t\t\tData engineering; \n\t\t\tEquations; \n\t\t\tHeat sinks; \n\t\t\tHeat transfer; \n\t\t\tTesting; \n\t\t\tThermal conductivity; \n\t\t\tThermal engineering; \n\t\t\tThermal loading; \n\t\t\tPSA; \n\t\t\tPressure sensitive adhesive; \n\t\t\tTIM; \n\t\t\tthermal interface material;", "name": "Performance characterization of pressure sensitive adhesive thermal interface materials", "author": "Chu, H.Selvakumar, A.", "series_t": "15-19 March 2009", "genre_s": "IEEE", "id": "978-1-4244-3664-4", "cat": "\n\t\t\tAn issue often raised by engineers regarding thermal interface materials (TIM) is that vendor data do not match the results obtained from actual applications. Typical reasons for these issues may be vendor variations in testing, such as variances in test procedure and setup. This study compares vendor data from various vendors with results obtained from both realistic and ideal test conditions under consistent test method and uniform test conditions, in order to eliminate any inconsistencies in testing. This current work examines the performance of thermal pressure sensitive adhesive (PSA) TIMs, and compares the thermal performance of various materials from several vendors. For comparison to vendor data, testing is performed for flat and non-flat surfaces to examine the differences under ideal condition to that of more realistic in actual applications. The test process, results and observations are discussed.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4663925", "features": " \n\t\t\tMarkov processes; \n\t\t\tcognitive radio; \n\t\t\tdecision making; \n\t\t\tradio access networks; \n\t\t\ttelecommunication traffic; \n\t\t\tMarkov decision processes; \n\t\t\tbursty traffic models; \n\t\t\tcognitive radio networks; \n\t\t\tdistributed spectrum sensing; \n\t\t\tenergy constraint; \n\t\t\topportunistic spectrum access; \n\t\t\tsecondary network; \n\t\t\tsequential decision-making; \n\t\t\tCognitive radio; \n\t\t\topportunistic spectrum access; \n\t\t\tpartially observable Markov decision process (POMDP); \n\t\t\tspectrum sensing;", "name": "Distributed Spectrum Sensing and Access in Cognitive Radio Networks With Energy Constraint", "author": "Yunxia ChenQing ZhaoSwami, A.", "series_t": "Feb. 2009", "genre_s": "IEEE", "id": "1053-587X", "cat": "\n\t\t\tWe design distributed spectrum sensing and access strategies for opportunistic spectrum access (OSA) under an energy constraint on secondary users. Both the continuous and the bursty traffic models are considered for different applications of the secondary network. In each slot, a secondary user sequentially decides whether to sense, where in the spectrum to sense, and whether to access. By casting this sequential decision-making problem in the framework of partially observable Markov decision processes, we obtain stationary optimal spectrum sensing and access policies that maximize the throughput of the secondary user during its battery lifetime. We also establish threshold structures of the optimal policies and study the fundamental tradeoffs involved in the energy-constrained OSA design. Numerical results are provided to investigate the impact of the secondary user's residual energy on the optimal spectrum sensing and access decisions.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4839381", "features": " \n\t\t\tInternet; \n\t\t\tquality of service; \n\t\t\trouting protocols; \n\t\t\tsatellite communication; \n\t\t\tCisco Systems, Inc; \n\t\t\tIntelsat IS-14 geostationary satellite; \n\t\t\tInternet Routing In Space Next Generation Global Services; \n\t\t\tInternet protocol; \n\t\t\tInternet routing; \n\t\t\tNext Generation Global Services Space-based Internet; \n\t\t\tgeostationary orbit; \n\t\t\tpayload router; \n\t\t\tquality of service; \n\t\t\tsatellite communication; \n\t\t\tservice level agreement; \n\t\t\tIP networks; \n\t\t\tModems; \n\t\t\tPayloads; \n\t\t\tProtocols; \n\t\t\tQuality management; \n\t\t\tQuality of service; \n\t\t\tRouting; \n\t\t\tSatellite communication; \n\t\t\tSpace technology; \n\t\t\tWeb and internet services;", "name": "Internet Routing in Space: Architectures for Quality of Service", "author": "Connary, J.A.Donner, P.Johnson, J.Thompson, J.", "series_t": "7-14 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2621-8", "cat": "\n\t\t\tEnd-to-End Quality of Service Architectures for Internet Protocol based satellite communication are evolving. Cisco Systems, Inc. Next Generation Global Services Space-based Internet provides an integration challenge for providing end-to-end Quality of Service utilizing the first full Internet Routing in Space payload router located in geostationary orbit. This first Space-Based Internet consists of a payload router/modem ground based terminals and Network Operations Center. The payload is hosted on the Intelsat IS-14 geostationary satellite, due to be launched in 2009. Internet Routing In Space Next Generation Global Services are being developed as a Joint Capability Technology Demonstration for the US Department of Defense. The Space-based Internet introduces an advanced Quality of Service Architecture in support of providing Service Level Agreement based managed services. We first introduce the QoS functionality and propose a simplified QoS model to integrate the components for an end-to-end architecture. Integration challenges are discussed and are being studied in a high fidelity proof of concept lab. Future QoS integration research areas are introduced.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4463774", "features": " \n\t\t\tIEEE standards; \n\t\t\tdata communication; \n\t\t\tlocal area networks; \n\t\t\tmultiprotocol label switching; \n\t\t\tEthernet technologies; \n\t\t\tIEEE 802.1ah; \n\t\t\tMPLS core transport technologies; \n\t\t\tcarrier Ethernet services; \n\t\t\tdata communication field; \n\t\t\tnetwork design considerations; \n\t\t\tservice provider; \n\t\t\tBridges; \n\t\t\tBroadcasting; \n\t\t\tEthernet networks; \n\t\t\tIntegrated circuit interconnections; \n\t\t\tLocal area networks; \n\t\t\tMedia Access Protocol; \n\t\t\tMultiprotocol label switching; \n\t\t\tSpine; \n\t\t\tSwitches; \n\t\t\tVirtual private networks;", "name": "The evolution of carrier ethernet services-requirements and deployment case studies [next-generation carrier ethernet]", "author": "Luyuan FangZhang, R.Taylor, M.", "series_t": "March 2008", "genre_s": "IEEE", "id": "0163-6804", "cat": "\n\t\t\tCarrier Ethernet is one of the fastest growing areas in the data communication field in recent years. In particular, the combination of MPLS core transport technologies in conjunction with IEEE 802.1ah in aggregation is one of the most interesting recent developments in the Carrier Ethernet evolution. This article provides a brief overview of the Ethernet technologies and requirements from the perspective of the service provider. We use three deployment case studies to illustrate the use of different technologies and discuss network design considerations. We identify the important factors influencing network design decisions and the future work in building Carrier Ethernet networks and services.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5070959", "features": " \n\t\t\tsoftware engineering; \n\t\t\tsoftware quality; \n\t\t\tsoftware reliability; \n\t\t\toperational reliability; \n\t\t\tsoftware development; \n\t\t\tsoftware estimation; \n\t\t\tsoftware quality; \n\t\t\tBayesian methods; \n\t\t\tComputer science; \n\t\t\tCosts; \n\t\t\tFeedback; \n\t\t\tProgramming; \n\t\t\tScheduling; \n\t\t\tSoftware engineering; \n\t\t\tSoftware quality; \n\t\t\tUSA Councils; \n\t\t\tWideband;", "name": "The role of judgment in software estimation", "author": "Fraser, StevenBoehm, B.Erdogmus, H.Jorgensen, M.Rifkin, StanRoss, M.", "series_t": "16-24 May 2009", "genre_s": "IEEE", "id": "978-1-4244-3495-4", "cat": "\n\t\t\tThe consequences of poor (or good) judgment in estimation are reflected in software quality, cost, time-to-market, and operational reliability. While judgment plays a prominent role in aviation and medicine - the same care arguably needs to be taken in making tradeoffs impacting software development. This panel will bring together practitioners to discuss aspects of judgment in software estimation including a discussion of current practices and influences from other disciplines.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5032482", "features": " \n\t\t\ttelecommunication network management; \n\t\t\twavelength division multiplexing; \n\t\t\talien wavelengths; \n\t\t\tcommercial management tool; \n\t\t\tdense wavelength division multiplexing; \n\t\t\topen DWDM layer; \n\t\t\toperational solutions; \n\t\t\tBusiness; \n\t\t\tCapacitive sensors; \n\t\t\tIce; \n\t\t\tOptical sensors; \n\t\t\tOptical transmitters; \n\t\t\tRead only memory; \n\t\t\tRemotely operated vehicles; \n\t\t\tRouting; \n\t\t\tTransponders; \n\t\t\tWavelength division multiplexing; \n\t\t\t(060.4250) Networks; \n\t\t\t(060.4259) Networksm packet-switched;", "name": "Operational solutions for an open DWDM layer", "author": "Gerstel, O.Cassata, R.Paraschis, L.Wakim, W.", "series_t": "22-26 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2606-5", "cat": "\n\t\t\tWe discuss operational considerations of implementing alien wavelengths over an open DWDM network, using advanced DWDM system capabilities. We demonstrate feasibility of this solution using a commercial management tool and DWDM system.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5032550", "features": " \n\t\t\tIP networks; \n\t\t\tintegrated optics; \n\t\t\toptical fibre networks; \n\t\t\twavelength division multiplexing; \n\t\t\tIP-optical integration; \n\t\t\tdynamic DWDM network; \n\t\t\tCosts; \n\t\t\tIce; \n\t\t\tIntegrated optics; \n\t\t\tOptical control; \n\t\t\tOptical fiber networks; \n\t\t\tOptical network units; \n\t\t\tOptical switches; \n\t\t\tRouting; \n\t\t\tTelecommunication traffic; \n\t\t\tWavelength division multiplexing; \n\t\t\t(060.4250) Networks; \n\t\t\t(060.4259) Networks, packet-switched;", "name": "IP and optical integration in dynamic networks", "author": "Gerstel, O.", "series_t": "22-26 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2606-5", "cat": "\n\t\t\tDynamic DWDM networking has not been productized in the past despite significant research. We discuss reasons for this, real-world needs for such dynamism, and enabling IP/optical capabilities that will make this technology deployable.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4810739", "features": " \n\t\t\theat pipes; \n\t\t\theat sinks; \n\t\t\tembedded heat pipe; \n\t\t\tfin surfaces; \n\t\t\tintegrated heat sink design; \n\t\t\tthin vapor chamber; \n\t\t\tAluminum; \n\t\t\tCopper; \n\t\t\tFabrication; \n\t\t\tHeat sinks; \n\t\t\tManufacturing processes; \n\t\t\tProcess design; \n\t\t\tResistance heating; \n\t\t\tSolids; \n\t\t\tTemperature; \n\t\t\tThermal resistance; \n\t\t\tThin; \n\t\t\theat pipe; \n\t\t\theat sink; \n\t\t\tvapor chamber;", "name": "Thin vapor chamber heat sink and embedded heat pipe heat sink performance evaluations", "author": "Glover, G.Yongguo ChenLuo, A.Chu, H.", "series_t": "15-19 March 2009", "genre_s": "IEEE", "id": "978-1-4244-3664-4", "cat": "\n\t\t\tVapor chamber and heat pipe technologies are not new concepts, but their fabrication and manufacturing processes have been improving. Both vapor chambers and heat pipes have been getting thinner allowing the integrated heat sink design with increased fin surfaces. For example, for vapor chambers, the minimum achievable thickness has been reduced from 5 mm to 3 mm. These improvements help enhance performance while allowing for consistent performance for a particular product. Understanding the current limits of these technologies between several designs and fabrication processes are the motivation behind this study. Thin vapor chamber base heat sink technologies from different vendors are investigated and compared to embedded heat pipe base heat sinks.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4786446", "features": " \n\t\t\tad hoc networks; \n\t\t\trouting protocols; \n\t\t\twireless channels; \n\t\t\tad hoc routing strategy; \n\t\t\tmultihop cooperative networks; \n\t\t\toptimal routing strategy; \n\t\t\trouting protocols; \n\t\t\twireless channel broadcast; \n\t\t\tAnalytical models; \n\t\t\tDiversity methods; \n\t\t\tFading; \n\t\t\tGovernment; \n\t\t\tRadio broadcasting; \n\t\t\tRelays; \n\t\t\tRouting protocols; \n\t\t\tSpread spectrum communication; \n\t\t\tStochastic processes; \n\t\t\tWireless networks; \n\t\t\tRouting; \n\t\t\tcooperative networks; \n\t\t\tdiversity gain; \n\t\t\tmultihop; \n\t\t\tselective relaying;", "name": "Routing strategies in multihop cooperative networks", "author": "Gui, B.Lin DaiCimini, L.J.", "series_t": "Feb. 2009", "genre_s": "IEEE", "id": "1536-1276", "cat": "\n\t\t\tThe fading characteristics and broadcast nature of wireless channels are usually not fully considered in the design of routing protocols for wireless networks. In this paper, we combine routing and cooperative diversity, with the consideration of a realistic channel model. We focus on a multihop network with multiple relays at each hop, and three routing strategies are designed to achieve the full diversity gain provided by cooperation among the relays. In particular, an optimal routing strategy is proposed to minimize the end-to-end outage, which requires the channel information of all the links and serves as a performance bound. An ad-hoc routing strategy is then proposed based on a hop-by-hop relay selection, which can be easily implemented in a distributed way. As expected, ad-hoc routing performs worse than optimal routing, especially with a large number of hops. To achieve a good complexity-performance tradeoff, an N-hop routing strategy is further proposed, where a joint optimization is performed every N hops. Simulation results are provided which verify the outage analyses of the proposed routing strategies.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5044930", "features": " \n\t\t\tblock codes; \n\t\t\tcorrelation theory; \n\t\t\tdata compression; \n\t\t\timage segmentation; \n\t\t\timage texture; \n\t\t\trate distortion theory; \n\t\t\tvideo coding; \n\t\t\tMAE; \n\t\t\taverage rate threshold; \n\t\t\tblock-based conditional correlation coefficient model; \n\t\t\tcutting-edge video compression technology; \n\t\t\tintra-frame prediction; \n\t\t\tlocal texture; \n\t\t\tmean absolute error; \n\t\t\tnatural video; \n\t\t\toptimal parameter; \n\t\t\toptimal predictive coding; \n\t\t\trate distortion bound; \n\t\t\tspatial-temporal domain; \n\t\t\tDecoding; \n\t\t\tDigital signal processing; \n\t\t\tImage coding; \n\t\t\tPredictive coding; \n\t\t\tPredictive models; \n\t\t\tRate distortion theory; \n\t\t\tRate-distortion; \n\t\t\tTransform coding; \n\t\t\tVideo codecs; \n\t\t\tVideo compression;", "name": "Rate distortion bounds for blocking and intra-frame prediction in videos", "author": "Jing HuGibson, J.D.", "series_t": "8-13 Feb. 2009", "genre_s": "IEEE", "id": "978-1-4244-3990-4", "cat": "\n\t\t\tRecently we proposed a block-based conditional correlation coefficient model for natural videos in the spatial-temporal domain. The conditioning is on local texture and the optimal parameters can be calculated for a specific video with a mean absolute error (MAE) usually smaller than 5%. We used this conditional correlation model and the classic results on conditional rate distortion functions to calculate new theoretical rate distortion bounds for videos which appear to be the only valid theoretical rate distortion bounds with regard to the current cutting-edge video compression technologies such as those standardized in AVC/H.264. In this paper, we focus on utilizing the new block-based local-texture-dependent correlation model to derive rate distortion bounds for blocking and optimal prediction across neighboring blocks. We study the penalty paid in average rate when the correlation among the neighboring blocks is discarded completely or is incorporated partially through predictive coding. We calculate the thresholds in average rate and distortion when incorporating the correlation among the neighboring blocks through optimal predictive coding becomes worse than completely discarding this correlation. We also discuss the role of local texture in inter-frame prediction.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4839382", "features": " \n\t\t\tInternet; \n\t\t\tinternetworking; \n\t\t\tsatellite communication; \n\t\t\ttelecommunication network management; \n\t\t\ttelecommunication network routing; \n\t\t\ttelecommunication traffic; \n\t\t\ttransport protocols; \n\t\t\tInternet routing; \n\t\t\tconfiguration management functions; \n\t\t\tdata traffic; \n\t\t\tnetwork management systems; \n\t\t\tnetwork management traffic; \n\t\t\tsatellite based TCP/IP internetworks; \n\t\t\tspace NMS architecture; \n\t\t\tterrestrial based internetworks; \n\t\t\tBandwidth; \n\t\t\tIP networks; \n\t\t\tInternet; \n\t\t\tIris; \n\t\t\tPayloads; \n\t\t\tQuality management; \n\t\t\tRouting; \n\t\t\tSatellites; \n\t\t\tTCPIP; \n\t\t\tTelecommunication traffic;", "name": "Internet routing in space NMS architecture", "author": "Johnson, J.D.Connary, J.A.Thompson, J.Donner, P.", "series_t": "7-14 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2621-8", "cat": "\n\t\t\tSatellite based TCP/IP internetworks are logical extensions of terrestrial based internetworks and rapidly gaining interest in both commercial and military applications. Suitable network management systems (NMS) tools and techniques are vital in deploying and maintaining such networks effectively. We discuss the management challenges associated with a satellite based TCP/IP internetwork and provide an overview of how NMS will be used to provision, deploy and configure the architectural components of a fixed or transportable ground network. We describe the essential components and some unique features of an NMS solution for such networks.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4810778", "features": " \n\t\t\tadhesion; \n\t\t\tflip-chip devices; \n\t\t\theat sinks; \n\t\t\tintegrated circuit packaging; \n\t\t\tintegrated circuit reliability; \n\t\t\tsealing materials; \n\t\t\tthermal management (packaging); \n\t\t\tflip-chip package technology; \n\t\t\tintegrated heat spreader lids; \n\t\t\tlid adhesion strength; \n\t\t\tlid sealant materials; \n\t\t\tmechanical reliability; \n\t\t\tthermal interface material; \n\t\t\tAdhesives; \n\t\t\tConducting materials; \n\t\t\tGuidelines; \n\t\t\tHeat sinks; \n\t\t\tHeat transfer; \n\t\t\tMechanical factors; \n\t\t\tPackaging; \n\t\t\tRobustness; \n\t\t\tSealing materials; \n\t\t\tThermal force; \n\t\t\tHeat spreader; \n\t\t\tadhesion; \n\t\t\tsealant; \n\t\t\tthermal interface material;", "name": "Interaction between TIM1 and TIM2 for mechanical robustness of integrated heat spreader", "author": "Kearney, A.Li LiSanford, S.", "series_t": "15-19 March 2009", "genre_s": "IEEE", "id": "978-1-4244-3664-4", "cat": "\n\t\t\tIntegrated Heat Spreader (IHS) lids are increasingly being used in flip-chip package technology to enhance power and thermal capabilities. Adequate adhesion of the thermal interface material (TIM) and lid sealant materials are required to not only provide a continuous thermal interface, but also to permit manufacturability. This paper outlines criteria to aid in the material selection process for the first level TIM (TIM1) and the lid sealant to improve its mechanical reliability. It also highlights the importance of understanding the mechanical interaction between the TIM1 and TIM2 layers. A fracture mechanics-based approach is used to provide guidelines for the mechanical properties of the TIM1 and lid sealant material relative to the TIM2. From this modeling, guidelines for lid adhesion strength are defined for a range of package dimensions.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4633347", "features": " \n\t\t\tVLSI; \n\t\t\tcontent-addressable storage; \n\t\t\terror correction codes; \n\t\t\trandom-access storage; \n\t\t\tECC; \n\t\t\tRAM; \n\t\t\tTCAM; \n\t\t\tVLSI silicon technology; \n\t\t\terror-correcting codes; \n\t\t\trandom-access memories; \n\t\t\tternary content addressable memories; \n\t\t\tAlpha particles; \n\t\t\tAssociative memory; \n\t\t\tCams; \n\t\t\tConcatenated codes; \n\t\t\tError correction codes; \n\t\t\tNeutrons; \n\t\t\tRandom access memory; \n\t\t\tRead-write memory; \n\t\t\tSilicon; \n\t\t\tVery large scale integration; \n\t\t\tAssociative memories; \n\t\t\tBridges; \n\t\t\tCache memories; \n\t\t\tECCs; \n\t\t\tFault tolerance; \n\t\t\tLBCs.; \n\t\t\tPerformance and Reliability; \n\t\t\tReliability; \n\t\t\tRouters; \n\t\t\tSemiconductor Memories; \n\t\t\tTCAMs; \n\t\t\tTesting; \n\t\t\tand Fault-Tolerance; \n\t\t\tand serviceability; \n\t\t\tavailability; \n\t\t\tcodes; \n\t\t\tcorrecting; \n\t\t\terror;", "name": "Error-Correcting Codes for Ternary Content Addressable Memories", "author": "Krishnan, S.C.Panigrahy, R.Parthasarathy, S.", "series_t": "Feb. 2009", "genre_s": "IEEE", "id": "0018-9340", "cat": "\n\t\t\tAs VLSI silicon technology continues its relentless advance and memory densities increase, the problem of soft errors--bit upsets caused by alpha particles or neutron hits--demands solutions. Error-correcting codes (ECCs) are routinely used on random-access memories (RAMs) to increase soft error tolerance--codewords (CWs) (ECC bits concatenated to the data) are written to and read from memory, and the read CW is decoded to correct errors. Content addressable memories (CAMs) also demand error mitigation measures. The method employed for RAMs is also applicable to CAMs: the match-line sense amplifier is modified to function as a comparator [1], CWs are stored and searched for. We investigate the extension of this method to ternary CAMs (TCAMs). TCAMs cannot employ the efficient ECCs (known as linear block codes-LBCs) used with RAMs and CAMs. We develop the ECCs necessary to implement error-resilient TCAMs. We prove that the rate (ratio of data bits to total number of bits in the CW) of the specialized ECCs necessary for TCAMs cannot exceed 1/t, where t is the number of bit errors the code can correct (in contrast, LBCs asymptotically have rate one); simple majority codes are the best.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4453954", "features": " \n\t\t\tInternet; \n\t\t\tfeedback; \n\t\t\tquality of service; \n\t\t\ttelecommunication control; \n\t\t\ttelecommunication network routing; \n\t\t\tInternet packets; \n\t\t\tSRAM buffer size; \n\t\t\tfeedback control loop; \n\t\t\thigh-bandwidth packet memory; \n\t\t\thigh-performance scalable quality-of-service-aware memory controller; \n\t\t\tnetwork routers; \n\t\t\toutput queues; \n\t\t\tscalable QoS-aware memory controller; \n\t\t\tBandwidth; \n\t\t\tBuffer storage; \n\t\t\tDelay; \n\t\t\tDynamic scheduling; \n\t\t\tInternet; \n\t\t\tLogic; \n\t\t\tQuality of service; \n\t\t\tRandom access memory; \n\t\t\tRead-write memory; \n\t\t\tScalability; \n\t\t\tHigh-performance memory system; \n\t\t\tmemory controller; \n\t\t\tpacket memory;", "name": "Scalable QoS-Aware Memory Controller for High-Bandwidth Packet Memory", "author": "Hyuk-Jun LeeEui-Young Chung", "series_t": "March 2008", "genre_s": "IEEE", "id": "1063-8210", "cat": "\n\t\t\tThis paper proposes a high-performance scalable quality-of-service (QoS)-aware memory controller for the packet memory where packet data are stored in network routers. A major challenge in the packet memory controller design is to make the design scalable. As the input and output bandwidth requirement and the number of output queues for routers increase, the memory system becomes a bottleneck that limits the performance and scalability. Existing schemes require an input and output buffer that store packet data temporarily before they are written into or read from the memory. With the buffer size proportional to the number of output queues, the buffer becomes a limiting factor for scalability. Our scheme consists of a hashing logic and a reorder buffer whose size is not proportional to the number of output queues and is scalable with the increasing number of output queues. Another major challenge in the packet memory controller design is supporting QoS. As an increasing number of Internet packets become latency sensitive, it is critical that the memory controller is capable of providing different QoS to packets belonging to different classes. To the best of our knowledge, no published work on the packet memory controller supports QoS. In this paper, we show our scheme reduces the SRAM buffer size of the existing schemes by an order of magnitude whereas guaranteeing a packet loss probability as low as 10-20. Our QoS-aware scheduler shows that it meets the latency requirements assigned to multiple service classes under dynamically changing input loads for multiple classes using a feedback control loop.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5074096", "features": " \n\t\t\tRoHS compliance; \n\t\t\tball grid arrays; \n\t\t\tintegrated circuit reliability; \n\t\t\tprinted circuits; \n\t\t\tsolders; \n\t\t\tsurface mount technology; \n\t\t\tPCB; \n\t\t\tRoHS-6 requirements; \n\t\t\tassembly process; \n\t\t\tbackward compatible assembly; \n\t\t\tdiffusion/mixing; \n\t\t\teutectic process; \n\t\t\tlead free BGA; \n\t\t\tproduct feasibility study; \n\t\t\treflow temperatures; \n\t\t\tsolder joint reliability; \n\t\t\tsolder paste; \n\t\t\tsurface mounting; \n\t\t\tthermal cycling; \n\t\t\tAssembly; \n\t\t\tCosts; \n\t\t\tDegradation; \n\t\t\tElectric shock; \n\t\t\tLife estimation; \n\t\t\tPackaging; \n\t\t\tSoldering; \n\t\t\tTemperature; \n\t\t\tTesting; \n\t\t\tTin;", "name": "A product feasibility study of assembling Pb-free BGAs in a eutectic Sn/Pb process", "author": "Logterman, M.Gopalakrishnan, L.", "series_t": "26-29 May 2009", "genre_s": "IEEE", "id": "978-1-4244-4475-5", "cat": "\n\t\t\tAs the industry moves towards meeting the RoHS-6 requirements of eliminating the use of Pb in products, some BGA packages have become available only with Pb-free balls or available with Sn/Pb balls but only at a high cost premium. In many cases, companies are not yet ready to convert existing products to Pb-free. For this reason, the feasibility of using a backwards compatible (BGA balls with Pb-free balls mounted onto boards using eutectic Sn/Pb solder paste) assembly process must be evaluated. Accelerated thermal cycling, bend and shock tests have shown when there is full diffusion/mixing of the Pb in Sn/Pb solder paste with the Pb-free solder balls, there is improved solder joint reliability compared to the same packages assembled using reflow temperatures which did not achieve full mixing. This paper presents the experimental methodology and results of taking an actual ldquomedium complexityrdquo product with a broad size range of 1mm and 1.27mm pitch BGA packages and determining the feasibility of implementing a backward compatible assembly process. The two key considerations in making this determination were (a) the ability to find a process window large enough to repeatedly achieve full solder mixing of all Pb-free BGA packages and (b) achieved without potentially degrading other components or the PCB.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5074044", "features": " \n\t\t\tageing; \n\t\t\tapplication specific integrated circuits; \n\t\t\tball grid arrays; \n\t\t\telectronic products; \n\t\t\tfailure analysis; \n\t\t\tflip-chip devices; \n\t\t\tsolders; \n\t\t\tthermal analysis; \n\t\t\tASIC; \n\t\t\tdynamic performance; \n\t\t\tdynamic shock performance; \n\t\t\telectronic products; \n\t\t\tfailure analysis; \n\t\t\tflip-chip BGA packages; \n\t\t\tintermetallic compounds; \n\t\t\tintermetallics; \n\t\t\tisothermal aging effect; \n\t\t\tlead-free solder joint; \n\t\t\tpad cratering; \n\t\t\ttemperature 100 C; \n\t\t\tAging; \n\t\t\tDegradation; \n\t\t\tEnvironmentally friendly manufacturing techniques; \n\t\t\tIntermetallic; \n\t\t\tIsothermal processes; \n\t\t\tLead; \n\t\t\tMechanical factors; \n\t\t\tPackaging; \n\t\t\tSoldering; \n\t\t\tTin;", "name": "Isothermal aging effects on the dynamic performance of lead-free solder joints", "author": "Hongtao MaTae-Kyu LeeDong Hyun KimSang Ha KimPark, H.G.Kuo-Chuan Liu", "series_t": "26-29 May 2009", "genre_s": "IEEE", "id": "978-1-4244-4475-5", "cat": "\n\t\t\tIsothermal aging effects on lead-free solders have been extensively investigated in recent studies. There is researches show that aging effects will significantly degrade the mechanical properties of lead-free solders. However, very little work been done on the study of aging effects on the board level dynamic performance of lead-free solder joints, especially for large flip-chip BGA packages for ASICs. Due to the extreme sensitivity of aging effects on lead-free solders, it is crucial to investigate the aging effects on the board level dynamic performance of lead-free solders. In this study, dynamic performance of lead-free solder joints has been characterized and the isothermal aging effects have been investigated. It was found that dynamic shock performance of the lead-free FCBGA packages significantly degraded up to 20-35% after aging at varies elevated temperatures. It has also been discovered that aging at 100 degC shows more dramatic degradation than that of aging at 75 degC and 150 degC. It is a very critical finding due to the fact of that many electronic products operate at the 100 degC range for long period of time. The results will provide crucial guidelines in implementation of lead-free solders based on the products end-use conditions. The unique finding of aging effects is related the growth of Cu3Sn and Cu6Sn5 intermetallics after aging. Even though the failure analysis shows mixed failure of pad cratering and intermetallic compounds (IMC) failures, the IMC growth is the most sensitive factor to contribute to the failure observed in this study.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4810270", "features": " \n\t\t\tSPICE; \n\t\t\tdivide and conquer methods; \n\t\t\tintegrated circuit design; \n\t\t\tleakage currents; \n\t\t\tlow-power electronics; \n\t\t\tleakage optimization; \n\t\t\tlow power design flow; \n\t\t\ttransistor-level dual threshold voltage cell library; \n\t\t\tBatteries; \n\t\t\tCMOS technology; \n\t\t\tCircuits; \n\t\t\tConstraint optimization; \n\t\t\tCosts; \n\t\t\tDelay; \n\t\t\tDesign optimization; \n\t\t\tLibraries; \n\t\t\tThreshold voltage; \n\t\t\tTiming; \n\t\t\tcell library; \n\t\t\tleakage; \n\t\t\tlow power; \n\t\t\ttransistor-level dual-Vth;", "name": "Leakage optimization using transistor-level dual threshold voltage cell library", "author": "Nagarajan, C.S.Lin YuanGang QuStamps, B.G.", "series_t": "16-18 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2952-3", "cat": "\n\t\t\tRecently, a transistor level dual-Vth technique has been proposed, where transistors within the same cell are allowed to have different Vth to form the so-call mixed Vth (MVT) cell. However, it is impractical to build a full MVT cell library and include it in the standard dual Vth design flow. To make this practical, current approach adds another design phase after technology mapping to replace high leakage cells with their low leakage MVT variants. We propose a method to seamlessly and effectively integrate transistor-level dual Vth technology into existing low power design flow. This paper reports our successful experience in applying this method to optimize leakage under timing constraints in an industrial design environment. For demonstration purpose, we build an MVT library based on only 15 cells in a standard library that contains 590 cells. On 11 ISCAS benchmarks and three industrial designs, this MVT library optimizes 27% of the design. Yet it gives an average of 9% and up to 25% leakage saving over the state-of-art gate level dual Vth design with a full size high Vth library.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5032486", "features": " \n\t\t\tIP networks; \n\t\t\toptical fibre LAN; \n\t\t\tIP dominated traffic; \n\t\t\tIP networks; \n\t\t\tOTN networks; \n\t\t\tBandwidth; \n\t\t\tCosts; \n\t\t\tEthernet networks; \n\t\t\tExplosions; \n\t\t\tInternet; \n\t\t\tLocal area networks; \n\t\t\tPhysical layer; \n\t\t\tSwitches; \n\t\t\tTelecommunication traffic; \n\t\t\tWide area networks; \n\t\t\t(060.4250) Networks; \n\t\t\t(060.4259) Networks, packet-switched;", "name": "Interworking of IP and OTN networks - making IP over OTN a reality", "author": "Nowell, M.", "series_t": "22-26 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2606-5", "cat": "\n\t\t\tThe transition to IP dominated traffic coinciding with the explosion of traffic is putting bring the interworking of the IP networks and the OTN networks into sharp focus. This paper explores those issues.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4839383", "features": " \n\t\t\tIP networks; \n\t\t\trouting protocols; \n\t\t\tsatellite communication; \n\t\t\tsoftware reliability; \n\t\t\tspace communication links; \n\t\t\tIP router subsystem; \n\t\t\tIRIS IP router operating system; \n\t\t\tIRIS satellite payload; \n\t\t\tInternet protocol router; \n\t\t\tOS image; \n\t\t\tPIGs fly; \n\t\t\tflight hardware; \n\t\t\tinternal verification regimens; \n\t\t\tsoftware reliability; \n\t\t\tspace flight level reliability; \n\t\t\tspace satellite payload; \n\t\t\tspace-borne platform; \n\t\t\tHardware; \n\t\t\tImage generation; \n\t\t\tInternet; \n\t\t\tIris; \n\t\t\tOperating systems; \n\t\t\tPayloads; \n\t\t\tProtocols; \n\t\t\tRouting; \n\t\t\tSatellites; \n\t\t\tSoftware reliability;", "name": "When PIGs Fly - addressing software reliability concerns for the IRIS IP router operating system", "author": "Olson, C.", "series_t": "7-14 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2621-8", "cat": "\n\t\t\tThe effort to place an Internet protocol (IP) router on a space-borne platform has raised concerns regarding the ability to attain space flight level reliability of the router operating system (OS) due to the size of the code involved. Dissecting the code base used to generate the OS image for the IP router subsystem of the IP routing in space (IRIS) satellite payload shows that only relatively small changes are necessary in order to leverage commercial off the shelf code for use on flight hardware. The unchanged portion of code receives considerable execution exposure in both internal verification regimens, and real world networks operations. Testing to establish the reliability of the small set of changed code becomes a much more manageable task making this a low-risk approach to putting a feature-rich network operating system in space.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4797679", "features": " \n\t\t\tInternet; \n\t\t\tbandwidth allocation; \n\t\t\tqueueing theory; \n\t\t\ttelecommunication congestion control; \n\t\t\ttelecommunication traffic; \n\t\t\ttransport protocols; \n\t\t\tCisco Sytems; \n\t\t\tFIFO queueing; \n\t\t\tInternet architecture; \n\t\t\tapproximate fair dropping; \n\t\t\tapproximate weighted max-min fair bandwidth allocations; \n\t\t\tbandwidth management; \n\t\t\tcongestion avoidance mechanisms; \n\t\t\tfair queueing; \n\t\t\tflexible traffic management; \n\t\t\tpacket scheduling algorithms; \n\t\t\tqueue management schemes; \n\t\t\ttransport layer protocol; \n\t\t\tBandwidth; \n\t\t\tChannel allocation; \n\t\t\tIP networks; \n\t\t\tRobustness; \n\t\t\tScheduling algorithm; \n\t\t\tSwitches; \n\t\t\tTelecommunication traffic; \n\t\t\tTraffic control; \n\t\t\tTransport protocols; \n\t\t\tWeb and internet services;", "name": "Approximate fair bandwidth allocation: A method for simple and flexible traffic management", "author": "Rong PanPrabhakar, B.Bonomi, F.Olsen, B.", "series_t": "23-26 Sept. 2008", "genre_s": "IEEE", "id": "978-1-4244-2925-7", "cat": "\n\t\t\tThe Internet architecture uses congestion avoidance mechanisms implemented in the transport layer protocol like TCP to provide good service under heavy load. If network nodes distribute bandwidth fairly, the Internet would be more robust and accommodate a wide variety of applications. Various congestion and bandwidth management schemes have been proposed for this purpose and can be classified into two broad categories: packet scheduling algorithms such as fair queueing (FQ) which explicitly provide bandwidth shares by scheduling packets. They are more difficult to implement compared to FIFO queueing. The second category has active queue management schemes such as RED which use FIFO queues at the routers. They are easy to implement but don't aim to provide (and, in the presence of non-congestion-responsive sources, don't provide) fairness. An algorithm called AFD (approximate fair dropping), has been proposed to provide approximate, weighted max-min fair bandwidth allocations with relatively low complexity. AFD has since been widely adopted by the industry. This paper describes the evolution of AFD from a research project into an industry setting, focusing on the changes it has undergone in the process. AFD now serves as a traffic management module, which can be implemented either using a single FIFO or overlaid on top of extant per-flow queueing structures and which provides approximate bandwidth allocation in a simple fashion. The AFD algorithm has been implemented in several switch and router platforms at Cisco sytems, successfully transitioning from the academic world into the industry.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4463775", "features": " \n\t\t\tlocal area networks; \n\t\t\tmultiprotocol label switching; \n\t\t\tquality of service; \n\t\t\ttransport protocols; \n\t\t\tEthernet transport; \n\t\t\tMPLS; \n\t\t\tcarrier networks; \n\t\t\tnext-generation networks; \n\t\t\tprovider backbone bridging; \n\t\t\tservice provider network; \n\t\t\tBandwidth; \n\t\t\tBridges; \n\t\t\tBroadcasting; \n\t\t\tCustomer service; \n\t\t\tEthernet networks; \n\t\t\tLocal area networks; \n\t\t\tMultiprotocol label switching; \n\t\t\tSpine; \n\t\t\tSwitches; \n\t\t\tTelecommunication traffic;", "name": "Provider backbone bridging and MPLS: complementary technologies for next-generation carrier ethernet transport", "author": "Salam, S.Sajassi, A.", "series_t": "March 2008", "genre_s": "IEEE", "id": "0163-6804", "cat": "\n\t\t\tAlthough provider backbone bridging is sometimes cast as an alternative technology to MPLS for Ethernet transport, the fact is that both technologies can be leveraged to complement one another in a service provider network. This provides the network operator with the best of what each technology has to offer in terms of scalability, manageability, cost, and flexible support for services. An example of the two technologies working in unison is provider backbone bridging interoperating with H-VPLS over networks with an MPLS core. The combined infrastructure leverages the strengths of Ethernet and MPLS with the added advantage of addressing the major shortcomings of standard H-VPLS.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5074163", "features": " \n\t\t\tapplication specific integrated circuits; \n\t\t\tball grid arrays; \n\t\t\tintegrated circuit packaging; \n\t\t\tintegrated circuit reliability; \n\t\t\tASIC; \n\t\t\tBGA; \n\t\t\tHSPICE; \n\t\t\tPowerSI; \n\t\t\tadvanced substrate technologies; \n\t\t\tapplication specific integrated circuit; \n\t\t\tball grid array; \n\t\t\tbaseline test chip; \n\t\t\tcore power noise; \n\t\t\telectrical performance assessment; \n\t\t\thigh speed networking; \n\t\t\tpackaging; \n\t\t\tpower delivery network; \n\t\t\tpower dissipation; \n\t\t\tpower plane impedance; \n\t\t\ttraffic patterns; \n\t\t\tApplication specific integrated circuits; \n\t\t\tComputer applications; \n\t\t\tComputer networks; \n\t\t\tHigh performance computing; \n\t\t\tHigh-speed networks; \n\t\t\tImpedance; \n\t\t\tIntegrated circuit packaging; \n\t\t\tPower dissipation; \n\t\t\tSystem testing; \n\t\t\tTraffic control;", "name": "Electrical performance assessment of advanced substrate technologies for high speed networking applications", "author": "Savic, J.Aria, P.Priest, J.Dugbartey, N.Pomerleau, R.Shanker, B.J.Nagar, M.Lim, J.Sue TengLi LiJie Xue", "series_t": "26-29 May 2009", "genre_s": "IEEE", "id": "978-1-4244-4475-5", "cat": "\n\t\t\tHigh end computing and networking applications continue to drive silicon technologies for higher performance, increased bandwidth and frequency. The drive for higher performance has resulted in increased power dissipation. A method for mitigating power dissipation includes reducing the voltage but unfortunately the consequence is reduced noise margin. This paper evaluates the electrical performance and assess the design trade-offs of two new advanced packaging concepts designed to improve the PDN (Power Delivery Network) in a typical ASIC (Application Specific Integrated Circuit) by introducing features for enhancing core power decoupling and decreasing inductance and impedance in the organic substrate. A baseline test chip was redesigned into two advanced package configurations: (1) a package utilizing a conventional 4-4-4 substrate with SMT components mounted between the BGA (Ball Grid Array) balls, and (2) a package utilizing a 9+1 coreless substrate. A volume production 40 mm times 40 mm BGA package with a 14 times 14 mm functional test chip assembled onto a standard build-up 4-4-4 substrate running different traffic patterns in a networking device was used as the baseline for comparison Substrate level, package level and system level electrical performance tests were performed. Models for power plane impedance and core power noise were extracted using PowerSI and simulated using HSPICE for each new technology and compared to the baseline ASIC. Special test points were designed onto the substrates and custom lids were used to facilitate measurements of the power noise under different traffic patterns and payloads. All results were compared with the production baseline component design.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4927482", "features": " \n\t\t\tMIMO communication; \n\t\t\tantenna arrays; \n\t\t\tblock codes; \n\t\t\tmaximum likelihood decoding; \n\t\t\tspace-time codes; \n\t\t\tMIMO channel; \n\t\t\tchannel phase compensation operation; \n\t\t\tchannel state information; \n\t\t\tcolocated multiple antenna communication; \n\t\t\tmaximum likelihood decoding; \n\t\t\tpartially-coherent relay channel; \n\t\t\tquadrature-phase components; \n\t\t\trelay network; \n\t\t\trelay nodes; \n\t\t\tsingle-symbol decodable; \n\t\t\tsingle-symbol decoding; \n\t\t\tspace-time block code; \n\t\t\tBlock codes; \n\t\t\tChannel state information; \n\t\t\tDigital relays; \n\t\t\tHelium; \n\t\t\tInterleaved codes; \n\t\t\tMIMO; \n\t\t\tMaximum likelihood decoding; \n\t\t\tProtocols; \n\t\t\tSufficient conditions; \n\t\t\tTransmitting antennas; \n\t\t\tAmplify-and-forward protocol; \n\t\t\tcooperative communication; \n\t\t\tdistributed STBC; \n\t\t\tsingle-symbol decoding;", "name": "Single-symbol ML decodable distributed STBCs for partially-coherent cooperative networks", "author": "Sreedhar, D.Chockalingam, A.Rajan, B.S.", "series_t": "May 2009", "genre_s": "IEEE", "id": "1536-1276", "cat": "\n\t\t\tA relay network with N relays and a single source destination pair is called a partially-coherent relay channel (PCRC) if the destination has perfect channel state information (CSI) of all the channels and the relays have only the phase information of the source-to-relay channels. In this paper, first, a new set of necessary and sufficient conditions for a space-time block code (STBC) to be single-symbol decodable (SSD) for colocated multiple antenna communication is obtained. Then, this is extended to a set of necessary and sufficient conditions for a distributed STBC (DSTBC) to be SSD for a PCRC. Using this, several SSD DSTBCs for PCRC are identified. It is proved that even if a SSD STBC for a co-located MIMO channel does not satisfy the additional conditions for the code to be SSD for a PCRC, single-symbol decoding of it in a PCRC gives full-diversity and only coding gain is lost. It is shown that when a DSTBC is SSD for a PCRC, then arbitrary coordinate interleaving of the in-phase and quadrature-phase components of the variables does not disturb its SSD property for PCRC. Finally, it is shown that the possibility of channel phase compensation operation at the relay nodes using partial CSI at the relays increases the possible rate of SSD DSTBCs from 2/N when the relays do not have CSI to 1/2, which is independent of N.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5074095", "features": " \n\t\t\tthermal expansion; \n\t\t\tthermal stresses; \n\t\t\twhiskers (crystal); \n\t\t\tcoefficient of thermal expansion mismatch; \n\t\t\telectronic system reliability; \n\t\t\tenvironmental temperature variations; \n\t\t\tsemiconductor component; \n\t\t\tthermal stresses; \n\t\t\ttin whisker growth risk; \n\t\t\tAssembly; \n\t\t\tCircuit testing; \n\t\t\tCopper alloys; \n\t\t\tLead; \n\t\t\tPackaging; \n\t\t\tPerformance evaluation; \n\t\t\tTemperature distribution; \n\t\t\tThermal force; \n\t\t\tThermal stresses; \n\t\t\tTin;", "name": "Practical assessment of tin whisker growth risk due to environmental temperature variations", "author": "Peng SuLee, C.J.Li LiJie XueKhan, B.Moazeni, R.Hartranft, M.", "series_t": "26-29 May 2009", "genre_s": "IEEE", "id": "978-1-4244-4475-5", "cat": "\n\t\t\tTin (Sn) whisker growth on semiconductor component leads with pure Sn or high Sn-content plating finishes remains to be a reliability concern for electronic system manufacturers. One of the driving forces for whisker growth is thermal stresses in the finishes induced by environmental temperature variations. These stresses are most significant when the leadframe material and the tin finishes have large differences in coefficient of thermal expansion (CTE) mismatch. As a result, excessive environmental temperature variations can increase the risk of whisker growth.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=5074120", "features": " \n\t\t\telectromigration; \n\t\t\tflip-chip devices; \n\t\t\tintegrated circuit interconnections; \n\t\t\tintegrated circuit metallisation; \n\t\t\tsoldering; \n\t\t\tBlack equation; \n\t\t\tSn-Ag; \n\t\t\telectromigration performance; \n\t\t\telectroplated solder bump; \n\t\t\tflip chip solder joint; \n\t\t\tintegrated circuit component; \n\t\t\tlead free flip chip solder bumps; \n\t\t\tCurrent density; \n\t\t\tElectromigration; \n\t\t\tFlip chip; \n\t\t\tFlip chip solder joints; \n\t\t\tIntegrated circuit reliability; \n\t\t\tMetallization; \n\t\t\tPower system reliability; \n\t\t\tTemperature; \n\t\t\tTesting; \n\t\t\tVehicles;", "name": "A comparison study of electromigration performance of Pb-free flip chip solder bumps", "author": "Peng SuLi LiYi-Shao LaiYing-Ta ChiuChin-Li Kao", "series_t": "26-29 May 2009", "genre_s": "IEEE", "id": "978-1-4244-4475-5", "cat": "\n\t\t\tThe electromigration of flip chip solder joints is an ongoing reliability concern for manufacturers of integrated circuit (IC) components and electronic systems. As power levels of ICs continue to increase, current densities within individual solder bumps often increase, along with the operation temperatures of the die surface. Both of these factors have detrimental impact on the electromigration (EM) performance of the solder bumps, as they provide increased driving forces for the diffusion and dissolution of the under bump metallization (UBM) into the solder bumps. Additionally, these changes are occurring concurrently with the transition to Pb-free solder bumps for the next technology node. Compared to commonly used high-Pb bumps, Pb-free bumps typically have reduced lifetime with similar under bump metallization. In this study, a specially designed test vehicle was used to assess the EM performance of Pb-free solder bumps. Electroplated Sn2.6Ag solder bumps were tested with a variety of current density and temperature combinations. Lifetime data were collected for each of the conditions and a prediction model is established using Black's equation. The results were also compared with previous work done on high-Pb and eutectic SnPb bumps using the same test vehicle. From this work, Pb-free solder bumps are shown to have slightly decreased lifetime compared to high-Pb bumps, but still significantly higher than eutectic SnPb solder bumps. With the correct design strategies, including optimized via opening sizes and under bump metallization materials, SnAg Pb-free bumps can provide sufficient reliability for a majority of application conditions.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4804663", "features": " \n\t\t\tcorrelation methods; \n\t\t\timage coding; \n\t\t\toptimisation; \n\t\t\tredundancy; \n\t\t\tsource coding; \n\t\t\tasymptotic performance analysis; \n\t\t\tblock level source splitting; \n\t\t\timage coding; \n\t\t\tjoint optimization; \n\t\t\tlinear prediction; \n\t\t\tmultiple description coding; \n\t\t\tprediction compensation; \n\t\t\tprediction residual encoding; \n\t\t\tredundancy control; \n\t\t\tsource correlation; \n\t\t\ttime-domain lapped transform; \n\t\t\tImage coding; \n\t\t\tlapped transform; \n\t\t\tlinear estimation; \n\t\t\tmultiple description coding (MDC); \n\t\t\trate distortion theory;", "name": "Multiple Description Coding With Prediction Compensation", "author": "Guoqian SunSamarawickrama, U.Jie LiangTian, C.Chengjie TuTran, T.D.", "series_t": "May 2009", "genre_s": "IEEE", "id": "1057-7149", "cat": "\n\t\t\tA new multiple description coding paradigm is proposed by combining the time-domain lapped transform, block level source splitting, linear prediction, and prediction residual encoding. The method provides effective redundancy control and fully utilizes the source correlation. The joint optimization of all system components and the asymptotic performance analysis are presented. Image coding results demonstrate the superior performance of the proposed method, especially at low redundancies.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4757336", "features": " \n\t\t\tdata compression; \n\t\t\tshift registers; \n\t\t\tISCAS-89 benchmark circuit; \n\t\t\tIWLS-05 benchmark circuit; \n\t\t\tdeviation-based LFSR reseeding; \n\t\t\tfeedback polynomial; \n\t\t\tlinear feedback shift register; \n\t\t\ttest-compression solutions; \n\t\t\ttest-data compression; \n\t\t\ttransition faults; \n\t\t\ttransition-fault coverage; \n\t\t\tDefect coverage; \n\t\t\tlinear feedback shift register (LFSR) reseeding; \n\t\t\toutput deviation; \n\t\t\tseed selection; \n\t\t\ttest compression;", "name": "Deviation-Based LFSR Reseeding for Test-Data Compression", "author": "Zhanglei WangHongxia FangChakrabarty, K.Bienek, M.", "series_t": "Feb. 2009", "genre_s": "IEEE", "id": "0278-0070", "cat": "\n\t\t\tLinear feedback shift register (LFSR) reseeding forms the basis for many test-compression solutions. A seed can be computed for each test cube by solving a system of linear equations based on the feedback polynomial of the LFSR. Despite the availability of numerous LFSR-reseeding-based compression methods in the literature, relatively little is known about the effectiveness of these seeds for unmodeled defects, particularly since there are often several candidate seeds for a test cube. We use the recently proposed output deviation measure of the resulting patterns as a metric to select appropriate LFSR seeds. Experimental results are reported using test patterns for stuck-at and transition faults derived from selected seeds for the ISCAS-89 and the IWLS-05 benchmark circuits. These patterns achieve higher coverage for transition and stuck-open faults than patterns obtained using other seed-generation methods for LFSR reseeding. Given a pattern pair (p 1, p 2) for transition faults, we also examine the transition-fault coverage for launch on capture by using p 1 and p 2 to separately compute output deviations. Results show that p 1 tends to be better when there is a high proportion of do-not-care bits in the test cubes, while p 2 is a more appropriate choice when the transition-fault coverage is high.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4839384", "features": " \n\t\t\tquality of service; \n\t\t\tspace communication links; \n\t\t\ttelecommunication network reliability; \n\t\t\ttelecommunication security; \n\t\t\ttransport protocols; \n\t\t\tad-hoc connectivity; \n\t\t\tbundle protocol; \n\t\t\tconvergence layers; \n\t\t\tdeep-space communications; \n\t\t\tdelay-tolerant networks; \n\t\t\tdisrupted networks; \n\t\t\terror detection; \n\t\t\terror-prone networks; \n\t\t\tmilitary tactical environment; \n\t\t\tquality of service; \n\t\t\tsecurity mechanisms; \n\t\t\tstore-and-forward architecture; \n\t\t\ttransport protocols; \n\t\t\tConvergence; \n\t\t\tDisruption tolerant networking; \n\t\t\tInformation security; \n\t\t\tInternet; \n\t\t\tPropagation delay; \n\t\t\tQuality of service; \n\t\t\tResearch and development; \n\t\t\tRobustness; \n\t\t\tTiming; \n\t\t\tTransport protocols;", "name": "A bundle of problems", "author": "Wood, L.Eddy, W.M.Holliday, P.", "series_t": "7-14 March 2009", "genre_s": "IEEE", "id": "978-1-4244-2621-8", "cat": "\n\t\t\tDelay-Tolerant Networkingrdquo (DTN) is a neologism used for a new store-and-forward architecture and protocol suite intended for disrupted networks where there is intermittent or ad-hoc connectivity. This has been proposed as one approach to supporting delay-tolerant networks. Work in the late 1990s on the ldquoInterplanetary Internetrdquo forms the basis for current DTN protocols and architecture. That early work considered transport protocols robust to the hours-long propagation delays of deep-space communications. DTN is also known, primarily in military circles, as Disruption-Tolerant Networking, due to the dynamic links and outages in the military tactical environment, rather than long-delay links. In both cases, DTN technologies are well-suited to applications that are mostly asynchronous and insensitive to large variations in delivery conditions. DTN networks differ sufficiently from traditional terrestrial networks in their characteristics and connectivity that link, network and transport protocols must be carefully considered and chosen to cope with these different characteristics, or new protocols can be designed that are suited for the problems that these DTN network conditions impose. The ldquoBundle Protocolrdquo exists within the DTN architecture, which sends bundles over subnet-specific transport protocols, called ldquoconvergence layers.rdquo ldquoBundlingrdquo has undergone a large amount of shared development and design over a period of years as a research effort. We examine the Bundle Protocol and its related architecture closely, and discuss areas where we have found that the current Bundle approach is not well-suited to many of the operational concepts that it was intended to support. Problems with the Bundle Protocol and its convergence layers exist in mechanisms for error detection and overall reliability. This weakens the Bundle Protocol's suitability to disrupted and error-prone networks. We show that these reliability issues can lead to p- erformance problems in DTN networks, requiring mitigation. Open research and development areas also exist with design choices in handling timing information, in determining necessary and sufficient security mechanisms, in its Quality of Service capabilities, and in other aspects of application or content identification. We show that the existing DTN bundling architecture has a number of open real-world deployment issues that can be addressed. We suggest possible remediation strategies for these weak areas of the bundle protocol that we have been working on. We also look at alternate approaches to DTN networking. Rather than only providing criticism, this paper identifies open issues, where work on modifying the Bundle Protocol is encouraged and approaches to address its various problems are suggested.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4549993", "features": " \n\t\t\tSRAM chips; \n\t\t\tchip scale packaging; \n\t\t\tfatigue; \n\t\t\tfinite element analysis; \n\t\t\theat sinks; \n\t\t\tintegrated circuit interconnections; \n\t\t\tintegrated circuit reliability; \n\t\t\tSRAM; \n\t\t\tchip scale package; \n\t\t\tfailure modes; \n\t\t\tfailure rates; \n\t\t\tfinite element analyses; \n\t\t\theatsink attachment method; \n\t\t\theatsink compressive loading; \n\t\t\tinterconnect metallurgy; \n\t\t\tinterconnect reliability; \n\t\t\tsystem level thermal solution; \n\t\t\tthermal excursions; \n\t\t\tthree dimensional fatigue analyses; \n\t\t\tunderfill material; \n\t\t\tChip scale packaging; \n\t\t\tCooling; \n\t\t\tDielectric materials; \n\t\t\tFinite element methods; \n\t\t\tFlip chip; \n\t\t\tPerformance analysis; \n\t\t\tPerformance evaluation; \n\t\t\tPower system reliability; \n\t\t\tRandom access memory; \n\t\t\tSilicon;", "name": "Impact of system level thermal solution on the interconnect reliability of high performance and high heat dissipating CSP package", "author": "Ahmad, M.Liu, K.C.Lee, C.J.Priest, J.Sung-Ju PakNarasimhan, S.Nagar, M.Jie Xue", "series_t": "27-30 May 2008", "genre_s": "IEEE", "id": "978-1-4244-2230-2", "cat": "\n\t\t\tA custom SRAM was developed for high performance and high reliability network switching applications using 90 nm low-k silicon technology. It is a 13.6 mm x 18.4 mm flip chip chip scale package (CSP) with a 11.12 mm x 16.36 mm die. The package has 838 BGA balls at 0.5 mm pitch. The 0.5 mm ball pitch CSP minimizes electrical package parasitics and enables higher data rate performance. However, the high aspect ratio of the die-to-package area leaves very little room for underfill dispensing and no room for a stiffener ring attachment. In addition, the high heat dissipation of the device requires the use of a metal heatspreader flip chip package as opposed to an overmolded flip chip package solution. The package design coupled with a large die and high I/O count presents significant challenges in the package assembly process and interconnect reliability. A lower glass transition (Tg) underfill material is typically preferred to reduce package warpage and to reduce the stress in the low-k dielectric caused by CTE mismatch between the silicon die and package materials. However, for high power applications where the operating temperature is very close to the underfill Tg, the system level thermal solution must be optimized for improved cooling while at the same time ensuring that the interconnect and package reliability at the system application level is not compromised. In this paper, both Experimental and Finite Element analyses were performed to investigate the key system level thermal solution design parameters that impact package interconnect reliability. The effect of heatsink compressive loading on the thermal excursions, the underfill material, and the interconnect metallurgy was evaluated. In addition to the compressive loading effect, the effect of the heatsink attachment method on interconnect reliability was also investigated. Three dimensional fatigue analyses were performed to derive the hysteresis loops for different test cases, to understand the interactio- n between the heatsink attachment method and the package material and design variables. The finite element model data was benchmarked against experimental data to determine the optimal design conditions for effective thermal cooling without compromising interconnect reliability. Real time pressure measurement and failure analysis were also performed to understand the potential failure modes and failure rates occurring in the system level design. Finally, recommendations are provided on ways to mitigate critical failure modes in the thermal and interconnect design of such complex flip chip CSP packages at the system level.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4459440", "features": " \n\t\t\tasynchronous transfer mode; \n\t\t\texponential distribution; \n\t\t\tmultiprotocol label switching; \n\t\t\tquality of service; \n\t\t\ttelecommunication congestion control; \n\t\t\ttelecommunication traffic; \n\t\t\tCAC scheme; \n\t\t\tFIFO buffer; \n\t\t\tMPLS ATM switch; \n\t\t\tOFF state; \n\t\t\tON state; \n\t\t\tQoS requirements; \n\t\t\texponentially distributed periods; \n\t\t\tmultiprotocol label switching; \n\t\t\tquality of service; \n\t\t\tscalable call admission control algorithm; \n\t\t\tstatistically independent VBR sources; \n\t\t\ttraffic model; \n\t\t\tvariable bit rate sources; \n\t\t\tCall Admission Control (CAC); \n\t\t\tMultiprotocol Label Switching (MPLS); \n\t\t\ttraffic management;", "name": "A Scalable Call Admission Control Algorithm", "author": "Ali, Z.Sheikh, W.Chong, E.K.P.Ghafoor, A.", "series_t": "April 2008", "genre_s": "IEEE", "id": "1063-6692", "cat": "\n\t\t\tIn this paper, we propose a scalable algorithm for connection admission control (CAC). The algorithm applies to a multiprotocol label switching (MPLS) ATM switch with a FIFO buffer. The switch carries data from statistically independent variable bit rate (VBR) sources that asynchronously alternate between ON and OFF states with exponentially distributed periods. The sources may be heterogeneous both in terms of their statistical characteristics (peak cell rate, sustained cell rate, and burst size attributes) as well as their quality of service (QoS) requirements. The performance of the proposed CAC scheme is evaluated using known performance bounds and simulation results. For the purpose of comparison, we also present scalability analyses for some of the previously proposed CAC schemes. Our results show that the proposed CAC scheme consistently performs better and operates the link close to the highest possible utilization level. Furthermore, the scheme scales well with increasing amount of resources (link capacity and buffer size) and accommodates intelligently the mix of traffic offered by sources of diversed burstiness characteristics.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4359406", "features": " \n\t\t\tmultiprocessor interconnection networks; \n\t\t\tnetwork topology; \n\t\t\tparallel architectures; \n\t\t\tparallel machines; \n\t\t\tscheduling; \n\t\t\tBlue Gene/L supercomputer; \n\t\t\tcrossbar interconnect; \n\t\t\thardware-software architectural approach; \n\t\t\tmultitoroidal interconnect; \n\t\t\tmultitoroidal topology; \n\t\t\tscheduling algorithm research; \n\t\t\ttightly coupled supercomputer; \n\t\t\tnetwork topology; \n\t\t\tparallel architectures; \n\t\t\tscheduling and task partitioning;", "name": "Multitoroidal Interconnects For Tightly Coupled Supercomputers", "author": "Aridor, Y.Domany, T.Goldshmidt, O.Kliteynik, Y.Shmueli, E.Moreira, J.E.", "series_t": "Jan. 2008", "genre_s": "IEEE", "id": "1045-9219", "cat": "\n\t\t\tThe processing elements of many modern tightly coupled multicomputers are connected via mesh or toroidal networks. Such interconnects are simple and highly scalable, but suffer from high fragmentation, low utilization, and insufficient fault tolerance when the resources allocated to each job are dedicated. High-dimensional interconnects may be more efficient in certain cases, but are based on complex and expensive components and scale poorly. We present a novel hardware/software architectural approach that detaches the processing elements of the system from the interconnect and augments the traditional toroidal topology to provide additional connectivity options and additional link redundancy. We explore the properties of the new \"multitoroidal\" topology and the improvements it offers in resource utilization and failure tolerance. We present the results of extensive simulation studies to show that for practically important types of workloads, the resource utilization may be increased by 50 percent and, in certain cases, as much as 100 percent compared to toroidal machines and is, in fact, close to the theoretically optimal case of a full crossbar interconnect. The combined hardware/software architectural innovation is a major significant improvement in resource utilization on top of the state of the art in scheduling algorithm research. Also, multitoroidal multicomputers are able to work under link failure rates of 0.002 failures per week that would shut down toroidal machines. A variant of the multitoroidal architecture is implemented in the Blue Gene/L supercomputer.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4609406", "features": " \n\t\t\tcomputer networks; \n\t\t\tmessage passing; \n\t\t\tquality of service; \n\t\t\tsoftware architecture; \n\t\t\ttelecommunication traffic; \n\t\t\tarchitecture extending classification; \n\t\t\tfirewall; \n\t\t\tin-network message streaming; \n\t\t\tin-network programming model; \n\t\t\tload balancer; \n\t\t\tmessage flows; \n\t\t\tmessage streaming network components architecture; \n\t\t\tnetwork identity; \n\t\t\tnetwork platform capability; \n\t\t\tpacket-based classifications; \n\t\t\tprecision timing; \n\t\t\tprogrammable QoS; \n\t\t\tprogrammable handling; \n\t\t\tprotocol; \n\t\t\tsignature recognition; \n\t\t\tApplication software; \n\t\t\tComponent architectures; \n\t\t\tEncapsulation; \n\t\t\tInspection; \n\t\t\tNetwork servers; \n\t\t\tPayloads; \n\t\t\tProtocols; \n\t\t\tTelecommunication traffic; \n\t\t\tTraffic control; \n\t\t\tWeb server; \n\t\t\tIn-Network; \n\t\t\tMessage Streaming; \n\t\t\tNetwork Components Architecture; \n\t\t\tNetwork Programming Model;", "name": "Message Streaming Network Components Architecture and In-Network Programming Model", "author": "Bernstein, D.McDowall, J.Sankar, K.Poon, S.", "series_t": "20-22 Aug. 2008", "genre_s": "IEEE", "id": "978-0-7695-3302-5", "cat": "\n\t\t\tMany network devices implement capabilities to manipulate traffic depending on the application. Examples include a firewall or a load balancer. These are based on Layer 2-4 packet-based classifications such as port or protocol, or signature recognition. Although configurable or extensible via scripting, they are not generally programmable. We present an architecture extending classification to programmable, semantic Layer 5-7 capabilities. The architecture has programmable handling of that classified traffic, which are message flows, not packets. This has led us to a new, in-network message streaming based programming model. Finally, we present a series of network platform capabilities delivered as components, from precision timing to programmable QoS to network identity.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4652126", "features": " \n\t\t\tUHF integrated circuits; \n\t\t\tapplication specific integrated circuits; \n\t\t\telectromagnetic interference; \n\t\t\tintegrated circuit packaging; \n\t\t\tinterference suppression; \n\t\t\tmicrowave integrated circuits; \n\t\t\tthermal management (packaging); \n\t\t\ttransmission line matrix methods; \n\t\t\tASIC IC package; \n\t\t\tEMI mitigation; \n\t\t\tEMI radiation; \n\t\t\tfrequency 1 GHz to 15 GHz; \n\t\t\tgrounded-heatspreader; \n\t\t\thigh-speed SerDes IC package; \n\t\t\tintegrated circuit package; \n\t\t\tnongrounded heat spreader; \n\t\t\toperating clock frequencies; \n\t\t\tthermal heat spreader physical dimensions; \n\t\t\ttransmission line matrix based full wave EM solver; \n\t\t\tunintentional radiators; \n\t\t\tApplication specific integrated circuits; \n\t\t\tClocks; \n\t\t\tElectromagnetic interference; \n\t\t\tElectromagnetic radiation; \n\t\t\tFrequency; \n\t\t\tGrounding; \n\t\t\tHigh speed integrated circuits; \n\t\t\tIntegrated circuit packaging; \n\t\t\tPower transmission lines; \n\t\t\tTransmission line matrix methods; \n\t\t\tEMI; \n\t\t\tHeatspreader; \n\t\t\tIC Package; \n\t\t\tgrounding;", "name": "A study of grounded-heatspreader for EMI mitigation of ASIC IC package", "author": "Bhobe, A.U.Sochoux, P.", "series_t": "18-22 Aug. 2008", "genre_s": "IEEE", "id": "978-1-4244-1699-8", "cat": "\n\t\t\tThe thermal heat spreader (HS) is an essential part of an integrated circuit (IC) package. At SerDes dat rates the physical dimensions of heat spreader and that of the package are comparable to the operating clock frequencies. These structures behave as unintentional radiators and contribute to EMI. In this paper we investigate the radiated emissions of a high-speed SerDes IC package when its HS is grounded to its grounded plane. Using a transmission line matrix based full wave EM solver, it is shown that EMI radiation can be reduced by increasing the number of grounding posts. A 32 grounding post design reduces the total radiated power by 20+ dB in the frequency range of 1 - 15 GHz when compared to a non-grounded heat spreader case. It is also shown that the effectiveness of the grounded lid decreases as we increase the resistance of the posts.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4925813", "features": " \n\t\t\tproduct development; \n\t\t\tproduct life cycle management; \n\t\t\treliability; \n\t\t\tavailability requirements; \n\t\t\tdevelopment life cycle; \n\t\t\tfault management requirements; \n\t\t\tproduct development life cycle; \n\t\t\treliability requirements; \n\t\t\tAvailability; \n\t\t\tBuildings; \n\t\t\tGuidelines; \n\t\t\tHardware; \n\t\t\tProduct design; \n\t\t\tProduct development; \n\t\t\tSoftware development management; \n\t\t\tStandards development; \n\t\t\tTesting; \n\t\t\tTime to market;", "name": "The impact of reliability requirements on development life cycle", "author": "Bidokhti, N.", "series_t": "28-31 Jan. 2008", "genre_s": "IEEE", "id": "978-1-4244-1460-4", "cat": "\n\t\t\tThis paper will discuss the importance of defining reliability and availability requirements upfront and its role in product development life cycle. In addition, it will review how to trace the requirements throughout the product life cycle. In designing a new product, much time and effort is spent defining time to market and functional requirements. In the mean time there is usually less attention paid to reliability, availability and fault management requirements. Therefore, defining clear product reliability & availability requirements becomes an afterthought, or it is only modeled once the product architecture is completed. At the first glance it makes sense, since the design team may not be familiar with reliability, availability and fault management requirements. The team tends to address the functional requirements before any other types of requirements. This is the natural course of action; however this type of thought process will lend itself to building a less desirable product. Knowing these facts, how do we address this necessary and important aspect of a product design as early in the development life cycle process as possible?\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4494711", "features": " \n\t\t\tMarkov processes; \n\t\t\tdecision theory; \n\t\t\terror statistics; \n\t\t\tprobability; \n\t\t\tspread spectrum communication; \n\t\t\tconstrained partially observable Markov decision process; \n\t\t\tjoint design; \n\t\t\topportunistic spectrum access; \n\t\t\tprobability; \n\t\t\tsensing error; \n\t\t\tseparation principle; \n\t\t\tspectrum availability; \n\t\t\tAvailability; \n\t\t\tConferences; \n\t\t\tLaboratories; \n\t\t\tLimiting; \n\t\t\tMilitary computing; \n\t\t\tPhysical layer; \n\t\t\tRobustness; \n\t\t\tSignal processing; \n\t\t\tThroughput; \n\t\t\tWireless communication; \n\t\t\tCognitive radio; \n\t\t\topportunistic spectrum access; \n\t\t\tpartially observable Markov decision process (POMDP);", "name": "Joint Design and Separation Principle for Opportunistic Spectrum Access in the Presence of Sensing Errors", "author": "Yunxia ChenQing ZhaoSwami, A.", "series_t": "May 2008", "genre_s": "IEEE", "id": "0018-9448", "cat": "\n\t\t\tOpportunistic spectrum access (OSA) that allows secondary users to independently search for and exploit instantaneous spectrum availability is considered. The design objective is to maximize the throughput of a secondary user while limiting the probability of colliding with primary users. Integrated in the joint design are three basic components: a spectrum sensor that identifies spectrum opportunities, a sensing strategy that determines which channels in the spectrum to sense, and an access strategy that decides whether to access based on potentially erroneous sensing outcomes. This joint design is formulated as a constrained partially observable Markov decision process (POMDP), and a separation principle is established. The separation principle reveals the optimality of myopic policies for the design of the spectrum sensor and the access strategy, leading to closed-form optimal solutions. Furthermore, it decouples the design of the sensing strategy from that of the spectrum sensor and the access strategy, and reduces the constrained POMDP to an unconstrained one. Numerical examples are provided to study the tradeoff between sensing time and transmission time, the interaction between the physical layer spectrum sensor and the MAC layer sensing and access strategies, and the robustness of the ensuing design to model mismatch.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4629846", "features": " \n\t\t\tbroadband networks; \n\t\t\tmobile handsets; \n\t\t\tmobile radio; \n\t\t\tIT infrastructure; \n\t\t\tcorporate standardization; \n\t\t\thandheld device technologies; \n\t\t\tmobile workers; \n\t\t\tmobile workforce; \n\t\t\twireless broadband; \n\t\t\tBandwidth; \n\t\t\tCommunication system security; \n\t\t\tGSM; \n\t\t\tHandheld computers; \n\t\t\tManufacturing; \n\t\t\tModems; \n\t\t\tMultiaccess communication; \n\t\t\tPortable computers; \n\t\t\tTesting; \n\t\t\tWireless application protocol; \n\t\t\tcommunications; \n\t\t\tinformation technology; \n\t\t\tnetworking; \n\t\t\twireless broadband;", "name": "Considerations for an Efficient Mobile Workforce", "author": "Chou, W.", "series_t": "Sept.-Oct. 2008", "genre_s": "IEEE", "id": "1520-9202", "cat": "\n\t\t\tSupport for mobile workers is an important component of an enterprise's overall IT infrastructure. The rapid evolutions in both wireless broadband and handheld device technologies demand a set of guidelines that provide maximum user benefit while maintaining a manageable support model. This article describes what to consider when evaluating handheld devices for corporate standardization.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4629843", "features": " \n\t\t\tbroadband networks; \n\t\t\tradio networks; \n\t\t\ttelecommunication network reliability; \n\t\t\ttelecommunication security; \n\t\t\tIT professional; \n\t\t\twireless broadband access; \n\t\t\twireless broadband security; \n\t\t\twireless broadband technologies; \n\t\t\tCommunication system security; \n\t\t\tCommunications technology; \n\t\t\tGSM; \n\t\t\tIP networks; \n\t\t\tInformation security; \n\t\t\tMicrowave technology; \n\t\t\tMultiaccess communication; \n\t\t\tPortable computers; \n\t\t\tProtocols; \n\t\t\tWiMAX; \n\t\t\tWireless; \n\t\t\tnetworking; \n\t\t\twimax;", "name": "Wireless Broadband Technologies: Access, Security, and Applications", "author": "Chou, W.Chang, J.M.Wu, S.", "series_t": "Sept.-Oct. 2008", "genre_s": "IEEE", "id": "1520-9202", "cat": "\n\t\t\tIn this paper wireless technologies continue to advance to provide faster, more reliable, and more secure service. The articles in this issue provide case studies and practical information to help the IT professional understand existing wireless broadband options as well as their future direction.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4575103", "features": " \n\t\t\tBiographies; \n\t\t\tBooks; \n\t\t\tCapacity planning; \n\t\t\tCommunication standards; \n\t\t\tData security; \n\t\t\tEngineering management; \n\t\t\tEurope; \n\t\t\tInstruments; \n\t\t\tMonitoring; \n\t\t\tSystems engineering and theory;", "name": "Device Instrumentation for performance monitoring and its application in service level management", "author": "Clemm, AlexanderWolter, Ralf", "series_t": "7-11 April 2008", "genre_s": "IEEE", "id": "978-1-4244-2065-0", "cat": "\n\t\t                 Author(s)                \n\t\t                 \n\t\t                 \t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\n\n\t\n \t\t\t\t\t\n \t\n \t\n \t\n \t\n\t \t\n\t \t\n\t \t\t\n\t \t\n \t\t \t\n \t\t \n \t\t \n \t\n \t\n \t\t\t\t\t\n \t\n \t \t\n   \t\n   \t\t\n   \tClemm, Alexander\n\t\n\n\t\t\t                 \t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tCisco Systems, USA\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t                \t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\n\n\t\n \t\t\t\t\t\n \t\n \t\n \t\n \t\n \t\n \t\t\t\t\t\n \t\n \t \t\n   \t\n   \t\t\n   \tWolter, Ralf\n\t\n\n\t\t\t                 \t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t                \t\t\n\t\t                 \t\n\t\t                 \n\t\t\t\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4509737", "features": " \n\t\t\tcomputer networks; \n\t\t\tscheduling; \n\t\t\ttelecommunication traffic; \n\t\t\tcomputer networks; \n\t\t\tdistinct traffic flows; \n\t\t\thigh-speed packet scheduling systems; \n\t\t\thybrid packet schedulers; \n\t\t\tAlgorithm design and analysis; \n\t\t\tApplication software; \n\t\t\tBandwidth; \n\t\t\tCommunications Society; \n\t\t\tComputational efficiency; \n\t\t\tComputer networks; \n\t\t\tDelay; \n\t\t\tProcessor scheduling; \n\t\t\tScheduling algorithm; \n\t\t\tTelecommunication traffic;", "name": "Design and Analysis of Hybrid Packet Schedulers", "author": "Comer, D.Martynov, M.", "series_t": "13-18 April 2008", "genre_s": "IEEE", "id": "978-1-4244-2025-4", "cat": "\n\t\t\tThis paper addresses the problem of scheduling variable-size packets from large number of distinct traffic flows. Although the problem of fair packet scheduling in computer networks has received thorough theoretical consideration, practical high-speed packet scheduling systems remain elementary. The disparity arises because algorithms with theoretically favorable delay and fairness characteristics have unacceptably high computational cost, while algorithms of low complexity have substantially inferior properties. A variety of hybrid scheduling methods have been proposed as a compromise, but we argue that existing hybrid algorithms are either impractical, or do not provide full spectrum of required features. We then formally define requirements for a packet scheduler and propose a hybrid scheduling algorithm which guarantees these requirements. We develop a theoretical framework to prove that our algorithm indeed provides all the properties claimed.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4528037", "features": " \n\t\t\telectric connectors; \n\t\t\toptical interconnections; \n\t\t\tautomated cleaning system; \n\t\t\theated ionized drying air; \n\t\t\tmultiferrule fiber optic connectors; \n\t\t\tsnow blast; \n\t\t\tsteam blast; \n\t\t\tCleaning; \n\t\t\tConnectors; \n\t\t\tOptical arrays; \n\t\t\tOptical fiber devices; \n\t\t\tOptical fibers; \n\t\t\tSnow; \n\t\t\tSolids; \n\t\t\tStreaming media; \n\t\t\tTesting; \n\t\t\tVacuum systems;", "name": "Development of an Automated Cleaning System for Multi-ferrule Fiber Optic Connectors", "author": "Duffy, J.Hashimoto, D.Sloan, J.Bellegarde, G.", "series_t": "24-28 Feb. 2008", "genre_s": "IEEE", "id": "978-1-55752-856-8", "cat": "\n\t\t\tA novel four stage automated process (a steam blast, CO2 snow blast, vacuum, and heated ionized drying air) has been developed to efficiently clean fiber optic endfaces in high density multi-ferrule connectors.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4675954", "features": " \n\t\t\telectronic engineering education; \n\t\t\telectronics packaging; \n\t\t\tintegrated circuit design; \n\t\t\tintegrated circuit interconnections; \n\t\t\ttraining; \n\t\t\telectrical packaging; \n\t\t\tindustry-oriented curriculum; \n\t\t\tinterconnect; \n\t\t\tsignal integrity engineering; \n\t\t\ttraining curriculum; \n\t\t\tCommunication industry; \n\t\t\tCosts; \n\t\t\tDesign engineering; \n\t\t\tIndustrial training; \n\t\t\tIntegrated circuit interconnections; \n\t\t\tKnowledge engineering; \n\t\t\tPackaging; \n\t\t\tPerformance analysis; \n\t\t\tSignal analysis; \n\t\t\tSignal design;", "name": "An industry-oriented curriculum in the design and performance of electrical packaging and interconnect", "author": "Evans, R.J.Scearce, S.Minjhing Hsieh", "series_t": "27-29 Oct. 2008", "genre_s": "IEEE", "id": "978-1-4244-2873-1", "cat": "\n\t\t\tThe need for education in the performance analysis of electrical package and interconnect is strong in both industrial and academic research environments. While both the industrial and academic environments share much of the same basic theory in this subject, there are two distinct paths for the resulting applications of this knowledge. The industry requirements are detailed, practical skills that can be used immediately, while the education provided by the academic institutions is more focused on basic theory and research skill development. This paper offers a contrast of these approaches, with a more in-depth description of how Cisco systems has developed their own detailed training curriculum in signal integrity engineering.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4420077", "features": " \n\t\t\tdecision making; \n\t\t\tobject-oriented programming; \n\t\t\tsoftware engineering; \n\t\t\tdecision-making tool; \n\t\t\tobject-oriented programming; \n\t\t\tsilver bullet; \n\t\t\tsoftware engineering; \n\t\t\tApplication software; \n\t\t\tBooks; \n\t\t\tLeg; \n\t\t\tObject oriented programming; \n\t\t\tOperating systems; \n\t\t\tProject management; \n\t\t\tSilver; \n\t\t\tSoftware design; \n\t\t\tSoftware engineering; \n\t\t\tSoftware tools; \n\t\t\tFrederick Brooks; \n\t\t\tcomplexity; \n\t\t\tcomputing; \n\t\t\tinformation technology and systems; \n\t\t\torganizational impact; \n\t\t\tproject management; \n\t\t\tsilver bullet; \n\t\t\tsoftware design; \n\t\t\tsoftware engineering;", "name": "No Silver Bullet: Software Engineering Reloaded", "author": "Fraser, S.Mancl, D.", "series_t": "Jan.-Feb. 2008", "genre_s": "IEEE", "id": "0740-7459", "cat": "\n\t\t\tA celebratory panel took place at the 22nd International Conference on object-oriented programming, systems, languages, and applications in Montreal. The occasion was the 20th anniversary of Fred Brooks' paper \"no silver bullet: essence and accidents of software engineering.\" Fred suggested that useful solutions must address inherent complexity observing that object-oriented techniques have come closest to achieving this goal. David described a \"silver bullet\" as a technique that requires no training or experience to apply a silver bullet should find its mark without aim. Software engineering as a discipline has expanded significantly, both in terms of system complexity and the community's global extent. \"no silver bullet\" continues to be both an enjoyable must-read and an influential reference. People use languages without the ideas, so the object community still has much to do. It is nice to know that, when all else fails us, we have an innate decision-making tool to fall back on.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4729304", "features": " \n\t\t\tIP networks; \n\t\t\tforward error correction; \n\t\t\twavelength division multiplexing; \n\t\t\tPMD injection; \n\t\t\tfailure modes; \n\t\t\tforward error correction; \n\t\t\tmechanical disconnection; \n\t\t\tpre-FEC statistics; \n\t\t\tproactive protection; \n\t\t\tpure IP networks; \n\t\t\treal DWDM system; \n\t\t\tConvergence; \n\t\t\tIP networks; \n\t\t\tIntersymbol interference; \n\t\t\tNoise level; \n\t\t\tProtection; \n\t\t\tRouting; \n\t\t\tStatistics; \n\t\t\tSwitches; \n\t\t\tTellurium; \n\t\t\tTesting;", "name": "Proactive protection based on pre-FEC statistics in pure IP networks", "author": "Gerstel, O.Leung, I.Nicholl, G.Sohel, H.Wakim, W.Wollenweber, K.Filsfils, C.Silva, E.Sun, Y.", "series_t": "21-25 Sept. 2008", "genre_s": "IEEE", "id": "978-1-4244-2227-2", "cat": "\n\t\t\tWe extend the implementation of proactive protection to pure IP protection schemes and test its performance over a real DWDM system and additional failure modes: PMD injection and mechanical disconnection.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4528318", "features": " \n\t\t\tIP networks; \n\t\t\terror statistics; \n\t\t\tforward error correction; \n\t\t\ttelecommunication network routing; \n\t\t\ttelecommunication security; \n\t\t\twavelength division multiplexing; \n\t\t\tIPoDWDM networks; \n\t\t\tforward error correction; \n\t\t\tintegrated DWDM interfaces; \n\t\t\tnear-hitless protection scheme; \n\t\t\tnetwork routers; \n\t\t\tpreFEC error statistics; \n\t\t\tArt; \n\t\t\tOptimized production technology; \n\t\t\tProtection; \n\t\t\tRadio access networks; \n\t\t\tRead only memory; \n\t\t\tRouting; \n\t\t\tTellurium;", "name": "Near-Hitless Protection in IPoDWDM Networks", "author": "Gerstel, O.Leung, I.Nicholl, G.Sohel, H.Wakim, W.Wollenweber, K.", "series_t": "24-28 Feb. 2008", "genre_s": "IEEE", "id": "978-1-55752-856-8", "cat": "\n\t\t\tA new protection scheme that takes advantage of integrated DWDM interfaces on routers to enable a near-hitless switchover of traffic from a failing working path to a protection path, using pre-FEC error statistics.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4457111", "features": " \n\t\t\tgrid computing; \n\t\t\tresource allocation; \n\t\t\tcontract-net; \n\t\t\tgrid resource selection; \n\t\t\theterogeneous resources; \n\t\t\tresource selection policies; \n\t\t\tComputer science; \n\t\t\tContracts; \n\t\t\tCosts; \n\t\t\tElectronic mail; \n\t\t\tFinishing; \n\t\t\tIEEE news; \n\t\t\tPerformance evaluation; \n\t\t\tResource management; \n\t\t\tContract Net; \n\t\t\tGrid; \n\t\t\tResource; \n\t\t\tSelection;", "name": "Resource Selection in Grids Using Contract Net", "author": "Goswami, K.Gupta, A.", "series_t": "13-15 Feb. 2008", "genre_s": "IEEE", "id": "978-0-7695-3089-5", "cat": "\n\t\t\tDifferent market mechanisms have been used to match resources with users in grids. In this paper, we propose two simple contract-net based resource selection policies in grids with heterogeneous resources. A detailed experimental evaluation of the policies shows that they perform better than other commonly used policies for many scenarios.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4579909", "features": " \n\t\t\t4G mobile communication; \n\t\t\tgrid computing; \n\t\t\t1xEVDO; \n\t\t\t4G mobile systems; \n\t\t\tBluetooth; \n\t\t\tHSUPA/HSDPA; \n\t\t\tWCDMA; \n\t\t\tmobile wireless grid; \n\t\t\twireless LAN; \n\t\t\t3G mobile communication; \n\t\t\t4G mobile communication; \n\t\t\tCosts; \n\t\t\tIP networks; \n\t\t\tLand mobile radio cellular systems; \n\t\t\tMultiaccess communication; \n\t\t\tSwitches; \n\t\t\tWireless LAN; \n\t\t\tWireless communication; \n\t\t\tWireless networks; \n\t\t\t3G Networks; \n\t\t\t4G Mobile Communications; \n\t\t\tIP;", "name": "4G: Functionalities Development and an Analysis of Mobile Wireless Grid", "author": "Govil, J.Govil, J.", "series_t": "16-18 July 2008", "genre_s": "IEEE", "id": "978-0-7695-3267-7", "cat": "\n\t\t\tWith the emerging innovations in wireless communication networks, it is anticipated that fourth generation mobile systems will be launched within a decade or before. 4G mobile systems focus on seamlessly integrating the existing wireless technologies including WCDMA, HSUPA/HSDPA, 1xEVDO, Wireless LAN, and Bluetooth. 4G systems aspire to support comprehensive and personalized services, providing stable system performance and quality service. However, with ever-changing specifications and standards, developing a prototype that provides the 4G systems' capabilities requires a flexible process. Besides, migrating current systems to 4G presents enormous challenges. This paper intends to deal with the fundamentals and issues of networks, technologies, spectrum, standards, terminals, services of 4G and about the visions that the network operators and service providers see for the evolution of 4G mobile systems. The paper endeavors to make an evaluation on development, transition, and roadmap for fourth generation mobile communication system with a perspective of wireless convergence domain. Finally, a brief discussion on future research issues in 4G is presented.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4554311", "features": " \n\t\t\t4G mobile communication; \n\t\t\tdata communication; \n\t\t\t4G key technologies; \n\t\t\t4G mobile communication systems; \n\t\t\tdata transmission; \n\t\t\tfourth generation mobile communication systems; \n\t\t\tnear-ubiquitous connections; \n\t\t\twireless devices; \n\t\t\t3G mobile communication; \n\t\t\t4G mobile communication; \n\t\t\tBandwidth; \n\t\t\tData communication; \n\t\t\tFast Fourier transforms; \n\t\t\tOFDM; \n\t\t\tRF signals; \n\t\t\tTelecommunication traffic; \n\t\t\tWiMAX; \n\t\t\tWireless mesh networks;", "name": "An empirical feasibility study of 4G&#x2019;s key technologies", "author": "Govil, J.Govil, J.", "series_t": "18-20 May 2008", "genre_s": "IEEE", "id": "978-1-4244-2029-2", "cat": "\n\t\t\tThe race to implement 4G (fourth generation mobile communication systems) is spiraling day by day. Researchers and vendors want to reap the benefits of this new technology. But migration to 4G is full of hurdles as 4G mobile communication systems hold great promise in supporting data transmission rates of upto 100 MB per second and providing wireless devices users with near-ubiquitous connections. Various technologies have been developed and researched for implementing 4G. This paper has attempted to highlight the key challenges in migrating to 4G mobile communication systems. The paper also discusses in short the various key technologies required for implementing for fourth generation mobile communication systems.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4562672", "features": " \n\t\t\tquality of service; \n\t\t\tscheduling; \n\t\t\tQoS Algorithms; \n\t\t\timplementation architectures; \n\t\t\tquality of service; \n\t\t\tscheduling algorithms; \n\t\t\tBiographies; \n\t\t\tHardware; \n\t\t\tLogic; \n\t\t\tQuality of service; \n\t\t\tResearch and development management; \n\t\t\tRouting; \n\t\t\tScheduling algorithm; \n\t\t\tStrontium;", "name": "Quality of Service: Model, Algorithms and Architectures", "author": "Haque, A.", "series_t": "1-3 May 2008", "genre_s": "IEEE", "id": "978-1-4244-2151-0", "cat": "\n\t\t\tSummary form only given. This presentation will define an abstract model for quality of service. It will cover the evolution of QoS algorithms and associated implementation architectures over the years. The different components of a QoS solution will be discussed and various scheduling algorithms will be compared.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4539676", "features": " \n\t\t\tInternet; \n\t\t\tLinux; \n\t\t\ttelecommunication congestion control; \n\t\t\tInternet; \n\t\t\tLinux; \n\t\t\tTCP/IP stack; \n\t\t\tcongestion control; \n\t\t\thigh-speed heterogeneous networks; \n\t\t\tmulti-byte router feedback; \n\t\t\tControl systems; \n\t\t\tInternet; \n\t\t\tLaboratories; \n\t\t\tLinux; \n\t\t\tNational electric code; \n\t\t\tNetwork topology; \n\t\t\tProtocols; \n\t\t\tScalability; \n\t\t\tStability; \n\t\t\tTCPIP;", "name": "Towards Experimental Evaluation of Explicit Congestion Control", "author": "Jain, S.Yueping ZhangLoguinov, D.", "series_t": "2-4 June 2008", "genre_s": "IEEE", "id": "978-1-4244-2084-1", "cat": "\n\t\t\tInnovative efforts to provide a clean-slate design of congestion control for future high-speed heterogeneous networks have recently led to the development of explicit congestion control. These methods (N. Dukkipati, et al., Jun. 2005), (S. Jain, et al., June 2007), (D. Katabi, et al., Aug. 2002), (Y. Zhang, et al., April 2006) rely on multi-byte router feedback and aim to contribute to the design of a more scalable Internet of tomorrow. However, experimental evaluation and deployment experience with these approaches, especially in high- capacity networks and multi-link settings, is still missing from the literature. This paper aims to fill this void and investigate the behavior of these methods in single and multi-link topologies involving real systems and gigabit networks. We implement four recent protocols XCP (D. Katabi, et al., Aug. 2002), JetMax (Y. Zhang, et al., April 2006), RCP (N. Dukkipati, et al., Jun. 2005) and PIQI-RCP (S. Jain, et al., June 2007) in the existing Linux TCP/IP stack (Linux) in a manner that is transparent to applications and conduct experiments in Emulab using a variety of network configurations. Our experiments not only confirm the known behavior of these methods, but also demonstrate their previously undocumented properties.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4359442", "features": " \n\t\t\tcache storage; \n\t\t\tcontent management; \n\t\t\tdata integrity; \n\t\t\tsecurity of data; \n\t\t\ttranscoding; \n\t\t\tcontent adaptation; \n\t\t\tcontent caching; \n\t\t\tcontent filtering; \n\t\t\tcontent services; \n\t\t\tcooperative intermediaries; \n\t\t\tdata integrity; \n\t\t\tdata security; \n\t\t\tsecure content processing; \n\t\t\ttranscoding; \n\t\t\tData sharing; \n\t\t\tDatabase Management; \n\t\t\tDistributed systems; \n\t\t\tSecurity; \n\t\t\tand protection; \n\t\t\tintegrity;", "name": "Efficient and Secure Content Processing and Distribution by Cooperative Intermediaries", "author": "Koglin, Y.Danfeng YaoBertino, E.", "series_t": "May 2008", "genre_s": "IEEE", "id": "1045-9219", "cat": "\n\t\t\tContent services such as content filtering and transcoding adapt contents to meet system requirements, display capacities, or user preferences. Data security in such a framework is an important problem and crucial for many Web applications. In this paper, we propose an approach that addresses data integrity and confidentiality in content adaptation and caching by intermediaries. Our approach permits multiple intermediaries to simultaneously perform content services on different portions of the data. Our protocol supports decentralized proxy and key management and flexible delegation of services. Our experimental results show that our approach is efficient and minimizes the amount of data transmitted across the network.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4698086", "features": " \n\t\t\tXML; \n\t\t\tbenchmark testing; \n\t\t\tquery processing; \n\t\t\tsearch engines; \n\t\t\ttelecommunication traffic; \n\t\t\tXPath engines; \n\t\t\tbenchmarking stream; \n\t\t\tbottleneck isolations; \n\t\t\tservice oriented networking; \n\t\t\tsimultaneous queries; \n\t\t\tstreaming traffics; \n\t\t\tstructured data model; \n\t\t\tData models; \n\t\t\tDatabase languages; \n\t\t\tEngines; \n\t\t\tIntelligent networks; \n\t\t\tRadiofrequency identification; \n\t\t\tScalability; \n\t\t\tSize measurement; \n\t\t\tTime measurement; \n\t\t\tTraffic control; \n\t\t\tXML;", "name": "Benchmarking Stream-Based XPath Engines Supporting Simultaneous Queries for Service Oriented Networking", "author": "Lam, T.C.Poon, S.Ding, J.J.", "series_t": "Nov. 30 2008-Dec. 4 2008", "genre_s": "IEEE", "id": "978-1-4244-2324-8", "cat": "\n\t\t\tStream-based simultaneous XPath processing plays a critical role in service oriented networking, where the processing must scale well in terms of concurrent input streams and number of XPath queries. However, there are no benchmarks or evaluation methodology in existing literatures that benchmark stream-based XPath engines supporting simultaneous queries. In this paper, we describe a novel benchmarking methodology for evaluating XPath engines which handle simultaneous queries on streaming traffics. With structured data model, query model, and control model in our benchmark, we conduct well controlled experiments to assess and isolate various performance factors. We also demonstrate that our structured, quantified approach with wide data set coverage, enables accurate performance measurements, and easy bottleneck isolations of a real-world XPath engine implementation.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4623219", "features": " \n\t\t\tXML; \n\t\t\tdocument handling; \n\t\t\tgrammars; \n\t\t\tDOM model; \n\t\t\tSAX model; \n\t\t\tStAX model; \n\t\t\tVTD model; \n\t\t\tXML document parsing; \n\t\t\tXML processing; \n\t\t\toperational characteristics; \n\t\t\tperformance characteristics; \n\t\t\tApplication software; \n\t\t\tComputer aided instruction; \n\t\t\tComputer languages; \n\t\t\tCosts; \n\t\t\tData analysis; \n\t\t\tDatabases; \n\t\t\tDegradation; \n\t\t\tJava; \n\t\t\tNetwork servers; \n\t\t\tXML; \n\t\t\tXML processing; \n\t\t\tinformation storage and retrieval; \n\t\t\tinformation technology and systems; \n\t\t\tonline information services;", "name": "XML Document Parsing: Operational and Performance Characteristics", "author": "Tak LamDing, J.J.Liu, J.-C.", "series_t": "Sept. 2008", "genre_s": "IEEE", "id": "0018-9162", "cat": "\n\t\t\tParsing is an expensive operation that can degrade XML processing performance. A survey of four representative XML parsing models-DOM, SAX, StAX, and VTD-reveals their suitability for different types of applications.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4455400", "features": " \n\t\t\tcontent-addressable storage; \n\t\t\tlogic gates; \n\t\t\tCAM; \n\t\t\tbit flipping; \n\t\t\tcontent addressable memory; \n\t\t\tdeep sub-micron regime; \n\t\t\tintegrated memory cells; \n\t\t\tpass gate logic; \n\t\t\tsoft error detection;", "name": "Immediate soft error detection using pass gate logic for content addressable memory", "author": "Lee, H.-J.", "series_t": "February 14 2008", "genre_s": "IET", "id": "0013-5194", "cat": "\n\t\t\tContent addressable memory (CAM) is used in many applications. As the process technology scales into the deep sub-micron regime, soft error rate increases significantly. Densely integrated memory cells in CAM are prone to soft errors. Bit flipping in CAM leads to an incorrect search operation which could be fatal from a system point of view. The proposed scheme enables the detection of soft errors immediately and the correction of problems with small additional logic gates.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4550094", "features": " \n\t\t\tball grid arrays; \n\t\t\tcomputational fluid dynamics; \n\t\t\telectronic engineering computing; \n\t\t\tflip-chip devices; \n\t\t\tplastic packaging; \n\t\t\treliability; \n\t\t\tsystem-in-package; \n\t\t\tthermal analysis; \n\t\t\tASIC devices; \n\t\t\tSiP packages; \n\t\t\tcomponent level testing data; \n\t\t\tcomputational fluid dynamics software; \n\t\t\tflip chip PBGA; \n\t\t\tflip chip plastic ball grid array package; \n\t\t\theat spreader; \n\t\t\tmicroprocessor devices; \n\t\t\tmodule assembly yield; \n\t\t\tmodule warpage; \n\t\t\tpackage reliability qualification; \n\t\t\tpackage thermal performance; \n\t\t\treliability; \n\t\t\tsystem in package modules; \n\t\t\tthermal interface materials; \n\t\t\tApplication specific integrated circuits; \n\t\t\tAssembly; \n\t\t\tComputational fluid dynamics; \n\t\t\tFlip chip; \n\t\t\tManufacturing; \n\t\t\tMaterials reliability; \n\t\t\tMicroelectronics; \n\t\t\tPlastic packaging; \n\t\t\tQualifications; \n\t\t\tThermal stresses;", "name": "Effect of thermal interface materials on manufacturing and reliability of Flip Chip PBGA and SiP packages", "author": "Li LiNagar, M.Jie Xue", "series_t": "27-30 May 2008", "genre_s": "IEEE", "id": "978-1-4244-2230-2", "cat": "\n\t\t\tPower and power density increase in microelectronics is a major challenge for packaging high performance ASIC and microprocessor devices. The thermal interface material (TIM) used between the chip and the heat spreader of the Flip Chip Plastic Ball Grid Array (FC-PBGA) package plays a very important role in the package thermal performance. Not only does it affect package thermal performance, it can also affect assembly yield and package reliability during manufacturing and normal operation. In this study attention has been focused on improving thermal performance, manufacturing yield and reliability of the flip-chip PBGA single chip packages and the System in Package (SiP) modules. Computational Fluid Dynamics (CFD) software was used to investigate the effect of TIM on FC-PBGA thermal performance. The effect of thermal interface material was then studied for controlling the interaction between the heat spreader and the FC-PBGA SiP module to reduce module warpage and to improve module assembly yield. Qualification of TIM for FC-PBGA at both the component level and the system level was discussed. Component level testing data showed that the thermal characteristics and mechanical integrity of the TIM selected can be evaluated by using the same stress conditions used in package reliability qualification. Finally, system level non- operational humidity test results showed that good mechanical reliability at the thermal interface of the FC-PBGA can be achieved by optimizing the heat spreader attaching process.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4592463", "features": " \n\t\t\tpower convertors; \n\t\t\tpower system control; \n\t\t\tpower system simulation; \n\t\t\taverage current mode control; \n\t\t\tconverter circuit parameters; \n\t\t\tmulti-phase buck converter modeling; \n\t\t\tpeak current mode control; \n\t\t\tBuck converters; \n\t\t\tCircuits; \n\t\t\tFeedback; \n\t\t\tFrequency conversion; \n\t\t\tInductors; \n\t\t\tPoles and zeros; \n\t\t\tRouting; \n\t\t\tSampling methods; \n\t\t\tTransfer functions; \n\t\t\tVoltage control;", "name": "Modeling Average-Current-Mode-Controlled multi-phase buck converters", "author": "Ruqi Li", "series_t": "15-19 June 2008", "genre_s": "IEEE", "id": "978-1-4244-1667-7", "cat": "\n\t\t\tA new small signal model of average current mode control (ACMC) for multi-phase Buck converters is presented in this paper. The model is an approximation of an existing model with all its parameters expressed explicitly with converter circuit parameters. Because of this, the model reveals valuable insight into the profound influence of current feedback on the converter small signal dynamics. Similarities and differences between the peak current mode control (PCMC) and ACMC can also be distinctly identified with the new model. The model has the advantage of simplicity, yet it is accurate enough to represent the small signal dynamic behavior of the ACMC Buck converters. Experimental results are given to validate the new model.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4549999", "features": " \n\t\t\tSRAM chips; \n\t\t\tball grid arrays; \n\t\t\tfinite element analysis; \n\t\t\tflip-chip devices; \n\t\t\tsemiconductor device reliability; \n\t\t\tcapacity memory package; \n\t\t\tfinite element modeling method; \n\t\t\thigh-performance flip-chip ball grid array; \n\t\t\thigh-speed CSP SRAM; \n\t\t\tinterposer package; \n\t\t\tsolder joint interconnects; \n\t\t\tChip scale packaging; \n\t\t\tFinite element methods; \n\t\t\tProduction; \n\t\t\tProtection; \n\t\t\tPulp manufacturing; \n\t\t\tRandom access memory; \n\t\t\tRobustness; \n\t\t\tSoldering; \n\t\t\tTesting; \n\t\t\tVehicles;", "name": "Manufacturability and reliability of a high-speed CSP SRAM on an interposer package", "author": "Kuo-Chuan LiuPriest, J.Jie XueJarsh LinChin-Li KaoTong Hong WangYi-Shao Lai", "series_t": "27-30 May 2008", "genre_s": "IEEE", "id": "978-1-4244-2230-2", "cat": "\n\t\t\tManufacturability and reliability of a custom CSP SRAM mounted on an interposer is discussed in this paper. In order to provide a reliable device for high reliability applications, an SRAM interposer structure was designed to ensure high reliability on every level of solder joint interconnects. Finite element modeling method was used as a mean to evaluate the reliability of various configurations of the protection methods. Test vehicles were built to run reliability tests on selected configurations from FEA simulation to evaluate the integrity and robustness of the SRAM interposer. An under fill process was chosen to be the protection method in production because of its reliability performance. However, extra efforts are needed for implementation during production in order to address the manufacturability concern.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4600205", "features": " \n\t\t\tchannel estimation; \n\t\t\tcode division multiple access; \n\t\t\tfading channels; \n\t\t\ttime-varying channels; \n\t\t\tchannel coefficients estimation; \n\t\t\tchip-interleaved system; \n\t\t\tcode division multiple access; \n\t\t\tfade-resistant CDMA systems; \n\t\t\tfade-resistant transmission systems; \n\t\t\tinformation symbols; \n\t\t\tperfect channel state information; \n\t\t\tradio channels; \n\t\t\tsignal-to-noise ratio values; \n\t\t\ttime-variations; \n\t\t\twireless channels; \n\t\t\tChannel state information; \n\t\t\tCorrelators; \n\t\t\tFading; \n\t\t\tInterleaved codes; \n\t\t\tMultiaccess communication; \n\t\t\tPerformance analysis; \n\t\t\tSignal to noise ratio; \n\t\t\tState estimation; \n\t\t\tTime varying systems; \n\t\t\tWireless communication; \n\t\t\tCDMA systems; \n\t\t\tRake receiver; \n\t\t\tchannel estimation; \n\t\t\tchip interleaving; \n\t\t\tmultipath fading; \n\t\t\tparallel transmission; \n\t\t\ttime-variations in wireless channels;", "name": "Effects of Time-Variations in Wireless Channels on the Two Different Fade-Resistant CDMA Systems", "author": "Yanxin NaSaquib, M.", "series_t": "August 2008", "genre_s": "IEEE", "id": "1536-1276", "cat": "\n\t\t\tThere are two code division multiple access (CDMA) systems which are capable of adapting to the time-varying nature of radio channels efficiently. In one of these systems, information symbols are transmitted simultaneously and in the other system, information symbols are chip-interleaved before transmission. Both systems exploit temporal variations in the channels so efficiently that depending on the signal-to-noise ratio values, using the estimated channel coefficients they are capable of outperforming the conventional system with perfect channel state information (CSI). In this correspondence, we analyze the relative performance behavior of these two promising fade-resistant CDMA systems. We show that both fade-resistant transmission systems exhibit identical performance when the system load is high. However, when the system load is light, the chip-interleaved system slightly outperforms the system that transmits information symbols simultaneously due to higher self-interference in the latter.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4670486", "features": " \n\t\t\tGaussian processes; \n\t\t\tcapacitance; \n\t\t\tcoaxial waveguides; \n\t\t\tprinted circuits; \n\t\t\tarbitrarily multilayered PCB; \n\t\t\tcapacitance estimation; \n\t\t\tclosed-form equation; \n\t\t\tcoaxial waveguides; \n\t\t\tdigital inductance-capacitance-resistance meter; \n\t\t\tprinted circuit boards; \n\t\t\tsignal vias; \n\t\t\tvector network analyzer; \n\t\t\tAnalytical models; \n\t\t\tCapacitance measurement; \n\t\t\tCoaxial components; \n\t\t\tComputational modeling; \n\t\t\tComputer networks; \n\t\t\tEquations; \n\t\t\tLaboratories; \n\t\t\tPrinted circuits; \n\t\t\tSignal analysis; \n\t\t\tSolid modeling; \n\t\t\tCapacitance of coaxial line; \n\t\t\tcapacitance of signal via with pads in printed circuit board (PCB) with arbitrary stackups; \n\t\t\tcapacitance of thin-conductive circular disk; \n\t\t\tcoaxial waveguides;", "name": "A Closed-Form Equation for Estimating Capacitance of Signal Vias in Arbitrarily Multilayered PCBs", "author": "Pajovic, M.M.", "series_t": "Nov. 2008", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tThis paper provides a significant improvement to the coaxial-line equation that is used for analytical estimation of via capacitance in multilayered printed circuit boards (PCBs) Previously, a pure coaxial-line equation is used for estimating via capacitance with a maximized and minimized number of pads in high-density multilayered PCBs. Now, in the via capacitance equation, both the capacitances associated to via body and via pads in multilayered PCBs with arbitrary stackups are included. Laboratory measurements by a vector network analyzer and digital inductance-capacitance-resistance (LCR) meter, as well as quasi-static and full-wave computational simulations, confirm solid accuracy of the derived equation used for estimating the capacitance of arbitrary signal via geometry common in practice.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4660037", "features": " \n\t\t\tad hoc networks; \n\t\t\tmobile radio; \n\t\t\tmulticast communication; \n\t\t\ttelecommunication congestion control; \n\t\t\ttelecommunication network reliability; \n\t\t\ttransport protocols; \n\t\t\ttrees (mathematics); \n\t\t\tapplication-layer multicast; \n\t\t\tcongestion control; \n\t\t\thop-by-hop multicast transport protocol; \n\t\t\tmobile ad hoc wireless networks; \n\t\t\ttree reliability; \n\t\t\tAd hoc networks; \n\t\t\tBandwidth; \n\t\t\tComputer science; \n\t\t\tIP networks; \n\t\t\tMobile computing; \n\t\t\tMulticast protocols; \n\t\t\tStress; \n\t\t\tTransport protocols; \n\t\t\tUnicast; \n\t\t\tWireless networks;", "name": "Hop-by-hop multicast transport for mobile ad hoc wireless networks", "author": "Pandey, M.Zappala, D.", "series_t": "Sept. 29 2008-Oct. 2 2008", "genre_s": "IEEE", "id": "978-1-4244-2574-7", "cat": "\n\t\t\tMulticast transport is a challenging problem because the source must provide congestion control and reliability for a tree, rather than a single path. This problem is made even more difficult in mobile ad hoc networks due to problems caused by contention, spatial reuse, and mobility. In this paper, we design a hop-by-hop multicast transport protocol, which pushes transport functionality into the core of the network. Although this requires per-flow state, a hop-by-hop approach simplifies congestion control, enables local recovery of lost packets, and provides low delay and efficient use of wireless capacity. We use a simulation study to demonstrate the effectiveness of this approach and compare its efficiency to application-layer multicast.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4606945", "features": " \n\t\t\tapplication specific integrated circuits; \n\t\t\tball grid arrays; \n\t\t\tfinite element analysis; \n\t\t\tintegrated circuit reliability; \n\t\t\tmicroassembling; \n\t\t\tthermal management (packaging); \n\t\t\tASIC package; \n\t\t\tbonding wires; \n\t\t\tcircular shaped indentation; \n\t\t\tdie attach process; \n\t\t\tdie surface; \n\t\t\tfinite element analysis; \n\t\t\theat dissipation; \n\t\t\theat sink interface; \n\t\t\tpackage stress/deformation; \n\t\t\tpower management; \n\t\t\treliability challenges; \n\t\t\tthermal performance; \n\t\t\tthermal resistance; \n\t\t\tthermally conductive epoxy; \n\t\t\tthermally enhanced ball grid array package; \n\t\t\tCopper; \n\t\t\tDeformable models; \n\t\t\tElectronics packaging; \n\t\t\tEnergy management; \n\t\t\tMicroassembly; \n\t\t\tPerformance analysis; \n\t\t\tThermal conductivity; \n\t\t\tThermal management; \n\t\t\tThermal resistance; \n\t\t\tThermal stresses;", "name": "Meeting thermal performance and reliability challenges for a thermally enhanced ball grid array package (TEBGA)", "author": "Quan Qi", "series_t": "28-31 July 2008", "genre_s": "IEEE", "id": "978-1-4244-2739-0", "cat": "\n\t\t\tFor devices with challenging power management requirement, thermally enhanced ball grid array package (TEBGA) offers a good solution, where the device is attached to a heat spreader, usually made of copper, with a thermally conductive epoxy to ensure a good conductive path for heat to escape from the die. The top die surface and bonding wires are covered with an overmolding compound for environmental protection such that heat dissipation is typically limited in that direction. However, TEBGA is not without its unique challenges. In this paper, we present a study on the challenges of meeting the thermal performance and reliability requirements for a ASIC packaged with TEBGA. A localized deformation or ldquodimplerdquo of the TEBGA package is discovered during the package assembly process, where the heat-spreader is noted to have deformed under the die shadow, which results in a circular shaped indentation. This raises concerns about the impact on the thermal performance of the subsequent package to heat sink interface when it is integrated into the system. Solution to this potential problem rests on balancing thermal performance, reducing package stress level & understanding potential long term package reliability. Deformation of the package with each process step will be first described and particular attention will be given to the change of package profile after the die attach process; then a finite element analysis of the stress and deformation of the die attach process is discussed and important parameters affecting the deformation and stress are shown; moreover, a thermal resistance model assessing the thermal budget for this package in a system environment is reviewed and confirmation with numerical analysis & validation by experimental analysis are highlighted; furthermore, an interactive analysis is subsequently performed based on the FEA model for package stress/deformation and thermal resistance model to optimize the packaging solution; finally, b- - alanced solution through this interactive optimization process is summarized and demonstrated in the manufacturing process.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4489134", "features": " \n\t\t\tcorrelation methods; \n\t\t\tfrequency division multiplexing; \n\t\t\tsubcarrier multiplexing; \n\t\t\tOFDM symbol design; \n\t\t\tOFDM systems; \n\t\t\tcorrelation patterns; \n\t\t\tintersubcarrier correlation; \n\t\t\tnondata bearing subcarriers; \n\t\t\tpeak-to-average power ratio reduction; \n\t\t\tApplication software; \n\t\t\tCommunications Society; \n\t\t\tComputational complexity; \n\t\t\tInformation technology; \n\t\t\tInterleaved codes; \n\t\t\tOFDM; \n\t\t\tPartial transmit sequences; \n\t\t\tPeak to average power ratio; \n\t\t\tThroughput; \n\t\t\tUSA Councils;", "name": "OFDM Symbol Design for Peak-to-Average Power Ratio Reduction Employing Non-Data Bearing Subcarriers", "author": "Rajbanshi, R.Wyglinski, Alexander M.Minden, G.J.", "series_t": "March 31 2008-April 3 2008", "genre_s": "IEEE", "id": "978-1-4244-1997-5", "cat": "\n\t\t\tIn this paper, we present a novel peak-to-average power ratio (PAPR) reduction algorithm for OFDM systems employing a symbol balancing approach with several non-data bearing (NDB) subcarriers. The proposed algorithm assigns the NDB subcarriers values that, when combined with interleaving, reduces the long correlation patterns of the input frame that can potentially lead to high PAPR. Furthermore, the proposed algorithm can use either a fixed number of NDB subcarriers or a variable number of NDB subcarriers according to the amount of inter-subcarrier correlation, thus attempting to increase the data throughput of the system. Simulation results for a 256-subcarrier OFDM system employing QPSK symbols and 16 interleavers can achieve a PAPR reduction of 4 dB for a complementary cumulative distribution of 0.01%.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4455720", "features": " \n\t\t\tbiomedical communication; \n\t\t\tdipole antennas; \n\t\t\telectromagnetic wave scattering; \n\t\t\tradio networks; \n\t\t\tbiological tissue; \n\t\t\tflat phantom; \n\t\t\treflection coefficient; \n\t\t\trelative permittivity; \n\t\t\tscattering parameters; \n\t\t\twireless body area networks; \n\t\t\tAntenna measurements; \n\t\t\tBiological system modeling; \n\t\t\tBiological tissues; \n\t\t\tBody sensor networks; \n\t\t\tConductivity; \n\t\t\tHumans; \n\t\t\tImaging phantoms; \n\t\t\tPermittivity measurement; \n\t\t\tReflection; \n\t\t\tScattering parameters; \n\t\t\tDipole antenna; \n\t\t\thomogeneous flat phantom, path loss; \n\t\t\tscattering parameters; \n\t\t\twireless body area network (WBAN);", "name": "Characterization of Scattering Parameters Near a Flat Phantom for Wireless Body Area Networks", "author": "Roelens, L.Joseph, W.Reusens, E.Vermeeren, G.Martens, L.", "series_t": "Feb. 2008", "genre_s": "IEEE", "id": "0018-9375", "cat": "\n\t\t\tIn this paper, the scattering parameters of two dipoles placed closely to a flat, homogeneous, biological tissue are characterized in the 2.4-GHz band. The impact of the presence of a flat phantom and of the height of a dipole above the phantom on the reflection coefficient is analyzed through measurements and simulations. The effect of the type of tissue on the reflection coefficient is also investigated by performing simulations for a range of relative permittivity and conductivity combinations spanning the whole range of human tissues at 2.4 GHz. A semiempirical path loss model, validated by measurements and simulations, is presented for wireless communication, for antenna heights from 2 mm up to 5 cm and antenna separations from 10 to 50 cm. Also, the influence of the relative permittivity and conductivity on the path loss is modeled, leading to a range of possible values and lower and upper boundaries for the path loss as a function of the antenna height. The combination of the range with the boundaries results in a best-case and worst-case path loss model for wireless body area networks. The models are validated with measurements on the torso of a human.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4636892", "features": " \n\t\t\tInternet; \n\t\t\tcomputer network reliability; \n\t\t\tintegrated circuit design; \n\t\t\tneutron effects; \n\t\t\ttelecommunication network routing; \n\t\t\tInternet core router; \n\t\t\tintegrated circuit design; \n\t\t\tline card design; \n\t\t\tneutron beam irradiation; \n\t\t\treliability; \n\t\t\tsilicon design; \n\t\t\tAcceleration; \n\t\t\tComputer architecture; \n\t\t\tCosts; \n\t\t\tHardware; \n\t\t\tInternet; \n\t\t\tMeasurement techniques; \n\t\t\tParticle beams; \n\t\t\tSilicon; \n\t\t\tSoftware systems; \n\t\t\tSystem performance; \n\t\t\tCommunication system reliability; \n\t\t\tcomputer network reliability; \n\t\t\tintegrated circuit design; \n\t\t\tintegrated circuit radiation effects; \n\t\t\tneutron beams; \n\t\t\tneutron radiation effects; \n\t\t\tsingle event upset (SEU);", "name": "Specification and Verification of Soft Error Performance in Reliable Internet Core Routers", "author": "Silburt, A.L.Evans, A.Burghelea, A.Shi-Jie WenWard, D.Norrish, R.Hogle, D.", "series_t": "Aug. 2008", "genre_s": "IEEE", "id": "0018-9499", "cat": "\n\t\t\tThis paper presents a methodology for developing a specification for soft error performance of an integrated hardware/software system that must achieve highly reliable operation. The methodology enables tradeoffs between reliability and cost to be made during the early silicon design and SW architecture phase. An accelerated measurement technique using neutron beam irradiation is also described that ties the final system performance to the reliability model and specification. The methodology is illustrated for the design of a line card for an internet core router.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4739466", "features": " \n\t\t\tinterconnected systems; \n\t\t\tlinear matrix inequalities; \n\t\t\tmultidimensional systems; \n\t\t\tsampled data systems; \n\t\t\tstability; \n\t\t\tinfinite dimensionality; \n\t\t\tlinear matrix inequalities; \n\t\t\tlinear operator inequalities; \n\t\t\tsampled-data interconnected system; \n\t\t\tspace-invariant system; \n\t\t\tstability; \n\t\t\ttime-invariant system; \n\t\t\tControl system synthesis; \n\t\t\tControl systems; \n\t\t\tDigital control; \n\t\t\tDistributed control; \n\t\t\tInterconnected systems; \n\t\t\tLinear matrix inequalities; \n\t\t\tStability; \n\t\t\tState-space methods; \n\t\t\tSufficient conditions; \n\t\t\tSymmetric matrices;", "name": "Analysis of sampled-data interconnected systems", "author": "Chun ZhangDullerud, G.E.", "series_t": "9-11 Dec. 2008", "genre_s": "IEEE", "id": "978-1-4244-3123-6", "cat": "\n\t\t\tIn this paper, we consider the sampled-data problem of interconnected systems, specifically, time- and space-invariant systems. Our main contribution is to provide sufficient conditions on well-posedness, stability, and contractiveness of sampled-data interconnected systems in the form of a group of linear operator inequalities (LOIs). And despite their infinite dimensionality, further reduce them to linear matrix inequalities (LMIs). The technique is also applicable when dynamics are spatially continuous, and measurement and actuation take place in spatially localized patches; namely, when a spatial, rather than temporal, sampled-data arrangement is present.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4783357", "features": " \n\t\t\tIP networks; \n\t\t\tsignalling protocols; \n\t\t\ttelecommunication network reliability; \n\t\t\tInternet protocol; \n\t\t\tM/D/1 performance model; \n\t\t\tM/M/1 performance model; \n\t\t\tPSTN; \n\t\t\tSIP proxy server; \n\t\t\tadopted signaling protocol; \n\t\t\tpublic switched telephone networks; \n\t\t\tsession initiation protocol; \n\t\t\tsignaling system number 7; \n\t\t\tvoice over IP; \n\t\t\tCommunication industry; \n\t\t\tCommunication system signaling; \n\t\t\tIP networks; \n\t\t\tInternet telephony; \n\t\t\tNetwork servers; \n\t\t\tPacket switching; \n\t\t\tProtocols; \n\t\t\tTelecommunication switching; \n\t\t\tWeb and internet services; \n\t\t\tWeb server;", "name": "Comparative Study of M/M/1 and M/D/1 Models of a SIP Proxy Server", "author": "Subramanian, S.V.Dutta, R.", "series_t": "7-10 Dec. 2008", "genre_s": "IEEE", "id": "978-1-4244-2602-7", "cat": "\n\t\t\tIn recent years, transmission of packets over Internet has been a real alternative to the traditional Public Switched Telephone Networks (PSTN). The Internet protocol (IP) offers more flexibility in the design and implementation of features and services. The session initiation protocol (SIP) is a commonly adopted signaling protocol for Voice over IP (VoIP) by many telecommunication industries. Since the signaling system of PSTN, signaling system number 7 (SS7) was designed for high reliability, but IP works on the \"best effort\" basis which motivated us to study the performance characteristics of SIP control plane. In this paper, we studied an M/M/1 performance model of the SIP proxy server, showed its limitations, and designed an alternative M/D/1 performance model that enhances the SIP proxy server performance.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4358656", "features": " \n\t\t\timage texture; \n\t\t\tmedia streaming; \n\t\t\tBaTex3; \n\t\t\tbit allocation; \n\t\t\tfast quality measure; \n\t\t\tgeometric mesh; \n\t\t\thigh-resolution visualization; \n\t\t\timage texture; \n\t\t\tmesh geometry; \n\t\t\tmultiplexed bit stream; \n\t\t\toptimal bit distribution; \n\t\t\ttextured 3D models; \n\t\t\tvisual fidelity; \n\t\t\t3-D graphics; \n\t\t\tBit allocation; \n\t\t\tThree-dimensional (3D) graphics; \n\t\t\tbit allocation; \n\t\t\tmulti-media streaming; \n\t\t\tmultimedia streaming; \n\t\t\toptimization; \n\t\t\tprogressive compression; \n\t\t\tvisual fidelity;", "name": "BaTex3: Bit Allocation for Progressive Transmission of Textured 3-D Models", "author": "Dihong TianAlRegib, G.", "series_t": "Jan. 2008", "genre_s": "IEEE", "id": "1051-8215", "cat": "\n\t\t\tThe efficient progressive transmission of a textured 3D model, which has a texture image mapped on a geometric mesh, requires careful organization of the bit stream to quickly present high-resolution visualization on the user's screen. Bit rates for the mesh and the texture need to be properly balanced so that the decoded model has the best visual fidelity during transmission. This problem is addressed in the paper, and a bit allocation framework is proposed. In particular, the relative importance of the mesh geometry and the texture image on visual fidelity is estimated using a fast quality measure (FQM). Optimal bit distribution between the mesh and the texture is then computed under the criterion of maximizing the quality measured by FQM. Both the quality measure and the bit allocation algorithm are designed with low computation complexity. Empirical studies show that not only the bit allocation framework maximizes the receiving quality of the textured 3D model, but also it does not require sending additional information to indicate bit boundaries between the mesh and the texture in the multiplexed bit stream, which makes the streaming application more robust to bit errors that may occur randomly during transmission.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4528275", "features": " \n\t\t\tIEEE standards; \n\t\t\toptical cables; \n\t\t\t10GBASE-LRM transceivers; \n\t\t\tIEEE 802.3aq LRM based systems; \n\t\t\tlink testing; \n\t\t\tmargin evaluation; \n\t\t\tmultimode fiber cable; \n\t\t\toptical qualification; \n\t\t\tstressed-like sensitivity testing; \n\t\t\tBandwidth; \n\t\t\tEar; \n\t\t\tForce feedback; \n\t\t\tPhotonics; \n\t\t\tSystem testing; \n\t\t\tTechnical drawing; \n\t\t\tTellurium; \n\t\t\tTransmitters;", "name": "Link Testing and Margin Evaluation in IEEE 802.3aq [1] LRM Based Systems", "author": "Tosetti, C.Carter, A.Cunningham, D.G.", "series_t": "24-28 Feb. 2008", "genre_s": "IEEE", "id": "978-1-55752-856-8", "cat": "\n\t\t\tWe examine a way to select a worst case Multi-Mode (MM) fiber cable for stressed-like sensitivity testing during the optical qualification of 10GBASE-LRM transceivers.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4481372", "features": " \n\t\t\tMIMO communication; \n\t\t\tblock codes; \n\t\t\tcode division multiple access; \n\t\t\tdiversity reception; \n\t\t\treceiving antennas; \n\t\t\tspace-time codes; \n\t\t\ttransmitting antennas; \n\t\t\tMIMO systems; \n\t\t\tV-BLAST system; \n\t\t\thigh spectral efficiency; \n\t\t\tlow-complexity detector; \n\t\t\tmulticarrier CDMA systems; \n\t\t\tnear-exponential diversity; \n\t\t\tnonorthogonal space-time block codes; \n\t\t\tper-bit complexity; \n\t\t\treceive antennas; \n\t\t\ttransmit antennas;", "name": "A Low-Complexity Detector for Large MIMO Systems and Multicarrier CDMA Systems", "author": "Vardhan, K.Mohammed, S.K.Chockalingam, A.Rajan, B.S.", "series_t": "April 2008", "genre_s": "IEEE", "id": "0733-8716", "cat": "\n\t\t\tWe consider large MIMO systems, where by 'large' we mean number of transmit and receive antennas of the order of tens to hundreds. Such large MIMO systems will be of immense interest because of the very high spectral efficiencies possible in such systems. We present a low-complexity detector which achieves uncoded near-exponential diversity performance for hundreds of antennas (i.e., achieves near SISO AWGN performance in a large MIMO fading environment) with an average per-bit complexity of just O(NtNr), where Nt and Nr denote the number of transmit and receive antennas, respectively. With an outer turbo code, the proposed detector achieves good coded bit error performance as well. For example, in a 600 transmit and 600 receive antennas V-BLAST system with a high spectral efficiency of 450 bps/Hz (using BPSK and rate-3/4 turbo code), our simulation results show that the proposed detector performs to within about 7 dB from capacity. This practical feasibility of the proposed high-performance, low-complexity detector could potentially trigger wide interest in the theory and implementation of large MIMO systems. We also illustrate the applicability of the proposed detector in the low-complexity detection of high-rate, non-orthogonal space-time block codes and large multicarrier CDMA (MC-CDMA) systems. In large MC-CDMA systems with hundreds of users, the proposed detector is shown to achieve near single-user performance at an average per-bit complexity linear in number of users, which is quite appealing for its use in practical CDMA systems.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4511657", "features": " \n\t\t\tIP networks; \n\t\t\tcable television; \n\t\t\tIPTV architecture; \n\t\t\tcable video network architecture; \n\t\t\tCable TV; \n\t\t\tCommunication cables; \n\t\t\tDigital video broadcasting; \n\t\t\tHigh definition video; \n\t\t\tIP networks; \n\t\t\tIPTV; \n\t\t\tMotion pictures; \n\t\t\tTV broadcasting; \n\t\t\tVideo compression; \n\t\t\tVideo on demand;", "name": "IPTV Systems, Standards and Architectures: Part II - IPTV Architectures for Cable Systems: An Evolutionary Approach", "author": "Vasudevan, S.V.Xiaomei LiuKollmansberger, K.", "series_t": "May 2008", "genre_s": "IEEE", "id": "0163-6804", "cat": "\n\t\t\tIPTV systems are beginning to be deployed by telcos, to compete with cable and other television service providers. While cable network spectral bandwidths are larger than their wireline equivalents, bandwidth-consuming services such as HDTV are quickly filling this spectrum, prompting cable operators to consider video switching options as a means to increase programming capacity. This article examines the cable video network architecture, and in particular new emerging technologies that can provide cable networks with the means to transition to an IPTV architecture.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4528272", "features": " \n\t\t\tIP networks; \n\t\t\toptical fibre networks; \n\t\t\twavelength division multiplexing; \n\t\t\tG.709 wrapper; \n\t\t\tIP-over-DWDM networking; \n\t\t\tLANPHY; \n\t\t\talien-wavelength; \n\t\t\tcarrier DWDM infrastructure; \n\t\t\trouter interface; \n\t\t\tBandwidth; \n\t\t\tDelta modulation; \n\t\t\tEar; \n\t\t\tLocal area networks; \n\t\t\tOptical fiber communication; \n\t\t\tRobustness; \n\t\t\tTechnological innovation; \n\t\t\tTelecommunication traffic; \n\t\t\tTellurium; \n\t\t\tWavelength division multiplexing;", "name": "Demonstration and evaluation of IP-over-DWDM networking as \"alien-wavelength\" over existing carrier DWDM infrastructure", "author": "Ventorini, D.Moura, E.Paraschis, L.Gerstel, O.Silva, M.Wollenweber, K.Silverio, A.J.Henrique, P.P.Silva, L.A.C.", "series_t": "24-28 Feb. 2008", "genre_s": "IEEE", "id": "978-1-55752-856-8", "cat": "\n\t\t\tWe demonstrate IP-over-DWDM networking as \"alien-wavelength\" over Embratel's existing DWDM infrastructure, with robust transmission, and fully functional standards-based OAM&P. While the router interface is LANPHY based, OAM&P is achieved via a G.709 wrapper.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4579606", "features": " \n\t\t\tcache storage; \n\t\t\tmemory architecture; \n\t\t\tmulti-threading; \n\t\t\tshared memory systems; \n\t\t\tCPU-intensive application; \n\t\t\tI/O-intensive application; \n\t\t\tIntel dual quad-core Xeon E5335 processor; \n\t\t\tdual quad-core based application oriented networking system; \n\t\t\thierarchical cache architecture; \n\t\t\tonchip processor counter; \n\t\t\tperformance characterization; \n\t\t\tshared memory based communication latency; \n\t\t\tApplication software; \n\t\t\tBandwidth; \n\t\t\tComputer science; \n\t\t\tCounting circuits; \n\t\t\tDelay; \n\t\t\tMicroarchitecture; \n\t\t\tMulticore processing; \n\t\t\tSockets; \n\t\t\tThroughput; \n\t\t\tYarn; \n\t\t\tApplication Oriented Networking; \n\t\t\tMulti-Core Processors; \n\t\t\tOn-Chip Counters; \n\t\t\tPerformance Evaluation;", "name": "Performance Characterization of a Dual Quad-Core Based Application Oriented Networking System", "author": "Waheed, A.Ding, J.J.Jingnan YaoBhuyan, L.N.", "series_t": "12-14 June 2008", "genre_s": "IEEE", "id": "978-0-7695-3187-8", "cat": "\n\t\t\tIn this paper, we investigate performance characteristics of an Application Oriented Networking (AON) system based on Intelpsilas dual quad-core Xeon E5335 processors. This dual quad-core based AON system has unique hierarchical cache architecture, mainly local, neighboring, and remote L2 caches. Using on-chip processor counters, we observe that shared memory based communication latency between a pair of threads is non-uniform depending on theircore affinities, which may vary by more than an order of magnitude. In addition, we show that CPU-intensive applications scale better than I/O-intensive applications as the number of processor cores increases.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4595672", "features": " \n\t\t\tautomatic test pattern generation; \n\t\t\tdata compression; \n\t\t\tdecoding; \n\t\t\tfault simulation; \n\t\t\tindustrial property; \n\t\t\tdynamic compaction; \n\t\t\tembedded deterministic test; \n\t\t\tfault simulation; \n\t\t\tintellectual property cores; \n\t\t\tinterleaved test generation; \n\t\t\ton-chip decoder; \n\t\t\tscan slices; \n\t\t\tselective encoding; \n\t\t\ttest data compression; \n\t\t\tATE pattern repeat; \n\t\t\tIP cores; \n\t\t\tscan slice; \n\t\t\ttest data compression;", "name": "Test Data Compression Using Selective Encoding of Scan Slices", "author": "Zhanglei WangChakrabarty, K.", "series_t": "Nov. 2008", "genre_s": "IEEE", "id": "1063-8210", "cat": "\n\t\t\tWe present a selective encoding method that reduces test data volume and test application time for scan testing of intellectual property (IP) cores. This method encodes the slices of test data that are fed to the scan chains in every clock cycle. To drive N scan chains, we use only c tester channels, where c=lceillog2(N+1)rceil+2 . In the best case, we can achieve compression by a factor of N/c using only one tester clock cycle per slice. We derive a sufficient condition on the distribution of care bits that allows us to achieve the best-case compression. We also derive a probabilistic lower bound on the compression for a given care-bit density. Unlike popular compression methods such as embedded deterministic test (EDT), the proposed approach is suitable for IP cores because it does not require structural information for fault simulation, dynamic compaction, or interleaved test generation. The on-chip decoder is small, independent of the circuit under test and the test set, and it can be shared between different circuits. We present compression results for a number of industrial circuits and compare our results to other recent compression methods targeted at IP cores.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4567071", "features": " \n\t\t\tradiation hardening (electronics); \n\t\t\treliability; \n\t\t\tSEU fit; \n\t\t\tmicroelectronic devices; \n\t\t\tradiation hardening; \n\t\t\treliability requirements; \n\t\t\tsoft error rate; \n\t\t\tCircuits; \n\t\t\tError analysis; \n\t\t\tError correction; \n\t\t\tManufacturing; \n\t\t\tMicroelectronics; \n\t\t\tPerformance analysis; \n\t\t\tPerformance evaluation; \n\t\t\tReliability engineering; \n\t\t\tSingle event upset; \n\t\t\tSystem testing; \n\t\t\tFIT; \n\t\t\tSingle Event; \n\t\t\tSingle Event Transient; \n\t\t\tSingle Event Upset; \n\t\t\tSoft Error; \n\t\t\tSoft Error Rate;", "name": "A Systematical Method of Quantifying SEU FIT", "author": "Shi-Jie WenAlexandrescu, D.Perez, R.", "series_t": "7-9 July 2008", "genre_s": "IEEE", "id": "978-0-7695-3264-6", "cat": "\n\t\t\tWe present a practical, systematical method for the evaluation of the soft error rate (SER) of microelectronic devices. Existing methodologies, practices and tools are integrated in a common approach while highlighting the need for specific data or tools. The showcased method is particularly adapted for evaluating the SER of very complex microelectronic devices by engineers confronted to increasingly demanding reliability requirements.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4581351", "features": " \n\t\t\tdisasters; \n\t\t\tremote sensing; \n\t\t\tsatellite communication; \n\t\t\tspace communication links; \n\t\t\ttelecommunication network routing; \n\t\t\tCLEO router; \n\t\t\tCisco mobile access router; \n\t\t\tIP networks; \n\t\t\tInternet; \n\t\t\tInternet Protocol; \n\t\t\tdisaster monitoring; \n\t\t\tsatellite communication; \n\t\t\tspace communication; \n\t\t\ttelecommunication routing;", "name": "Routing in space", "author": "Wood, Lloyd", "series_t": "12-12 June 2008", "genre_s": "IET", "id": "978-0-86341-922-5", "cat": "\n\t\t\tA collection of slides presented by Lloyd Wood on routing in space is given.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4534093", "features": " \n\t\t\telectronic messaging; \n\t\t\tintelligent networks; \n\t\t\tnetwork servers; \n\t\t\tresource allocation; \n\t\t\tscheduling; \n\t\t\tCisco Systems; \n\t\t\tapplication oriented networking systems; \n\t\t\tapplication-level content; \n\t\t\tback-end servers; \n\t\t\theterogeneous server cluster; \n\t\t\tintelligent information network; \n\t\t\tintelligent message scheduling; \n\t\t\tload balancing schemes; \n\t\t\tuser-perceived response time; \n\t\t\tClustering algorithms; \n\t\t\tDelay; \n\t\t\tIntelligent networks; \n\t\t\tIntelligent structures; \n\t\t\tLoad management; \n\t\t\tNetwork servers; \n\t\t\tNext generation networking; \n\t\t\tScheduling algorithm; \n\t\t\tSwitches; \n\t\t\tThroughput;", "name": "Intelligent Message Scheduling in Application Oriented Networking Systems", "author": "Jingnan YaoDing, J.J.Bhuyan, L.N.", "series_t": "19-23 May 2008", "genre_s": "IEEE", "id": "978-1-4244-2075-9", "cat": "\n\t\t\tCisco Systems application oriented networking (AON) product is an important network element towards building next generation service oriented intelligent information network (IIN). AON processes application-level content and moves far beyond a conventional content-aware Web switch. It creates a novel content delivery platform and allows more sophisticated load balancing schemes to be deployed in a switch among back-end servers to reduce user-perceived response time. In this paper, we investigate different scheduling techniques for an AON system to maximize overall throughput and minimize latency per message for a heterogeneous server cluster consisting of different application servers. Based on a thorough evaluation of the three existing load balancing algorithms of AON, we propose a novel message type based service adaptive scheduling algorithm that makes AON more efficient and more intelligent. Systematic performance measurements, analyses, and comparisons are conducted to demonstrate the superiority of our intelligent message scheduling technique.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4387797", "features": " \n\t\t\tsequences; \n\t\t\twireless channels; \n\t\t\twireless sensor networks; \n\t\t\tmultipath channel; \n\t\t\tsequence-based localization; \n\t\t\tshadowing effect; \n\t\t\twireless channel; \n\t\t\twireless sensor network; \n\t\t\tFading; \n\t\t\tFingerprint recognition; \n\t\t\tHardware; \n\t\t\tHeart; \n\t\t\tLeast squares approximation; \n\t\t\tRadio frequency; \n\t\t\tRobustness; \n\t\t\tShadow mapping; \n\t\t\tWireless networks; \n\t\t\tWireless sensor networks; \n\t\t\tWireless sensor networks; \n\t\t\tarrangement of lines.; \n\t\t\tlocalization; \n\t\t\tlocation sequence;", "name": "Sequence-Based Localization in Wireless Sensor Networks", "author": "Yedavalli, K.Krishnamachari, B.", "series_t": "Jan. 2008", "genre_s": "IEEE", "id": "1536-1233", "cat": "\n\t\t\tWe introduce a novel sequence-based localization technique for wireless sensor networks. We show that the localization space can be divided into distinct regions that can each be uniquely identified by sequences that represent the ranking of distances from the reference nodes to that region. For n reference nodes in the localization space, combinatorially, O(n\") sequences are possible, but we show that, due to geometric constraints, the actual number of feasible location sequences is much lower: only O(n 4). Using these location sequences, we develop a localization technique that is robust to random errors due to the multipath and shadowing effects of wireless channels. Through extensive systematic simulations and a representative set of real mote experiments, we show that our lightweight localization technique provides comparable or better accuracy than other state-of-the-art radio signal strength-based localization techniques over a range of wireless channel and node deployment conditions.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4359935", "features": " \n\t\t\tfault diagnosis; \n\t\t\tintegrated circuit testing; \n\t\t\tdeep submicrometer defects; \n\t\t\tdefect screening; \n\t\t\tfault model; \n\t\t\tfault-oriented test generation; \n\t\t\toutput-deviation-based reordering; \n\t\t\tprobabilistic-fault model; \n\t\t\tspeed functional testing; \n\t\t\tsteeper coverage curves; \n\t\t\ttest-pattern reordering; \n\t\t\ttest-quality-cost optimization; \n\t\t\tAbort-on-first-fail; \n\t\t\tdefect coverage; \n\t\t\ttest selection; \n\t\t\ttest-application time; \n\t\t\ttest-pattern grading;", "name": "Test-Quality/Cost Optimization Using Output-Deviation-Based Reordering of Test Patterns", "author": "Zhanglei WangChakrabarty, K.", "series_t": "Feb. 2008", "genre_s": "IEEE", "id": "0278-0070", "cat": "\n\t\t\tAt-speed functional testing, delay testing, and n-detection test sets are being used today to detect deep submicrometer defects. However, the resulting test data volumes are too high; the 2005 International Roadmap for Semiconductors predicts that test-application times will be 30 times larger in 2010 than they are today. In addition, many new types of defects cannot be accurately modeled using existing fault models. Therefore, there is a need to model the quality of test patterns such that they can be quickly assessed for defect screening. Test selection is required to choose the most effective pattern sequences from large test sets. Current industry practice for test selection is based on fault grading, which is computationally expensive and must also be repeated for every fault model. Moreover, although efficient methods exist today, for fault-oriented test generation, there is a lack of understanding on how best to combine the test sets thus obtained, i.e., derive the most effective union of the individual test sets without simply taking all the patterns for each fault model. This paper presents the use of the output deviation as a surrogate coverage-metric for pattern modeling and test grading. A flexible, but general, probabilistic-fault model is used to generate a probability map for the circuit, which can subsequently be used for test-pattern reordering. The output deviations resulting from the probability map(s) are used as a coverage-metric to model test patterns; the higher the deviation, the better the quality of the test pattern. We show that, for the ISCAS benchmark circuits and as compared to other reordering methods, the proposed method provides ldquosteeperrdquo coverage curves for different fault models.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4712385", "features": " \n\t\t\tdata compression; \n\t\t\tparameter estimation; \n\t\t\treal-time systems; \n\t\t\tsignal detection; \n\t\t\tvideo coding; \n\t\t\tH.264 video compression; \n\t\t\taccurate parameter estimation; \n\t\t\tfading scene detection; \n\t\t\tmultiplicative factor; \n\t\t\treal-time encoding; \n\t\t\tscene encoding; \n\t\t\tstatistics calculations; \n\t\t\tweighted prediction; \n\t\t\tDelay; \n\t\t\tEncoding; \n\t\t\tFading; \n\t\t\tLayout; \n\t\t\tMathematical model; \n\t\t\tParameter estimation; \n\t\t\tReal time systems; \n\t\t\tRobustness; \n\t\t\tStatistics; \n\t\t\tVideo compression; \n\t\t\tH.264; \n\t\t\tWeighted prediction; \n\t\t\tfade detection; \n\t\t\tvideo compression;", "name": "Accurate parameter estimation and efficient fade detection for weighted prediction in H.264 video compression", "author": "Rui ZhangCote, G.", "series_t": "12-15 Oct. 2008", "genre_s": "IEEE", "id": "978-1-4244-1765-0", "cat": "\n\t\t\tWeighted prediction is a useful tool in video compression to encode scenes with lighting changes, such as fading scenes. Estimating weighted prediction parameters has been extensively discussed in the literature, however no mathematical model has been proposed. Moreover, the detection of the fading scenes in a real-time encoding system has received little attention. This paper addresses both of these aspects. An accurate parameter estimation algorithm for H.264 encoding is first derived for both the multiplicative factor and the additive offset based on a fading model. An efficient algorithm is then proposed to detect fade in a real-time encoding system, with simple statistics calculations, very low storage requirement, and low encoding delay. Simulation results show very accurate detection and compression gains of 5-30% over existing techniques.\n\t\t"}, {"manu": "http://ieeexplore.ieee.org/xpl/articleDetails.jsp?tp=&arnumber=4711594", "features": " \n\t\t\tbuilt-in self test; \n\t\t\tfault diagnosis; \n\t\t\tlogic testing; \n\t\t\tmicroprocessor chips; \n\t\t\tCPU interface; \n\t\t\tTAP interface; \n\t\t\tdeep submicron silicon process technology; \n\t\t\tproduct debugging; \n\t\t\tproduct testing; \n\t\t\tsystem level LBIST implementation; \n\t\t\tsystem-level testing; \n\t\t\tBuilt-in self-test; \n\t\t\tCentralized control; \n\t\t\tCircuit testing; \n\t\t\tClocks; \n\t\t\tEnergy consumption; \n\t\t\tLogic testing; \n\t\t\tRouting; \n\t\t\tSilicon; \n\t\t\tSystem testing; \n\t\t\tVehicle crash testing; \n\t\t\tLBIST; \n\t\t\tLow power; \n\t\t\tX-source isolation;", "name": "System Level LBIST Implementation", "author": "Fei ZhuangJunbo JiaXiangfeng Li", "series_t": "24-27 Nov. 2008", "genre_s": "IEEE", "id": "978-0-7695-3396-4", "cat": "\n\t\t\tIn industry, chips become more and more complicated as advancing in deep submicron silicon process technology. LBIST can cover some newly emerging faults missed by traditional ATPG. That's why LBIST is becoming more and more popular. Besides launching LBIST through TAP interface, CPU launch LBIST feature may provide more flexibility for system-level or product testing and debugging. System engineer can easily kick-off LBIST with CPU interface instead of TAP.\n\t\t"}]